[
  {
    "id": "236af19d-ada2-46af-8adc-e3ea02bb8457",
    "title": "항해 플러스 10주차 (항해99 항해 플러스 후기)",
    "short_description": "항해 플러스 10주차 일지.",
    "body": "### 1) 항해 플러스를 참여하기 전에는\n\n&nbsp 나는 스파르타 코딩클럽에서 진행 되는 개발 부트캠프 중 하나인 '이노베이션 캠프'에서 리액트를 배웠고 운이 좋게 취업해서 현재 10개월 째 핀테크 스타트업에서 프론트엔드 개발자로 일하고 있는 아주 평범한 사람이다.\n\n### 2) 항해 플러스 1기에 합류하기로 결심한 이유\n\n&nbsp 항해 플러스 1기에 합류하기로 한 가장 큰 이유는 '성장에 대한 욕심'이였다. 점점 취업이나 이직 시에 주니어 개발자에게 요구되는 능력치도 높아지고 있고 나 또한 역시 높은 곳으로 올라가고 싶었기 때문에 퇴근 하고 나서나 주말에도 꾸준히 사이드 프로젝트나 개인적으로 스터디를 하며 지내왔었다. 하지만 아무래도 막히는 부분이 생겼을 때 혼자서는 해결하기 힘든 부분도 많았고 그렇게 지내던 중 우연히 퇴근길에 내가 공부하고 싶었던 내용들만 쏙쏙 집어서 알려주는 항해 플러스를 알게 되었고 한치의 망설임도 없이 합류를 결정했다.~~(사실 10분 정도는 고민했다.)~~\n\n### 3) 항해 플러스가 실제로 좋았던 부분\n\n&nbsp 항해 플러스에 좋은 점은 여러가지가 있지만 그 중 제일 좋은 점을 꼽자면 나는 현직 시니어 개발자분들과의 멘토링 시간을 꼽을 것 같다. 현재 다니고 있는 직장에도 물론 좋은 개발자분들이 계시고 모르는 부분이 생길 때 마다 조언을 얻고 있지만 그럼에도 풀리지 않는 문제는 분명히 존재했고 내가 앞으로 가야할 방향성에 대한 갈피 또한 쉽게 잡히지 않았다. 하지만 매주 현직 시니어 개발자분들의 멘토링을 받으면서 이러한 문제들을 해결해 나갈 수 있었고 앞으로의 방향성 또한 확립할 수 있었다. 한번은 멘토링을 받고나서 감탄하며 '아 진짜 오길 잘했다.'라는 말을 육성으로 뿜었던 적도 있다. 뿐만 아니라 진행하고 있는 프로젝트에 관련 된 부분만이 아닌 다방면에서 궁금한 점들도 알려주시며 혹시나 잘 모르시는 분야라면 다른 지인 개발자분들께 물어서라도 알려주시기 때문에 더 좋았던 것 같다.\n\n### 4) 결과물\n\nTDD를 적용하여 구현 하였으며 CI/CD 및 통합 모니터링 시스템이 적용된 NestJs 백엔드 서버\n- https://github.com/0110-delivery-system\n\n오픈소스 contribute에 도전한 기록\n- https://whispering-digestion-6d4.notion.site/Chapter5-0c81575c5a3c4b4fa593529cc349d894?pvs=4\n\n\n### 5) 앞으로 더 도전해보고 싶은 것\n\n&nbsp 이제는 배운 걸 토대로 그동안 미뤄왔던 개인 블로그 프로젝트를 진행하려고 한다. 언젠가 풀스택으로의 길을 걷게되면 시작하려고 했는데 개발을 한지 1년도 안된 시점에서 도전을 하게 될 줄은 몰랐지만 뭐 결과적으로는 잘 된 일인 것 같다. 그동안 배운 CI/CD, 테스트 자동화 등 여러가지를 접목시켜서 개인 블로그를 만들어서 완성되면 velog에서 내가 만든 블로그로 이사를 가보려 한다.\n\n### 6) 소감 및 항해 플러스를 고민하는 분들에게 한마디\n\n&nbsp 지금 이글을 보시는 분이 항해 플러스를 고민하고 계시다면 지금 바로 신청하시면 좋을 것 같다. ~~(고민하는 지금이 제일 싸다.)~~는 농담이고 이런 분들이 신청하시면 좋을 것 같다.\n\n- 개발에 대한 욕심히 넘처 흘러서 바닥을 적시시는 분\n- 주니어 개발자간에 네트워킹이 하고 싶으나 어떻게 해야할 지 모르겠는 분.\n- 현직에서 기술적으로 막히는 부분이 있는데 도움을 얻기 어려우신 분.\n- 앞으로의 공부 방향성이나 커리어의 방향성에 대한 도움이 필요하신 분.\n\n개인적으로 나는 항해 플러스를 하면서 앞으로의 공부 방향성을 잡을 수 있었고 현직에서 풀리지 않았던 문제도 많이 풀었다. 또한 불과 몇달전만해도 나는 그냥 프론트엔드 개발자였던 반면 이제는 간단한 서버도 구축할 수 있는 **'백엔드에 대한 이해'**가 있는 프론트엔드 개발자로 성장했다.~~(아직 풀스택이라고 하기에는 좀...)~~ 그래서 백엔드 과정이라고 해서 프론트엔드 개발자분들이 지원하지 않은 일이 없었으면 한다. 실제로도 **'백엔드에 대한 이해'**는 프론트엔드 개발자에게도 꼭 필요한 덕목이라고 생각하기 때문이다. 그래서 결론은 항해 플러스 합류를 고민하고 계시다면 망설이지 말고 지금 **'Go'**\n\n![](https://velog.velcdn.com/images/blaze096/post/29e2fde9-5906-4181-8036-963de6e462b3/image.png)\n",
    "created_at": "2023-08-20T14:37:28.196Z",
    "updated_at": "2026-01-10T07:24:46.581Z",
    "url_slug": "항해-플러스-10주차-항해99-항해-플러스-후기",
    "tags": [
      "typescript",
      "개발자사이드프로젝트",
      "주니어개발자",
      "주니어개발자멘토링",
      "주니어개발자역량강화",
      "코딩부트캠프",
      "코딩부트캠프후기",
      "항해99",
      "항해플러스"
    ]
  },
  {
    "id": "f7f5d754-fe0f-4bd9-9ce6-4555ef590c7d",
    "title": "항해 플러스 9주차",
    "short_description": "항해 플러스 9주차 일지.",
    "body": "&nbsp 저번 주에 이어 오픈소스 주차가 이어졌다. 이번 주에는 총 2개의 오픈소스에 컨트리뷰트에 도전했다.\n\n1. JDD \n\n&nbsp 사실 애초에 JDD에 하려고 한 것은 아니였다. 지난 주 항해 플러스에서 특강을 해주신 SWC의 개발자분께서 SWC의 경우도 기존에는 적당한 로고를 사용하고 계시다가 어떤 분이 로고를 제작해서 PR을 해주셔서 그걸 지금도 사용하고 있다고 하신 것에 아이디어를 얻어 내가 만들 수 있는 수준에서 로고를 업그레이드 할 수 있는 오픈소스가 어떤게 있을까 생각해보다가 문득 JDD의 로고가 살짝 아쉽다라고 생각했던 것이 기억이 나서 도전해보게 되었다.\n\n**변경 전**\n<img src='https://user-images.githubusercontent.com/10369528/130068355-049861db-ce6e-45cd-a74c-a262ee4fb01a.png'/>\n\n**변경 후**\n<img src='https://user-images.githubusercontent.com/10369528/258737595-e63b4e5a-b6a4-4357-807c-767df9193fa5.png'/>\n로고를 제작할때 기존에 로고의 느낌은 최대한 살린 채로 다른 개발론 로고를 참고하여 제작해 보았다.\n\n로고 제작을 완료한 후 두근두근한 마음을 가지며 PR을 했다.\n\n**PR 결과**\n![](https://velog.velcdn.com/images/blaze096/post/b5d3f384-9977-4310-98d8-858f5d7d8e74/image.png)\n\nmerge에 성공했다. **LGTM** 원래는 자동으로 깃헙 액션을 통해서 코멘트가 달리도록 되어있었지만 왜인지는 모르겠으나 깃헙 액션이 자동으로 동작하지는 않아 레파지토리를 만드신 분이 직접 달아주신 것 같았다. **(감동 두배)** 뭔가 대단한 일을 한건 아니지만 컨트리뷰트에 한 번 성공하고 나니 자신감이 생각보다 많이 생겼고 최근에 개발을 하면서 기분이 좋았던 적이 크게 없었는데 오랜만에 기분이 좋아졌다. <strike>물론 개발로 컨트리뷰트를 한건 아니지만 뭐 어때</strike>\n\n2. antd\n\n&nbsp JDD 컨트리뷰트 성공에 나름 어깨가 올라가서 두번째로 antd 한국어 docs를 제작해보기로 하였다. antd를 선택한 이유는 두가지가 있었는데 하나는 내가 실제로 현업에서 종종 사용하고 있기 때문이고 나머지는 이미 다른 국가의 언어들이 지원되고 있는 반면 한국어는 지원되지 않아 한국어 docs도 있으면 좋을 것 같다는 생각에서였다.\n\n**변경 전**\n![](https://velog.velcdn.com/images/blaze096/post/1d376955-a73d-4c92-8f1a-22fbd4a5701c/image.png)\n\n그래서 나는 당장에 번역을 시작했다. 물론 내가 영어를 잘하지는 않기 때문에 여러가지 툴들의 도움을 받기로 했다. 일단 처음에는 구글 번역기를 이용해서 영어와 일본어 docs를 번역한 후 그걸 chatgpt를 통해 자연스러운 문맥으로 전환했다. 그리고 일본어에서 가타카나를 쓴 부분의 경우에는 확인해서 문맥에 맞게 영어를 사용하거나 자연스러운 한국어로 번역 했다.\n\n**변경 후**\n![](https://velog.velcdn.com/images/blaze096/post/5e5bd181-e6e7-47ab-b9f6-ccf43634ac3b/image.png)\n\n[번역한 Korean antd docs 보러가기](https://github.com/keepinblazing/ant-design/blob/docs/support-korean-readme/README-ko_KR.md)\n\n**PR 결과 **\n\n![](https://velog.velcdn.com/images/blaze096/post/dd518a00-ff82-468a-a0cf-4bfd0872e6f6/image.png)\n\n![](https://velog.velcdn.com/images/blaze096/post/7469fdb4-66a4-4fdc-b164-dff869010b25/image.png)\n\n아쉽게도 antd 측에서 더이상 다른 언어의 docs를 추가할 계획이 없다고 밝혀 PR은 통과되지 못했다. 뭐 엄청 공들여 시간을 쓴 부분은 아니라서 크게 아쉬움이 남지는 않지만 먼저 issue를 생성해서 한국어 docs에 관련된 내용이 필요 여부에 대한 질문을 하고 시작했더라면 더 좋았을 것 같아 다음번에는 먼저 PR을 하기보다는 issue를 생성하고 issue에 대한 답변이 올때까지 기다려봐야겠다.\n\n이제 항해 플러스가 단 일주일 남았다. 처음 시작했을때만 해도 '언제 끝나나', '괜히 했나'라는 잡생각들이 머리속에서 많이 맴돌았는데 지금 돌아와보니 '잘했다'라는 생각이 많이 든다. 많은 것을 배웠고 조금 더 나은 개발자가 되는데에 많은 도움을 받았기 때문인 것 같다. 남은 한주도 잘 마무리해서 유종의 미를 거둬야 겠다.\n\n",
    "created_at": "2023-08-12T15:32:47.813Z",
    "updated_at": "2026-01-13T05:06:41.935Z",
    "url_slug": "항해-플러스-9주차",
    "tags": [
      "jdd",
      "오픈소스",
      "항해 플러스"
    ]
  },
  {
    "id": "dad03432-9fac-487b-98aa-2d4439e478ee",
    "title": "항해 플러스 8주차",
    "short_description": "항해 플러스 8주차 일지.",
    "body": "&nbsp 항해 플러스에 들어오게 된 진짜 이유, 마지막 챕터인 오픈소스 주차가 시작되었다. 나는 이번 해를 시작하면서 단 하나의 목표를 잡았는데 그것이 바로 **'오픈소스 컨트리뷰트'**였다. 하지만 막상 목표를 잡고 실행에 옮기려고 하니 현생 이슈와 어떤 방식으로 어떻게 컨트리뷰트를 해야할지도 모르던 와중에 발견한게 항해 플러스였고 내가 항해 플러스를 시작하게 된 가장 큰 계기가 되었다.\n\n&nbsp;물론 지금이 시점에서 어찌저찌하다보니 이미 오픈소스 컨트리뷰터가 되버렸고 사내 라이브러리도 뚝딱뚝딱 만들고 있어 사실상 항해 플러스에 들어오게 된 이유가 흐려지는 감이 있지만 뭐 어쩌겠어 끝까지 해야지.\n\n&nbsp; 이번에 오픈소스 주차에 방향성은 크게 두개로 나뉜다. '오픈소스를 만들어서 배포하는 것'과 '오픈소스에 컨트리뷰트 하는 것'이였다. 그래서 우리조는 회의 끝에 '오픈소스에 컨트리뷰트 하는 것'으로 방향성을 잡았다. 그 이유는 **'3주라는 짧은 시간에 순도 높고 사용성이 높은 라이브러리를 제작하는 것은 어렵다.'**라는 것이였다. 그래서 우리는 빠르게 방향성을 정하고 다음과 같은 규칙을 정했다.\n\n- 가능하면 문서나, 오타 교정 말고 코드로 컨트리뷰트에 성공해보기.\n- 팀원 모두에게 의미가 있도록 순수 자바스크립트 라이브러리에 컨트리뷰트 해보기.\n\n첫번째 규칙에 경우 이유는 단순했다. 모름지기 개발자라면 코드로 컨트리뷰트를 해야 진짜 오픈소스 기여라고 생각했기 때문!~~(우리가 돈이없지 가오가..)~~\n두번째 규칙에 경우 현재 나와 다른 팀원분의 스택이 다르기 때문이다. 한쪽으로 치우친 라이브러리에 컨트리뷰트 한다면 컨트리뷰트 확률이 조금 더 높아 질 수는 있겠으나 모두에게 도움이 되지는 않을 것 같았기 때문이다. 그래서 우리는 이러한 이유로 오픈소스 컨트리뷰트의 방향성을 정하고 순수 자바스크립트 라이브러리 목록들을 리서치 해오기로 했다. 우리가 리서치한 라이브러리 목록은 다음과 같다.\n\n\n**조사해본 순수 자바스크립트 라이브러리 목록**\n\n1. [Lodash](https://www.npmjs.com/package/lodash): 다양한 타입의 JavaScript 값에 대한 유틸리티 함수를 제공하는 라이브러리\n2. [Dayjs](https://www.npmjs.com/package/dayjs): 날짜와 시간을 처리하는데 도움이 되는 라이브러리\n3. [Axios](https://www.npmjs.com/package/axios): Promise 기반의 HTTP 클라이언트로서, 브라우저와 Node.js에서 모두 사용 가능한 라이브러리\n4. [Ramda](https://www.npmjs.com/package/ramda): 함수형 프로그래밍 스타일을 위한 유틸리티 라이브러리\n5. [Underscore.js](https://www.npmjs.com/package/underscore): 다양한 유틸리티 기능을 제공하는 라이브러리\n6. [Math.js](https://www.npmjs.com/package/mathjs): 수학적 연산을 위한 라이브러리 수치 연산, 복소수, 행렬, 단위 변환 등의 기능을 제공\n7. [jsonwebtoken](https://www.npmjs.com/package/jsonwebtoken): JWT(JSON Web Token)를 생성하고 검증하는 데 사용되는 라이브러리\n8. [Faker.js](https://www.npmjs.com/package/Faker): 대량의 가짜 데이터를 생성하는 데 사용되는 라이브러리\n9. [Mocha](https://www.npmjs.com/package/mocha)/[Chai](https://www.npmjs.com/package/chai): JavaScript를 위한 테스팅 프레임워크\n10. [async](https://www.npmjs.com/package/async): 비동기 연산을 더 효과적으로 관리하기 위한 라이브러리\n11. [Q](https://www.npmjs.com/package/q): Promise 기반의 비동기 처리를 돕는 라이브러리\n12. [Cross-fetch](https://www.npmjs.com/package/cross-fetch): 유니버설(fetch)의 HTTP 요청을 하기 위한 라이브러리\n13. [PM2](https://www.npmjs.com/package/pm2): node 환경 배포 라이브러리\n14. [tslib](https://www.npmjs.com/package/tslib):  TypeScript의 런타임 라이브러리로, TypeScript에서 생성된 코드가 브라우저나 다른 환경에서 실행될 때 필요한 헬퍼 함수들을 제공\n15. [nodemon](https://www.npmjs.com/package/nodemon): node 환경 배포 라이브러리\n\n\n처음보는 라이브러리도 있었지만 대부분 npm에서 다운로드 수 탑을 다투는 라이브러리인 많큼 실제로 사용중인 라이브러리도 많았다. 그래서 우리는 이 중에서 컨트리뷰트에 도전하고 싶은 라이브러리에 대해 얘기해 보았고 그 결과 최종적으로 리스트업 된 라이브러리는 Lodash와 Dayjs였다. 하지만 이 라이브러리들에 컨트리뷰트하기 위해선 넘어야 될벽이 있었는데\n![](https://velog.velcdn.com/images/blaze096/post/38d132b0-adfb-4666-9293-8a4a84db6a2d/image.png)\n\n**쌓여있는 이슈와 PR이 너무 많았던 것!** 물론 이중에서는 몇년전에 날린 PR이 닫히지 않은 경우도 있었지만 최근에도 활발히 이슈와 PR이 생성되고 있는 걸 어렵지 않게 확인 할 수 있었다. 그래서 우리 팀은 다시 한번 고민에 빠졌다. 다른 라이브러리를 찾아볼 것인가? 아니면 이대로 끝까지 밀어붙여 볼 것인가. 그러던 도중 멘토링을 받게 되었고 이에 대한 해답을 찾을 수 있었다. 코치님의 말씀을 3줄 요약 해보면 다음과 같다.\n- 꼭 컨트리뷰트에 성공해야 된다는 부담을 버릴 것\n- 이번 오픈소스 챕터는 오픈소스에 컨트리뷰트하거나 오픈소스를 만들어 배포하는 것보단 이런 문화를 체험해보고 향후에 오픈 소스에 컨트리뷰트를 할 수 있는 방법을 배워가는 것\n- 이러한 의사 결정 과정들을 기록해 둘 것\n\n그래서 우리는 코치님에 멘토링에 힘입어 뭐라도 보여줘야한다는 부담감을 조금 덜을 수 있었고 최종적으로 다시한번 의견을 모은 끝에 Lodash에만 컨트리뷰트에 도전해보기로 하였다.\n\n이번 주를 보내면서 역시 생각한 것과 비슷하게 오픈소스에 기여하는 길은 쉽지 않았다. 그래도 방향성은 어느 정도 잡혔고 부담도 어느정도 덜어냈으니 다음주는 지난 주보다는 가벼운 마음으로 챕터를 이어 나갈 수 있을 것같다.\n\n과연 다음주에는 PR을 날릴 수 있을 것인가 **To Be Continued**\n\n\n\n\n\n\n\n\n\n\n",
    "created_at": "2023-08-06T04:40:22.887Z",
    "updated_at": "2025-12-17T02:33:39.328Z",
    "url_slug": "항해-플러스-8주차",
    "tags": [
      "오픈소스",
      "컨트리뷰트",
      "항해 플러스"
    ]
  },
  {
    "id": "827d60c2-984c-44a1-bf40-0fcbfc975cd1",
    "title": "항해 플러스 7주차 ( Chapter4 회고 )",
    "short_description": "  항해 플러스 7주차 일지.",
    "body": "&nbsp 'TDD를 적용한 백엔드 프로젝트'라는 타이틀을 달고 시작했던 항해 플러스에 한분기가 종료 되었다. 이번 주에도 물론 밀린 일을 처리하느냐 Chapter4의 주제 였던 '장애 대응'은 시도 할 엄두 조차 못냈지만 그 전에 밀린 챕터들을 마무리하고 발표도 잘 무리한 것에 의의를 두려고 한다.\n\n&nbsp 개인적으로 나는 많은 것을 얻은 7주였다. 백엔드에 대해 전혀 모르던 내가 이제 간단한 백엔드 서버를 구축할 수 있게 되었으며 다른 백엔드 개발자들과의 소통도 훨씬 원활해진 것을 느꼈고 그동안 배우기를 미뤄왔던 테스팅 툴들도 이제 다룰 수 있게 되었다.\n\n&nbsp 개인적으로 그만둘까를 몇번이고 생각했다. 예상치 못한 팀원의 이탈과 바쁜 현업으로 인해 많은 스트레스를 받았다. 하지만 좋은 멘토 분들의 조언 덕분에 어떻게든 여기까지 올 수 있었던 것 같다. 만약 포기했다면 이 시원섭섭한 기분도 못느꼈을꺼라 생각하니 포기하지 않은 것을 다행이라 생각한다. **아닌가?**\n\n&nbsp 이제 항해 플러스는 3주 밖에 남지 않았다. 남은 오픈소스 프로젝트를 잘 마무리 지으며 **내 인생 마지막 부트캠프**를 마무리 지어봐야 겠다. (두번은 못하지)",
    "created_at": "2023-07-30T05:51:53.475Z",
    "updated_at": "2026-01-04T20:02:27.944Z",
    "url_slug": "항해-플러스-7주차-Chapter4-회고",
    "tags": [
      "항해 플러스"
    ]
  },
  {
    "id": "3a7e2fcb-4d46-4944-8c1a-992f844c328f",
    "title": "항해 플러스 6주차",
    "short_description": "항해 플러시 6주차 일지.",
    "body": "&nbsp 바빴다. 너무 바빴다. 저질러 놓은 일이 많아 수습하기 바쁜 한 주였다. 팀원분 한분이 개인적인 사정으로 인해 중도 하차하셨다. 그래서 더 바빠졌다. 살면서 이렇게 바쁜적이 있었나 싶었을 정도로 쉬지도 못하고 컴퓨터 앞에 앉아서 코딩하고 공부한 것 같다. 바쁜 건 좋은 거지만 바쁘면 바쁜대로 쉬고 싶어진다. 피곤하다. 좀 적당히 해야겠다. 좀 있으면 VSC만 봐도 현기증이 올 것 같은 기분이다.\n\n&nbsp 우리조는 이번 주에 겨우 CD만 끝냈다. 가뜩이나 조금씩 밀려 있던 일이 한분이 나가시게 되면서 개인이 맡아야하는 부분이 더 늘어났기에 일정이 더 밀려버렸다. 남은 한주 잘 마무리해서 그래도 어느정도 구색은 갖춘채로 프로젝트를 끝내고 싶다.",
    "created_at": "2023-07-23T14:03:41.793Z",
    "updated_at": "2026-01-03T19:51:52.179Z",
    "url_slug": "항해-플러스-6주차",
    "tags": [
      "항해 플러스"
    ]
  },
  {
    "id": "78f0f7a1-504c-414a-bf83-19b1a870bb0b",
    "title": "항해 플러스 5주차 (Chapter 3 회고)",
    "short_description": "항해 플러스 5주차 일지.",
    "body": "&nbsp 이번 주도 바쁜 한주 였다. 최근에 개발자 모임이나 스터디들이 추가 됨에 따라 가뜩이나 없는 시간을 더 쪼개서 쓰고 있다.\n\n&nbsp 원래 이번 주에 통합 모니터링 시스템 구축을 완료 했어야 했으나 서버 구축이 아직 제대로 되지 않은 점과 CI/CD 파이프라인도 구축이 안되어있어 어쩔 수 없이 우리 팀원들은 각자 서로에게 가장 필요한 경험을 가져가는 것으로 합의를 보고 나의 경우 완벽하게 구현이 되지 않은 서버 구축을 하는데에만 주력했다.\n\n&nbsp 뭐 어찌저찌 이 글을 쓰는 오늘 서버 구축은 완료가 되었고 이제 화요일 전까지 코치님들에 조언에 따라 일단 되게 하는 것에 목표를 둬 파이프 라인과 통합 모니터링 시스템 구축까지 달려보기로 했다. 다음 주 수요일 부터는 원래 커리큘럼에 집중할 수 있어야 할텐데 시간이 너무 모자라서 아쉽다.\n\n&nbsp 여튼 안하고 한탄하는 것 보다 하고서 후회는 것이 나으니 오늘도 열심히 해야겠다.",
    "created_at": "2023-07-16T09:41:09.679Z",
    "updated_at": "2026-01-12T11:17:08.806Z",
    "url_slug": "항해-플러스-5주차-Chapter-3-회고",
    "tags": [
      "항해 플러스"
    ]
  },
  {
    "id": "784785fc-77ce-45a1-9cd4-367f622d0e9b",
    "title": "TIL - 왜 Strict Mode에서는 useEffect가 두번 호출되나",
    "short_description": "오늘 배운 것.",
    "body": "&nbsp 오랜만에 블로그들을 useEffect가 두번 호출 되는 이슈에 관한 글을 읽었다. 뭐 결론은 단순했다. Strict Mode를 사용 중이 였기 때문인데 예전에 나도 리액트를 처음 시작했을 무렵 겪었던 문제라 단순한 문제라고 생각하지 않고 로직적인 문제로 착각해 골머리를 썩었던 적이 있었다. 여기서 갑자기 궁금증이 생겼다. Strict Mode에서는 그럼 왜 두번 호출하는가? 그당시에는 문제를 해결하고 넘어가기 급급해서 차마 생각하지 못한 문제인데 일년이 다되는 시점에서 이제 확인해보고 글을 남긴다.\n\n&nbsp 일단 Strict Mode란 무엇인지부터 알아보자. Strict Mode는 '개발자에게 잠재적인 문제를 감지하고 경고를 경고를 표시해 개발자가 애플리케이션의 품질을 향상시킬 수 있도록 도와주는 도구' 라고 나와있다. Strict Mode는 개발 환경에서만 활성화 되고 실제 프로덕션 환경에서는 무시된다.\n\n&nbsp Strict Mode의 장점으로는 세가지를 꼽을 수 있다.\n\n| 장점                               | 설명                                                                                                          |\n|-----------------------------------|---------------------------------------------------------------------------------------------------------------|\n| 추가적인 경고와 검사 | 애플리케이션 내에서 잠재적인 문제를 감지하고 경고를 표시하여 개발자에게 미리 알려준다.                       |\n| Legacy API 경고                    | React의 레거시 API 사용에 대한 경고를 활성화하여 오래된 기능이나 권장되지 않는 방식의 사용을 방지한다. |\n| 애플리케이션의 품질 향상  | Strict Mode를 통해 개발자는 애플리케이션에서 잠재적인 문제를 미리 발견하고 수정할 수 있으며, 품질을 향상시킬 수 있다. |\n\n<br/>\n&nbsp 그럼 본론으로 들어가서 Strict Mode에서 useEffect가 두번 호출 되는 이유는 장점의 첫 번째인 '추가적인 경고와 검사'에 있다. Strict Mode에서는 렌더링을 총 두번하게 된는데 첫 번째 렌더링 단계\b에서는 컴포넌트 트리의 모든 컴포넌트가 렌더링돼고 가성돔에 대한 업데이트가 수행되게 된다. 이 단계에서는 컴포넌트의 상태 변화나 속성 변경에 따라 컴포넌트를 업데이트하고 가상돔을 형성한다. 첫 번째 렌더링 단계에서 호출된 useEffect 훅은 컴포넌트의 부수효과(데이터 페칭, 타이머)등을 처리한다.<br/>\n&nbsp 두 번째 렌더링 단계에서는 컴포넌트 트리를 다시 렌더링해 업데이트 된 가상돔과 비교한다. 이 단계에서는 이전 가상돔과 새로운 가상돔을 비교하면서 실제돔의 변경 사항을 결정한다. 이 때 첫번째 장점인 '추가적인 경고와 검사'가 수행되며 이 떄 다시 useEffect 훅을 호출해 부수효과의 일관성을 확인하고 잠재적인 문제를 식별할 수 있게 된다.\n\n&nbsp 이렇게해서 엄근진 모드에서 왜 useEffect가 두번 호출되는 이유를 알아봤다. Strict Mode가 단순히 개발에서만 사용된다고 알고 있었는데 생각보다 많은 프로세스가 진행되는 일이라는 점에서 그동안 자세한 이유를 알아보지 않은 내 자신에가 반성하게 되는 일인 것 같다. 앞으로 이론도 꾸준히 공부해 나가야지.\n",
    "created_at": "2023-07-09T14:38:11.803Z",
    "updated_at": "2026-01-06T15:17:24.494Z",
    "url_slug": "TIL-왜-Strict-Mode에서는-useEffect가-두번-호출되나",
    "tags": [
      "React",
      "TIL"
    ]
  },
  {
    "id": "ed0a5cf9-aa1a-49d8-984e-06c77b657598",
    "title": "항해 플러스 4주차 ( Chapter 2 회고)",
    "short_description": "항해+ 4주차 일지.",
    "body": "&nbsp Chatper 2가 종료되었다. CI/CD 주차였지만 회사 일정과 개인 일정이 많은 한주라 기존에 못했던 프로젝틀를 완성하기에 급급했던 한 주였던 것 같다.\n\n&nbsp 우리조는 CI/CD를 젠킨스를 기반으로 파이프 라인을 만들기로 하였기에 자신감 넘치게 젠킨스를 도전했지만 생각보다 쉽지는 않았다. 애초에 내가 아키텍처 쪽에는 관심이 일절 없어서 더욱 그랬던 것 같다. 아키텍처에 대한 지식의 중요성을 깨달은 한주였지만 앞으로도 기본적인 지식을 제외한 아키텍쳐를 배우는 것에 시간을 할애할 의향은 없다.\n\n&nbsp 차주부터는 통합 모니터링 시스템을 구축하는데 이번에도 우리조의 스택과는 맞지않는 winston을 기반으로 커리큘럼이 진행되는데 뭐 젠킨스보다는 쉬워보여서 크게 걱정이 되지는 않는다.\n",
    "created_at": "2023-07-09T07:23:51.350Z",
    "updated_at": "2025-11-19T11:12:35.183Z",
    "url_slug": "항해-플러스-4주차-Chapter-2-회고",
    "tags": [
      "항해 플러스"
    ]
  },
  {
    "id": "376e5250-cf5d-4e1f-bbc0-37f949fc0ca4",
    "title": "항해 플러스 3주차 ( Chapter 1  회고)",
    "short_description": "항해+ 3주차 일지.",
    "body": "&nbsp TDD 챕터를 완료했다. 지난 3주 동안 항해, 회사 업무 그리고 개인 프로젝트까지 쏟아지는 일복에 머리가 터질뻔 했으나 어떻게든 꾸역꾸역 하나씩 해결해온 것 같다.\n\n&nbsp 항해+를 시작하면서 이런저런 걱정들을 많았다. 기존에 백엔드를 해본 적도 없으며 테스트 코드의 작성 경험 또한 적었기에 커리큘럼을 소화하는 것에 어려움을 예상했지만 다행히도 친절한 팀원들의 도움 덕분에 부족한 백엔드 지식을 보완할 수 있었고 예전에는 어렵게만 느껴졌던 Jest도 지금에 와서는 쉽게 사용할 수 있어 큰 무리없이 커리큘럼을 소화해 낼 수 있었던 것 같다.\n\n&nbsp 이번 챕터를 끝내면서 TDD란 수박에 껍질만 아주 아주 살짝 핥아봤다. 물론 제대로 된 TDD를 하기엔 부족한 시간이였고 실력이였지만 3주라는 긴 시간동안에 진행했던 것들이라 아쉬움이 많이 남는다.\n\n&nbsp 물론 아쉬움만 남았던 것은 아니다. Jest를 다루는 것에 어느 정도 익숙해 졌기에 이제는 프론트 엔드에서의 유닛 테스트 코드도 작성할 수 있을 것 같고 Cypress나 Storybook같은 예전에는 프로젝트 적용이 어려웠던 다른 테스팅 툴도 이제는 적용할 수 있을 것이라는 생각이 든다. 그래서 어느정도 회사일과 개인 프로젝트가 마무리가 되면 그동안 미뤄왔던 개인 블로그 프로젝트를 백엔드와 프론트 모두 TDD를 활용해서 천천히 조금씩 만들어 가려고 한다. **물론 지금하는 일들이 어느정도 정리가 된다는 가정하지만**",
    "created_at": "2023-07-01T12:12:36.296Z",
    "updated_at": "2025-12-02T13:04:10.201Z",
    "url_slug": "항해-3주차-Chapter-1",
    "tags": [
      "항해 플러스"
    ]
  },
  {
    "id": "0c27ac76-c17e-4717-8155-0a1817d7fd44",
    "title": "항해 플러스 2주차",
    "short_description": "항해+ 2주차 일지.",
    "body": "&nbsp 이번 주는 테스트 시나리오를 마무리 짓고 본격적으로 테스트 코드 작성에 들어갔다. 테스트 시나리오 부족한 부분이 보이긴 하지만 이부분은 각자 테스트 코드를 작성하면서 조금씩 채워나가기로 했다.\n\n&nbsp 항해99 시절 마지막 프로젝트 당시 테스트 코드를 작성하려고 하였으나 실패한 경험이 있었는데 그때는 Jest를 다루는 것이 어려웠으나 지금은 별 문제없이 다룰 수 있었고 덕분에 테스트 코드를 작성하는데는 어려움이 없었다.\n\n&nbsp 문제는 내가 프론트엔드 개발자다보니 코드 작성 스타일이나 변수 네이밍이 프론트 쪽에 초점이 많이 맞춰져 있어 백엔드 스타일의 코드를 작성하고 있지 않았다는 점에 있었다. 물론 이부분은 팀원 분들과의 코드 리뷰를 통해 조언을 얻고 수정해 나가서 잘 해결 할 수 있었다.",
    "created_at": "2023-07-01T11:59:54.471Z",
    "updated_at": "2025-12-10T02:20:06.842Z",
    "url_slug": "항해-2주차",
    "tags": [
      "항해 플러스"
    ]
  },
  {
    "id": "5b459923-3157-4c23-b1db-aa603611a58b",
    "title": "항해 플러스 1주차",
    "short_description": "항해+ 1주차 일지.",
    "body": "&nbsp 4월에 어느 날 퇴근길 지하철 흥미로운 문자 하나를 받았다. 그것은 바로 스파르타 코딩클럽에서 항해 플러스가 신설된다는 내용이였다.\n\n\n&nbsp 프론트엔드 개발자로서 테스트 코드의 작성이나 사이드 프로젝트로 오픈소스 기여를 하고 싶던 나에게 꽤 괜찮은 기회라고 생각했다. 게다가 이 모든 구성을 **단돈 100만원에? **\n\n&nbsp 약간의 고민을 거친 끝에 지하철에서 12개월 할부로 결제를 때려버렸다. _(깨알같이 무이자도 지원해줬다.)_ 작년 여름에 이어서 항해를 두번 할 줄은 몰랐는데 사람일은 역시 모르는 것 같다. _(이 정도면 개발자가 아니라 뱃사람인듯)_\n\n&nbsp 결제를 할 당시에는 커리큘럼에 대한 러프한 내용만 나와있던 걸로 기억하는데 내가 원했던건 TDD와 오픈소스 프로젝트정도라 다른 것은 별로 신경쓰지 않고 넘겼었다. 그런데 문제가 발생했다.\n\n&nbsp **항해 플러스는 백엔드 코스였던 것!**\n<img src='https://static.spartacodingclub.kr/hanghae99/curriculum_summary6.png'/>\n<h6>* 이미지 출처 스파르타 코딩클럽 항해99</h6>\n\n&nbsp 언젠가는 노드 백엔드도 배워서 풀스택 개발자가 되려고 하였으나 프론트엔드도 아직 미숙한데 과연 백엔드를 배우는 것이 맞나라는 생각이 들었다.\n\n&nbsp 결론은 고민 끝에 뭐 미루는 것 보다야 얼른 풀스택해서 혼자서 다해먹자는 생각이 들어서 계속 진행하는 것으로 하긴 했다. _(물론 아직도 약간 긴가민가 하긴하다.)_ 할까 말까할때는 하지말라고 했었는데 좋은 기회로 남도록 열심히 해보긴 해야겠다.\n\n&nbsp 부트캠프는 항해99와는 다르게 오프라인으로 진행되었다. 강남에 있느 스파르타 본사에서 진행했는데 오프라인으로 많은 개발자들을 만나는 것은 처음이라 살짝 긴장도 했지만 다들 좋으신 분들이여서 금새 긴장은 해소되었다.\n\n&nbsp 간단한 부트캠프 소개를 마친 뒤 당분간 함께할 팀원분들과 인사를 나눈 후 팀규칙과 코드 컨벤션, 프로젝트 역할 분배를 마치고 집으로 돌아왔다.\n\n&nbsp 첫주차라 그렇게 빡세지는 않아서 다행이였고 당장에 개발을 시작하는 것은 아니라 아직 nest를 공부할 시간이 있어 다행이라는 생각이였다. 얼른 하는 프로젝트를 마무리하고 nest 공부에 집중해야겠다.\n\n&nbsp 오랜만에 장문의 글을 쓰는 것 같은데 항해 할때만 되면 글이 잘써진다. 내년에 항해++같은거 나오면 또 할라나\n\n\n",
    "created_at": "2023-06-10T12:48:35.325Z",
    "updated_at": "2025-12-13T03:44:23.728Z",
    "url_slug": "항해-1일차",
    "tags": [
      "항해 플러스"
    ]
  },
  {
    "id": "cd4b4f4a-45d1-4b0c-8b06-00841adf4cc5",
    "title": "TIL - 객체지향 프로그래밍",
    "short_description": "오늘 배운 것",
    "body": " 객체지향 프로그래밍은 프로그램을 명령어 또는 함수의 목록으로 보는 전통적인 **명령형 프로그래밍의 절차지향적 관점**에서 벗어나 여러 개의 독립적 단위, 즉 **객체의 집합으로 프로그램을 표현하려는 프로그래밍 패러다임**을 말합니다. 객체지향 프로그래밍의 특징은 다음과 같습니다.\n \n① 추상화 (Abstraciton)\n\n객체를 구성할 수 있는 다양한 속성(프로퍼티) 중에서 프로그램에 필요한 속성만 간추려 내어 표현하는 것을 추상화라 합니다.\n\n② 캡슐화 (Encapsulation)\n\n데이터 구조와 데이터를 다루는 방법들을 목적에 따라 결합시켜 묶는 것. 다시 한번 말하자면 변수와 함수를 하나로 묶는 것을 말합니다. 또한 데이터를 절대로 외부에서 직접 접근을 하면 안되고 오로지 함수를 통해서만 접근해야 하는데 이를 가능하게 해주는 것이 바로 캡슐화입니다.\n\n③ 상속 (Encapsulation)\n\n상위 개념의 특징을 하위 개념이 물려받는 것을 의미합니다.\n\n④ 다형성 (Polymorphism)\n\n부모 클래스에서 물려받은 가상 함수를 자식 클래스 내에서 오버라이딩 되어 사용되는 것을 의미합니다.\n\n(오버라이딩 : 상속 관계에 있는 부모 클래스에서 이미 정의된 메소드를 자식 클래스에서 같은 시그니쳐를 갖는 메소드로 다시 정의하는 것)",
    "created_at": "2022-11-01T13:20:27.981Z",
    "updated_at": "2025-11-05T21:05:19.080Z",
    "url_slug": "객체지향-프로그래밍",
    "tags": [
      "OOP",
      "TIL"
    ]
  },
  {
    "id": "1bb2d805-4b83-41f1-b728-59723e1acf93",
    "title": "나혼코 - 17일차",
    "short_description": "나혼코 17일차.",
    "body": "&nbsp 일단 **취뽀했다.** 아직까지 어안이 벙벙해서 실감이 나지 않지만 여튼 취뽀에 성공했다. 아직까지 많이 부족하지만 좋게 봐주신 것 같았다.\n\n&nbsp 첫 출근까지는 시간이 어느 정도 남아서 집도 구하면서 부족한 자료구조에 대해 공부해볼 예정이다. 시간이 되는대로 필요 스택들도 좀 깊게 파봐야 할 것 같다.",
    "created_at": "2022-10-21T12:01:03.965Z",
    "updated_at": "2025-12-30T20:30:00.804Z",
    "url_slug": "나혼코-17일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "23fee161-1896-465e-8c50-c61da615606c",
    "title": "나혼코 16일차",
    "short_description": "나혼코 16일차.",
    "body": "&nbsp 오늘은 자바스크립트의 기초내용을 다시 복습하는 시간을 가졌다. 복습을 하니까 기존에 애매하게 알던 개념들과 내가 놓치고 있었던 세세한 부분까지 잡을 수 있어서 좋았고 면접에도 도움이 많이 될 것 같아 하길 잘했다는 생각이 들었다. 이제 이틀 뒤에 면접인데 이번에는 자신에게 부끄럽지 않은 답변을 할 수 있었으면 좋겠다.",
    "created_at": "2022-10-16T14:59:22.804Z",
    "updated_at": "2026-01-05T03:27:07.263Z",
    "url_slug": "나혼코-16일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "879ea9f5-d4b0-47af-a225-ab7d740ad7d3",
    "title": "나혼코 15일차",
    "short_description": "나혼코 15일차.",
    "body": "&nbsp 오늘은 mobX을 간단하게 써보고 면접 준비를 계속하려했으나 오후에 mobX를 사용하면서 안되는 부분이 있어서 여러 레퍼런스를 살펴보던 도중 티스토리만 접속이 안되서 뭔가 이상함을 느끼고 있었는데 아니나 다를까 카카오톡 판교 데이터 센터에서 화재가 발생해 관련 서비스들이 전부 안되고 있었다. mobX 관련 레퍼런스가 티스토리에 많기도 하고 당장 써보는게 급한 것도 아니라 데이터 센터가 복구되면 다시 해보는 것으로 하고 다시 면접 준비를 했다.\n\n&nbsp CS나 JS 공부는 해도해도 끝이 안보인다. '이게 어디까지만 알아오세요~'하는 마지노선이라도 있으면 좋겠는데 그런건 없겠지... 뭐 여튼 오늘도 내일도 내일모레도 열심히 해야겠다.",
    "created_at": "2022-10-15T14:47:29.334Z",
    "updated_at": "2025-11-05T21:05:17.869Z",
    "url_slug": "나혼코-15일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "fcb99aa3-126d-4db1-8d5e-05ad7d9e7605",
    "title": "나혼코 14일차",
    "short_description": "나혼코 14일차.",
    "body": "&nbsp 과제에 통과했다는 전화를 받고 잠에서 깼다. 아쉬운 부분이 몇개 있었던 과제지만 다행히 좋게 봐주셨던 것 같다. 비몽사몽하던 정신을 뒤로하고 면접 준비를 하면서 ContextAPI와 Recoil도 간단하게 사용해보았다. 과제에서 리덕스를 사용한 이유에 대한 타당한 근거가 딱히 없었기 때문에 사용해보면서 리덕스가 다른 상태관리 툴에 비해 어떤 장점을 가지고 있는지를 직접 알아보기 위함이였다. 둘 다 사용하는 것은 크게 어렵지 않아서 금방 사용해 볼 수 있었다. 간단하게 나마 내가 느낀 점을 적어보려고 했는데 말이 앞뒤가 안맞아서 상태관리 툴에 관해서는 나중에 정리 할 예정이다. 면접이 얼마 안남았는데 남은 기간 동안에 열심히 면접준비나 해야겠다.",
    "created_at": "2022-10-15T10:02:21.846Z",
    "updated_at": "2025-12-15T14:58:49.480Z",
    "url_slug": "나혼코-14일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "1cb7188b-2b0f-41d4-8fa4-51346984c82e",
    "title": "나혼코 13일차",
    "short_description": "나혼코 13일차.",
    "body": "&nbsp 프로젝트 온보딩과 과제 둘다 잘 마친 하루였다. 온보딩을 마친 후 과제를 시작했는데 크게 어렵지는 않아서 제한시간 내에 해결 할 수 있었다. 물론 아쉬운 부분이 한두가지 남았는데 그 중하나가 상태관리에 관한 것이였다.\n\n&nbsp 단순히 props drilling을 해결하는 문제였기 때문에 굳이 외부 라이브러리인 redux나 recoil을 사용하는 것 보다는 내장 api인 contextAPI를 사용해서 해결하는 것이 좀 좋았을 것 같았는데 contextAPI를 사용해 본 적이 없어서 어쩔 수 없이 가장 익숙한 redux를 사용했다. 조만간에 contextAPI와 다른 상태관리 라이브러리들도 사용해봐야겠다.",
    "created_at": "2022-10-13T14:12:50.891Z",
    "updated_at": "2025-12-29T21:42:14.452Z",
    "url_slug": "나혼코-13일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "2137bd39-089a-431d-98e5-e2b2a9d0c42d",
    "title": "TIL - Browser Rendering",
    "short_description": "Brower Rendering",
    "body": "### 0. 들어가기 전에 ###\n<hr/>\n&nbsp 면접에 갔을 때 받은 질문중에 '브라우저 렌더링 과정에 대해서 설명해 주실 수 있나요?'가 있었다. 나는 도메인을 입력하면 DNS서버로 부터 IP를 받아오고 받아온 IP로 DOM 트리를 만들고 그 후에 CSSOM 트리를 만들어 렌더 트리를 구성해 페인팅한다는 식으로 답변했었는데 조금 자세하게 설명해 줄 수 있냐는 꼬리 질문에 말문이 막히고 말았다. 그래서 오늘은 브라우저 렌더링 과정에 대해 자세하게 알아보려고 한다.\n\n### 1. Browser란?\n<hr/>\n&nbsp 먼저 브라우저란 무엇인가? MDN에서 검색해 본 브라우저는 '웹에서 페이지를 찾아서 보여주고, 사용자가 하이퍼링크를 통해 다른 페이지로 이동 할 수 있도록 하는 프로그램'이라고 하고 있다. 우리가 사용하는 Chrome이나 Safari, 고인이 되버린 IE 등이 대표적인 예시라고 할 수 있다.\n\n![](https://velog.velcdn.com/images/blaze096/post/50852164-1447-422f-8f79-05c733a2f4d9/image.png)\n\n### 2. Browser의 구성요소\n<hr/>\n&nbsp 브라우저는 아래와 같은 구성요소로 이루어져 있다.\n\n![](https://velog.velcdn.com/images/blaze096/post/feac5dbc-0aa7-4101-afe2-863ff82aad0c/image.png)\n\n\n#### 1. UI\n\n&nbsp 브라우저를 켰을 때 바로 확인할 수 있는 주소표시줄과 새로고침, 뒤로가기 등의 버튼들, 요청한 페이지를 보여주는 창외에 사용자가 컨트롤 할 수 있는 부분을 말한다.\n\n#### 2. Browser Engine\n\n&nbsp 사용자가 주소창에 입력한 URI 값을 렌더링 엔진에게 전달해주는 역할 및 각종 버튼들을 눌렀을 때 그 명령 또한 렌더링 엔진에게 전달 하는 역할을 한다.\n\n#### 4. Rendering Engine\n\n&nbsp 사용자가 URI를 입력했을 때, URI에 해당하는 데이터를 네트워크 레이어에 전달해 주고, 응답으로 받은 리소스 또는 스토리지에 캐싱된 리소스를 가져와 인터프리터, UI 백엔드에 전달 해주며 HTML, CSS 코드를 파싱해서 렌더 트리를 구성해 전달해주는 총괄적인 역할을 한다.\n\n#### 5. Network(Network Layer)\n\n&nbsp 렌더링 엔진으로부터 HTTP 요청을 받아서, 서버에게 요청하고 응답 리소스를 받아 렌더링 엔진에게 돌려준다.\n\n#### 6. Interpreter(JS Interpreter)\n\n&nbsp 렌더링 엔진으로부터 받아온 리소스 중에서 자바스크립트를 파싱하는 역할을 한다.\n\n#### 7. UI Backend\n\n&nbsp 렌더링 엔진에서 생성된 렌더 트리를 브라우저에 그리는 역할을 한다.\n\n### 3. Browser Rendering Process\n<hr/>\n\n&nbsp 브라우저의 렌더링 과정은 크게 Parsing → Style → Layout → Paint → Composite 순으로 진행된다.\n\n#### 1. Parsing\n\n&nbsp 브라우저가 받아온 HTML 파일을 해석하여 DOM Tree를 구성하는 단꼐이며 파싱 중에 HTML 파일안에 CSS가 포함되어 있다면 CSSOM Tree 구성도 함께 진행한다.\n\n#### 2. Style\n\n&nbsp 파싱 단계에서 생성된 DOM tree와 CSSOM Tree를 매칭시켜서 Render Tree를 구성하는 단계이다. Render Tree는 실제로 화면에 그려질 Tree이다.\n\n#### 4. Layout\n\n&nbsp Render Tree를 화면에 어떻게 배치할 것인지 노드에 정확한 위치와 크기를 계산하는 단꼐이다. 루트부터 노드를 순회하면서 노드의 정확한 크기와 위치를 계산하고 Render Tree에 반영한다.(만약 크기가 %라면 현 단계에서 %값을 픽셀 단위로 변환한다.)\n\n#### 5. Paint\n\n&nbsp 레이아웃 단계에서 계산된 값을 이용해 Render Tree의 각 노드를 화면상에 실제 픽셀로 변환하는 단계이다. 이 때 픽셀로 변환된 결과는 하나의 레이어가 아니라 여러 개의 레이어로 관리된다. (스타일이 복잡할수록 페인트에 걸리는 시간이 늘어난다.)\n\n#### 6. Composite\n\n&nbsp 페인트 단계에서 생성된 레이어를 합성하여 실제 화면에 나타내는 단계이다.\n\n### 5. 참조\n<hr/>\n\n[브라우저의 구성 요소와 렌더링 과정](https://eunjinii.tistory.com/49)\n[MDN - 브라우저](https://developer.mozilla.org/ko/docs/Glossary/Browser)\n[위키피디아 - 브라우저](https://ko.wikipedia.org/wiki/%EC%9B%B9_%EB%B8%8C%EB%9D%BC%EC%9A%B0%EC%A0%80)",
    "created_at": "2022-10-12T15:48:01.565Z",
    "updated_at": "2025-11-10T06:54:42.907Z",
    "url_slug": "TIL-Browser-Rendering",
    "tags": [
      "CS",
      "TIL",
      "browser"
    ]
  },
  {
    "id": "405f7cec-970a-4b44-acc2-096aa2f8f1f3",
    "title": "나혼코 12일차",
    "short_description": "나혼코 12일차.",
    "body": "&nbsp 오전에는 코테 문제를 풀고 오후부터는 Next.js인강과 내일 있을 과제를 대비해서 간단하게 구글맵을 사용해 보았다. 구글맵도 카카오맵이랑 사용법이 유사해서 어렵지 않게 사용할 수 있었다. 문제는 과제가 어떻게 나올까인데 그건 내일가서 생각하기로하자.\n\n&nbsp 내일은 기업과 함께하는 프로젝트의 첫 미팅도 있다. 실제 현업자분들과 프로젝트를 하는 건 처음이라 많이 긴장되지만 최선을 다하면 할 수 있을거라 생각한다. 아마도? 내일은 바쁜 하루가 될 것 같다.",
    "created_at": "2022-10-12T15:43:19.670Z",
    "updated_at": "2025-10-24T04:33:46.185Z",
    "url_slug": "나혼코-12일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "fd21e616-67f7-42d6-a5f2-c0642639e462",
    "title": "나혼코 11일차.",
    "short_description": "나혼코 11일차.",
    "body": "&nbsp 계속해서 CS공부와 자바스크립트 공부만을 하다보니 슬슬 재미가 없어져서 간단한 프로젝트라도 하기 위해 노마드코더 Next.js인강을 듣기 시작했다. 기존에 잡혔던 면접도 거의 다 끝나가고 추가지원도 안하려는 생각이니 CS와 자바스크립트 공부는 꾸준히 하고 새로운 기술들을 써볼 생각이다. 일단은 Next.js와 storybook부터 써보려고하는데 생각보다 의욕이 잘 안생겨서 고민이다.",
    "created_at": "2022-10-12T05:17:40.556Z",
    "updated_at": "2025-11-04T16:04:43.736Z",
    "url_slug": "나혼코-11일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "4185ac1b-f5dc-4e9c-9a27-5e92af25806e",
    "title": "TIL - HTTP",
    "short_description": "HTTP",
    "body": "<h1>HTTP</h1>\n\n## 0. HTTP란 뭔가요?\n&nbsp HTTP는 HyperText Transfer Protocol의 약자로 데이터를 주고받기 위해 정의한 통신 프로토콜입니다. HTTP는 애플리케이션 계층으로서 웹 서비스 통신에 사용됩니다. HTTP/1.0부터 시작해서 발전을 거듭해 현재 HTTP/3입니다.\n\n## 1. HTTP의 가장 큰 특징은 뭔가요? ##\n&nbsp **HTTP는 상태가 없는 (stateless) 프로토콜**입니다. 여기서 상태가 없다는 말은 데이터를 주고 받기 위한 각각의 데이터 요청이 서로 독립적으로 관리가 된다는 말입니다. 이전에 보냈던 데이터 요청과 다음에 보낼 데이터 요청이 서로 관련이 없다는 의미이며 이러한 특징 덕분에 서버는 세션과 같은 별도의 추가 정보를 관리하지 않아도 되고, 다수의 요청 처리 및 서버의 부하를 줄일 수 있는 성능 상의 이점이 생깁니다. HTTP 프로토콜은 일반적으로 TCP/IP 통신 위에서 동작하며 기본 포트는 80번입니다.\n\n## 2. HTTP/1.0 ##\n&nbsp HTTP/1.0은 기본적으로 한 연결당 하나의 요청을 처리하도록 설계되었습니다. 이러한 특징 때문에 서버로부터 파일을 가져올 때마다 TCP의 3-Way-Handshake를 계속 열어야 하기 때문에 **RTT가 증가**하는 단점이 있었습니다. 뿐만 아니라 TCP 자체의 흐름 제어와 혼잡 제어 알고리즘으로 인해 네트워크 성능이 100% 나오지 않기도 했습니다. 매번 연결할 때마다 RTT가 증가하니 서버에 부담이 많이 가고 사용자 응답 시간이 길어져 이를 해결하기 위해 이미지 스플리팅, 코드 압축, 이미지 Base64 인코딩을 사용하곤 했습니다.\n\n### 2.1 RTT란?\n&nbsp RTT (Round Trip Time, 왕복 시간)는 패킷망(인터넷) 위에서 패킷을 보내고자 하는 측에서 패킷을 목적지에 보낼 때, 패킷이 목적지에 도달하고 나서 해당 패킷에 대한 응답이 출발지로 다시 돌아오기까지의 시간. 즉, RTT는 패킷 왕복 시간입니다. 네트워크 성능을 측정할 때, RTT는 네트워크 연결의 속도와 안정성을 진단할 때 일반적으로 사용됩니다.\n\n## 3. HTTP/1.1 ##\n&nbsp HTTP/1.0에서 발전한 것으로 매번 TCP 연결을 하는 서이 아니라 한 번 TCP를 초기화 한 이후에 **keep-alive(연결을 유지하는 시간을 제한)**라는 옵션으로 여러 개의 파일을 송수신할 수 있게 바뀌었습니다. 하지만 문서 안에 포함된 다수의 리소스(이미지, css 파일 script 파일)를 처리하려면 요청할 리소스 개수에 비례해서 대기 시간이 길어지는 단점이 있었고 HTTP/1.1의 해더에는 쿠키 등 많은 메타데이터가 들어 있고 압축이 되지 않아 무거웠습니다.\n\n### 3.1 HOL Blocking\n&nbsp HOL Blocking(Head Of Line Blocking)은 네트워크에서 같은 큐에 잇는 패킷이 그 첫 번째 패킷에 의해 지연될 때 발생하는 성능 저하 현상을 말합니다.\n\n## 4. HTTP/2\n&nbsp HTTP/2는 SPDY 프로토콜에서 파생된 HTTP/1.x보다 지연 시간을 줄이고 응답 시간을 더 빠르게 할 수 있으며 멀티플렉싱, 헤더 압축, 서버 푸시, 요청의 우선순위를 처리하는 프로토콜입니다.\n\n### 4.1 멀티 플렉싱\n&nbsp 여러 개의 스트림(시간이 지남에 따라 사용할 수 있게 되는 일련의 데이터 요소를 가리키는 데이터 흐름)을 사용하여 송수신 한다는 것을 의미하며 이를 통해 특정 스트림의 패킷이 손실되었다고 하더라도 해당 스트림에만 영향을 미치고 나머지 스트림은 멀쩡하게 동작할 수 있습니다. 애플리케이션에서 받아온 메세지를 동립된 프레임으로 조각내어 서로 송수신한 이후 다시 조립하며 데이터를 주고받으며 이를 통해 단일 연결을 사용하여 병렬로 여러 요청을 받을 수 있고 HOL Blocking을 해결할 수 있습니다.\n\n### 4.2 헤더 압축\n&nbsp 허프만 코딩(문자열을 문자 단위로 쪼개 빈도수를 세어 빈도가 높은 정보는 적은 비트를 수를 사용하여 표현하고 빈도가 낮은 정보는 비트 수를 많이 사용하여 표현해서 전체 데이터의 표현에 필요한 비트양을 줄이는 원리) 압축 알고리즘을 사용하는 HPACK 압축 형식을 가집니다.\n\n### 4.3 서버 푸시\n&nbsp HTTP/2는 클라이언트 요청 없이 서버가 바로 리소스를 푸시할 수 있습니다.\n\n### 4.4 HTTP/1.1 vs HTTP/2.0\n|비교|HTTP/1.1|HTTP/2.0|\n|------|---------|--------|\n|요청, 응답|커넥션당 하나|커넥션당 N개(다중 요청/응답 가능)|\n|동시전송|불가|가능|\n|속도| | 1.1에 비해 약 50% 정도 빠름|\n\n## 5. HTTP/3\n&nbsp HTTP/3는 기존에 TCP에서 동작하기 때문에 발생하는 문제를 해결하기위해 등장했습니다. TCP는 신뢰성을 지향하기 때문에 데이터 손실이 발생하면 재전송을 수행하게 되는데 TCP는 패킷을 정확한 순서대로 처리해야 되서 재선송을 수행하고 대기하는 과정에서 병목현상이 발생했습니다. 즉, TCP 자체의 HOL Blocking을 해결할 수 없었습니다. 또한 TCP는 혼잡 제어를 수행하기 때문에 전송 속도를 낮은 상태에서 천천히 높이는 방식으로 속도 제어를 취합니다. 이는 네트워크 상황이 좋을 때는 불필요한 지연을 발생시키고 프로토콜 자체의 불필요한 헤더 등도 고칠 수가 없었습니다. 위와 같은 문제들을 해결하기 위해 HTTP/3는 QUIC(TCP의 신뢰성 보장을 위해 제공되는 기능들을 UDP 기반으로 직접 구현하여 성능을 개선한 것) 프로토콜 위에서 동작합니다. 0-RTT 기능을 제공하고 연결 다중화를 지원하며 각 스트림이 동립적으로 동작합니다.\n\n\n## 6.HTTPS\n&nbsp HTTPS는 애플리케이션 계층과 전송 계층 사이에 신뢰 계층인 SSL(Secure Socket Layer)/TLS(Transport Layer Security) 계층을 넣은 **신뢰할 수 있는 HTTP 요청**을 말합니다. HTTPS는 전송 계층에서 보한을 제공하는 프로토콜로 클라이언트와 서버가 통신할 때 SSL/TLS를 통해 제3자가 메세지를 도청하고나 못하도록 하며 공격자가 서버인척 하며 사용자 정보를 가로채는 네트워크상의 '인터셉터'를 방지할 수 있습니다. \n\n\n\n\n",
    "created_at": "2022-10-10T04:56:55.220Z",
    "updated_at": "2026-01-10T08:55:33.156Z",
    "url_slug": "TIL-HTTP",
    "tags": [
      "CS",
      "TIL"
    ]
  },
  {
    "id": "f99f1a43-b3ee-4b66-8bd6-f331c2782ddf",
    "title": "나혼코 10일차",
    "short_description": "나혼코 10일차.",
    "body": "&nbsp 면접을 보고 푹 쉬다가 왔다. 이번 면접을 통해 부족한 부분을 크게 느껴서 당분간은 구직활동을 하지 않기로 했다. 올해에 남은 기간동안 프로젝트도 진행하고 CS공부를 하면서 내년 초쯤에 다시 도전해 볼 예정이다. 그나마 다행인 일은 1달짜리 외주 프로젝트에 합격했다는 점이다. 프로젝트를 진행하면서 돈도 받을 수 있었고 포토폴리오에도 추가 할 수 있어서 좋은 기회가 될 것 같다.",
    "created_at": "2022-10-10T02:24:12.247Z",
    "updated_at": "2025-11-03T19:42:31.133Z",
    "url_slug": "나혼코-10일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "19e730a4-7cbc-4566-8898-4f3ac868f3ff",
    "title": "나혼코 9일차",
    "short_description": "나혼코 9일차.",
    "body": "&nbsp 면접 준비는 끝이 없는 것 같다. 하루종일 CS와 자료구조만 들여다 보았는데 머리에 잘 안들어와서 큰일이다. 당장 면접이 코앞으로 다가왔는데 할 수 있는데까지는 최선을 다해야겠다.",
    "created_at": "2022-10-04T06:45:08.761Z",
    "updated_at": "2025-11-26T17:14:13.462Z",
    "url_slug": "나혼코-9일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "a0d2b41a-ca65-45c8-84a4-40b91d5f86c7",
    "title": "나혼코 8일차",
    "short_description": "나혼코 8일차.",
    "body": "&nbsp 미뤄뒀던 모던 자바스크립트 정독을 시작했다. 진작에 다 읽었어야 했지만 그동안 바쁘다는 핑계로 차일피일 미뤄두었는데 읽어보니 항해를 진행하면서 읽었더라면 코드도 조금 더 좋아졌을 것 같고 부족한 기초 지식을 쌓을 수도 있었을 것 같아 많이 후회되고 아쉬웠다. 그래도 뭐 지금이라도 읽는게 어딘가. 열심히 읽자.",
    "created_at": "2022-10-02T15:12:31.128Z",
    "updated_at": "2026-01-13T05:11:57.652Z",
    "url_slug": "나혼코-8일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "f0d362b5-38b9-4986-93f3-6a02e8905720",
    "title": "나혼코 7일차",
    "short_description": "나혼코 7일차.",
    "body": "&nbsp 강남에 위치한 회사에 서류 합격을 해서 다음 주 목요일에 면접 일정이 잡혔다. 기간이 일주일 정도 남았기 때문에 그동안 아쉬웠던 부분을 채울 수 있어 다행이였다. 이번에는 아쉬운 부분이 없도록 최선을 다해서 면접에 임해야겠다.",
    "created_at": "2022-10-01T08:50:57.779Z",
    "updated_at": "2025-11-11T15:56:24.722Z",
    "url_slug": "나혼코-7일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "c298818a-8948-4504-8cd2-fa970644a7b4",
    "title": "나혼코 6일차",
    "short_description": "나혼코 6일차.",
    "body": "&nbsp 화요일에 봤던 면접 결과가 나왔다. 예상했던대로 결과는 불합격이였다. 면접에서 내가 느낄 정도로 아쉬운 부분이 많았던만큼 합격을 기대하기는 어려웠고 이번 기회를 통해 기초를 조금더 탄탄히 다져서 다음번 면접에서는 내가 만족할만한 답변을 할 수 있도록 노력해야겠다. 결과에 대해서 딱히 아쉽지도 않고 실제로 면접까지 간 것은 처음이라 좋은 경험이라 생각하고 넘기기로 했다.",
    "created_at": "2022-09-30T13:55:07.176Z",
    "updated_at": "2025-11-06T14:59:22.003Z",
    "url_slug": "나혼코-6일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "f0665758-0cce-4856-b217-bf6b121bead7",
    "title": "나혼코 5일차",
    "short_description": "나혼코 5일차.",
    "body": "&nbsp 이번 주에 더이상 면접도 없고 과제도 다음 주부터 진행하기로 얘기를 끝내서 오늘은 하루 종일 편하게 놀았다. 백화점에 가서 여자친구와 커플링도 새로 맞추고 맛있는 것도 먹으면서 그동안 쌓인 스트레스를 풀었다. 주말부터는 다시 바빠질테니 쉴 수 있을 때 쉬어야 겠다.",
    "created_at": "2022-09-28T13:36:53.029Z",
    "updated_at": "2025-11-07T00:58:04.134Z",
    "url_slug": "나혼코-5일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "9713b73c-1cf9-4c65-84f2-c4bad96900f7",
    "title": "나혼코 4일차",
    "short_description": "나혼코 4일차.",
    "body": "&nbsp 오늘은 실제 대면 면접이 있었다. 군자역 근처에 위치한 회사였는데 개발자 두분과 함께 면접을 봤다. 면접은 주로 인성과 프로젝트에 관한 것 그리고 자바스크립트 관련된 내용이였고 면접관 분들이 편하게 대해주셔서 좋은 분위기 속에 면접을 진행할 수 있었다.\n\n&nbsp 프로젝트나 인성 부분은 나름 잘 답변을 했다고 생각하는데 자바스크립트 부분은 조금 아쉬운 부분이 많았다. 면접 질문 중 내가 아쉽다고 생각한 답변을 적어보자면 다음과 같다.\n\n### 1. This란 무엇인가요?\n\n### 2. promise를 사용해 본적이 있나요?\n\n### 3. useState는 비동기인가요 동기인가요?\n\n### 4. 동기와 비동기를 설명해주세요.\n\n### 5. AJAX란 무엇인가요?\n\n### 6. AJAX를 보안하기 위해 나온 것은 무엇인가요?\n\n&nbsp 이중 답변을 했지만 애매하게 한 것도 있었고 부족하게 한 것도 있었다. 특히 3번 같은 경우는 리액트 기초 훅인데도 불구하고 답변을 틀리게 말해서 부끄러웠다. 리액트를 배운지 3달이 되가는데 아직까지도 리액트의 기초 훅에 대한 이해가 부족하다니... 조만간 리액트 훅에 대해서도 깊게 정리해야겠다.\n\n&nbsp 그리고 팀스파르타 면접은 예상했던대로 떨어졌고 항해의 협력사 중 한군데에 서류 합격을 해서 다음 주부터 과제전형을 진행하기로 했다.\n\n&nbsp 면접을 몇 개 봐본 결과 아직까지는 취직을 할 때가 아니라는 생각이 든다. 기초 지식을 멀리하고 구현에만 집중하다 보니 기초 지식은 없고 구현만 할 줄 아는 코더가 되버린 반푼이 같아서 만약 취업이 된다면 가는 것이 맞을까? 잘 모르겠다.",
    "created_at": "2022-09-27T13:07:31.165Z",
    "updated_at": "2025-12-07T04:24:47.859Z",
    "url_slug": "나혼코-4일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "8a84817e-1689-42a0-a0c8-5fcf90be2ed9",
    "title": "나혼코 3일차",
    "short_description": "나혼코 3일차.",
    "body": "&nbsp 이번 주에 있을 면접을 위해 아침 일찍 서울로 올라왔다. 이번 주는 오랜만에 여자친구와 길게 시간을 보내면서 면접 준비에 집중해 보려고 한다.\n\n&nbsp 오후에는 지원했던 팀스파르타의 화상 인터뷰가 있었다. 간단한 것을 물어보신다고 해서 한분이서 면접을 진행하는 줄 알았는데 2분이나 계서서 가뜩이나 떨리던 마음이 곱하기 2가 되는 안타까운 상황이 발생했다. 다행히 면접을 보시는 분들이 편안하게 대해주셔서 떨리는 마음을 가라 앉히고 어느 정도 답변을 할 수 있었지만 내가 생각해도 전반적으로 별로 였다. 가장 아쉽게 답변했던 질문은 **개발자로서 가장 잘 구현할 수 있는 기능**이였다. 크게 생각해본적이 없었던 부분이라 무한 스크롤에 관해 답변을 드렸지만 매우 매우 매우 만족스럽지 못했다. 개발자가 되겠다고 하는 사람이 가장 구현할 수 있는 기능이 뭔지도 모른다니 부끄러울 따름이다.\n\n&nbsp 이번 주 내로 곰곰히 생각해보면서 내가 개발자로서 가장 잘 구현할 수 있는 기능이 뭔지, 그리고 그 기능에 대한 설명을 정리해 봐야 겠다.\n",
    "created_at": "2022-09-26T13:33:01.897Z",
    "updated_at": "2026-01-06T17:38:21.218Z",
    "url_slug": "나혼코-3일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "451430a5-f29a-4df2-b8aa-ca16f1bee30f",
    "title": "나혼코 2일차",
    "short_description": "나혼코 2일차.",
    "body": "&nbsp 오랜만에 나른하게 하루를 보냈다. 간단하게 오전 중에는 내일 있을 면접에 대해 좀 찾아보고 예상면접질문을 공부하는 시간을 보냈고 오후 늦게 부터 개인 프로젝트에 고민하기 시작했다.\n\n&nbsp 첫번째 고민은 **React vs NextJs** 둘중에 어떤 것을 사용할지에 대해서였다. 리액트를 사용한다면 바로 시작할 수 있다는 장점이 있었지만 개인 블로그 프로젝트는 개발을 그만두지 않는 이상 계속해서 발전시켜 나갈 예정인데 멀리 본다면 공부를 하더라도 NextJs를 사용하는 것이 좋아 보였다. 그래서 결국은 개발속도가 조금 밀리더라도 NextJs를 이용하기로 했다.\n\n&nbsp 두번째 고민은 **백엔드**였다. Node를 배워서 혼자하는 것이 가장 이상적이긴 하지만 프론트엔드도 부족한데 백엔드까지 손을 대는 건 아닌 것 같아 일단은 firebase를 이용한 서버리스 개발을 하고 나중에 Node로 옮기는 것으로 결정했다.\n\n&nbsp 세번째 고민은 **'상태관리를 어떻게 할까?**'였다. 일단 firebase를 이용하기 때문에 react-query를 사용할 수 있을지는 조금 찾아봐야 할 것 같고 redux의 경우 항해에서 진행했던 모든 프로젝트를 redux로 진행했기 때문에 다른 상태관리 라이브러리를 사용해 보는 것이 좋을 것 같았다. 지금까지 안써본 상태관리 라이브러리 중 대표적인 건 recoil, mobX 두개가 있는데 recoil의 경우 정식 배포된 것이 아니라서 살짝 아쉬운 감이 있었고 한번 쯤은 써보고 싶었던 mobX와 build-in API인 contextAPI를 활용하기로 했다.\n\n&nbsp 아직 해결 못한 고민들도 남아있는데 디자인 패턴을 어떻게 할지와 테스트 코드의 도입여부이다. 프로젝트의 시작은 있지만 끝이 없어서 이 둘을 어떻게 할지가 앞으로의 유지, 보수 편의성의 관건이 될 것 같아 생각이 많이 필요해 보인다.\n\n",
    "created_at": "2022-09-25T16:16:59.535Z",
    "updated_at": "2025-12-16T06:01:21.075Z",
    "url_slug": "나혼코-2일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "46da6404-b5dc-4090-9c1c-e61e7a1ca4f8",
    "title": "나혼코 1일차",
    "short_description": "나혼코 1일차.",
    "body": "&nbsp 항해가 종료된 후 처음 맞는 주말이였다. 아침에 일어나자마자 무의식적으로 게더에 접속했는데 접속인원이 나혼자인 것을 보고 '아 정말 끝났구나'생각했다.\n\n&nbsp 오후 부터는 앞으로 어떤식으로 공부 방향을 잡을지에 대해 생각했다. 일단 오전중으로는 모던 자바스크립트를 읽고 정리하면서 전반적으로 부족한 자바스크립트에 대한 공부를 하고 오후에는 지금 준비중인 팀 프로젝트와 개인 프로젝트를 진행하기로 했다. 항헤가 끝났다고 다 끝난게 아니니 늘어지지 말고 지금 페이스 그대로 달려야겠다.\n\n&nbsp 계획을 짠 후 간단히 nextJs 인강을 듣고 내일 부터는 본격적으로 개인 프로젝트의 와이어 프레임과 디자인 시안 사용할 라이브러리등을 정해보고 프로젝트에 들어가야겠다.",
    "created_at": "2022-09-24T14:13:41.206Z",
    "updated_at": "2025-11-03T07:15:31.053Z",
    "url_slug": "나혼코-1일차",
    "tags": [
      "초보개발자",
      "프론트엔드"
    ]
  },
  {
    "id": "098829a8-b256-4068-836b-b85ce85c7107",
    "title": "항해 X 동북 ICT 95일차",
    "short_description": "항해 X 동북 ICT 95일차.",
    "body": "&nbsp 길다면 길고 짧다면 짧았던 항해가 종료됬다. 마지막날이기는 했지만 수료식 이외는 특별한 이벤트는 없었고 수료식도 발제와 비슷한 느낌이라 끝났다는 것이 와닿지는 않았다.\n\n![](https://velog.velcdn.com/images/blaze096/post/62ff865f-b3c4-4e08-aca8-4dcad569f39f/image.png)\n\n![](https://velog.velcdn.com/images/blaze096/post/2038e343-57e8-450e-85a4-500e24701d7f/image.png)\n\n\n\n&nbsp 처음 항해를 시작할 때만 해도 내가 TIL을 끝까지 적을 줄은 몰랐다. 일기나 블로그를 작성하는 것을 별로 좋아하지 않아 계획은 했지만 지키지 못할 것이라 생각했는데 이렇게 마지막 글을 작성하고 있다니 신기할 따름이다.\n\n&nbsp 정말 배운점도 많고 좋은 분들을 많이 많나 아쉬움이 많이 남지만 앞으로 갈길이 멀기 때문에 아쉬움은 뒤로 하기로 하고 수료식이 종료되고 githubAction을 이용한 CI-CD를 구현했는데 여러 시행착오를 거친 끝에 성공할 수 있었다. 미숙한 부분이 보이지만 이부분은 차차 공부하면서 알아가야겠다.\n\n&nbsp 앞으로의 계획은 2가지다. 일단 서버리스를 이용해 개인 블로그를 만드는 프로젝트를 진해하면서 10월 1일부터 그간 못써본 기술들을 사용하는 미니 프로젝트를 병행할 예정이고 틈틈히 모던 자바스크립트나 다른 책들을 보며 부족한 자바스크립트를 공부 할 예정이다.\n\n&nbsp 끝으로 같이 항해를 함께한 이노베이션 캠프 A반 모든 분들에게 감사 인사를 전하고 싶다.\n모두 수고하셨습니다.",
    "created_at": "2022-09-23T16:30:02.632Z",
    "updated_at": "2025-11-14T05:16:23.462Z",
    "url_slug": "항해-X-동북-ICT-95일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "6775e276-4ae2-4bc4-be05-811dad148c4a",
    "title": "항해 X 동북 ICT 94일차",
    "short_description": "항해 94일차 일지.",
    "body": "&nbsp 어제 모의면접을 마지막으로 항해 본 커리큘럼에서 할일은 끝나서 천천히 면접 준비를 하려고 했는데 오늘 갑자기 모의 면접을 한번 더 볼 생각이 있냐는 제안이 들어와서 일단 알겠다고 말씀드렸다. 면접은 어제와 같은 방식으로 진행 되는 면접이라 하셔서 또 부랴부랴 면접 공부에 열중했다.\n\n&nbsp 모의 면접관님이 편안하게 대해주셔서 면접은 좋은 분위기 속에서 진행 됬지만 내가 답변한 내용은 썩 좋지는 않았다. 면접관님은 실제로 채용과 모의 면접을 동시에 하시는 분이라 면접을 잘봤으면 채용기회도 있었겠지만 기회는 준비된 사람이 잡는 것이라 나는 아쉽지만 다음기회를 노려야 될 것 같다. 이번에는 답변 못한 내용만 적어보려고 한다.\n\n<hr/>\n\n### 1. base64와 blob의 차이를 아시나요?\n\n#### Binary\n\n이진 데이터 파일\n\n#### Base64\n\n바이너리 데이터를 텍스트로 바꾸는 64진법 인코딩(BinaryToText)으로 바이너리 데이터 대비 33% 데이터의 양이 증가하고 문자열이 길어서 가독성이 떨어지지만 순수 이진 형식으로 남아있는 경우보다 전송/저장이 훨씬 쉽고 브라우저 렌더링 시 문서로딩과 같이 로딩 되기 때문에 끊기지 않고 불러오고 네트워크가 좋지 않아도 위와 같은 특징으로 이미지를 로딩할 수 있다는 장점이 있습니다.\n\n#### Blob\n\nBinary Large Object의 약자로 주로 이미지, 오디오, 비디오와 같은 멀티미디어 파일 바이너리를 객체 형태로 저장한 것을 의미합니다.\n\n#### File\n\nBlob의 기능을 상속하여, 사용자 파일시스템을 제어하기 위한 기능이 추가 된 것으로 File 객체는 Blob에서 lastModified, name 추가 된 Blob 객체 입니다.\n\n#### 그럼 Base64와 Blob의 차이는?\n\nbase64는 바이너리 데이터를 다우기위해 텍스트(문자열)형태로 저장한 포멧이고 blob이란 바이너리 데이터를 다루기 위해 객체 저장하는 것입니다.\n\n\n### 2. 이벤트 전이란 무엇인가요?\n\n특정 화면 요소에서 이벤트가 발생했을 때 해당 이벤트가 더 상위의 화면 요소들로 전달되어 가는 특성을 의미합니다.\n\n### 3. 얕은 복사와 깊은 복사를 아시나요?\n\n얕은 복사(Shallow Copy)는 객체를 복사할 때, 해당 객체만 복사하여 새 객체를 생성합니다. 복사된 객체의 인스턴스 변수는 원본 객체의 인스턴스 변수와 같은 메모리 주소를 참조하며 해당 메모리 주소의 값이 변경되면 다른 객체의 변수 값 역시 동일하게 변경됩니다.\n깊은 복사(Deep Copy)의 경우 객체를 복사할 때 해당 객체와 인스턴스 변수까지 복사합니다. 데이터 참조가 아닌 객체의 형태를 그대로 복사함으로써 한 객체가 변경되어도 다른 객체의 데이터에는 영향을 주지 않습니다.\n\n### 4. 해시 테이블\n\n#### 해시 함수\n\n해시 함수란 데이터의 효율적 관리를 목적으로 임이의 길이의 데이터를 고정된 길이으 ㅣ데이터로 매핑하는 함수입니다. 이때 매핑 전 원래 데이터의 값을 키(key), 매핑 후 데이터의 값을 해시값, 매핑하는 과정 자체를 해싱이라고 합니다. 해시함수는 해쉬 값의 개수보다 대개 많은 키값을 해쉬값으로 변환하기 때문에 해시함수가 서로다른 두개의 키에 대해 동일한 해시값을 내는 해시충돌이 발생하게 됩니다.\n\n#### 해시 테이블\n\n해시 테이블이란 해시함수를 사용해서 변환한 값을 index로 삼아 key와 value를 저장하는 자료구조를 말합니다.\n\n\n### 5. 하이브리드앱 vs 웹앱\n\n하이브리드앱 : 웹 앱과 네이티브 앱의 기능을 결합하여 개발된 앱으로 하나의 코드 베이스로 ios, 안드로이드에 서 둘다 작동됨.\n\n웹앱 : 모바일 웹과 비슷하지만 구동방식이 앱처럼 보이게 한 앱.\n\n<hr/>\n\n&nbsp 모의 면접이 종료된 후 본인이 구현한 기능이나 리액트에 관한 건 답변을 잘해주셨다고 했는데 자바스크립트 기초가 부족하다는 답변을 들었다. 모던자바스크립트 같은 책을 읽으면서 기초 문법을 잘 잡으면 좋을 것같다고 하셨다.\n\n&nbsp 약간 시간이 남아 질문할 시간이 있어 mobX, websocket, ci/cd, nextjs를 사용한 프로젝트를 진행하려고 하는데 어떻게 생각하시냐고도 여쭤보았는데 mobX는 괜찮고 nextjs를 꼭 써보라고 하셔서 다음 프로젝트때는 꼭 next를 써봐야겠다.\n\n#### 참조\n<hr/>\n\nhttps://inpa.tistory.com/entry/JS-%F0%9F%93%9A-Base64-Blob-ArrayBuffer-File-%EB%8B%A4%EB%A3%A8%EA%B8%B0-%EC%A0%95%EB%A7%90-%EC%9D%B4%ED%95%B4%ED%95%98%EA%B8%B0-%EC%89%BD%EA%B2%8C-%EC%84%A4%EB%AA%85",
    "created_at": "2022-09-22T11:36:48.457Z",
    "updated_at": "2025-12-30T08:46:42.073Z",
    "url_slug": "항해-X-동북-ICT-94일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "e902f072-1047-457c-a608-92ac73d6c2c2",
    "title": "항해 X 동북 ICT 93일차",
    "short_description": "항해 93일차 일지.",
    "body": "&nbsp 오전 중으로 면접 예상문제에 대한 질의 응답을 마치고 천천히 면접 준비를 하려고 했을 때 오늘 바로 모의면접 일정이 잡혀서 당황했었다. 1시 쯤에 제출한 것 같은데 모의면접은 오후 5시 30분으로 잡혔고 느즈막하게 공부하려던 원래 계획과는 달리 최대한 많이 공부해 가자는 마음으로 면접 전까지 예상 질문을 보고 또 보았다.\n\n&nbsp 면접은 예상 외로 면접 예상문제에서는 나오지 않고 주로 이력서에 관한 것을 여쭤보셨다. 하셨던 질문들은 다음과 같다.\n\n1. 프로젝트에서 가장 크게 얻은 것은 무엇인가요?\n=> 타입스크립트라고 답변\n2. 타입스크립트를 썼을 때 어떤 장점이 있었나요?\n=> 자바스크립트 보다 좋은 점 어필\n3. 단점으로 어떤게 있었나요?\n=> 개발 속도가 느렸다고 답변\n4. 개발속도가 느렸는데도 왜 타입스크립트를 사용하셨나요?\n=> 처음 사용했기 때문에 초기에는 느렸지만 익숙해 지면 질수록 자바스크립트와의 차이가 없었고 앞서 말한 장점들만 남아 사용 했다 답변\n5. 가장 최근에 본 블로그글이라 레퍼런스가 있나요?\n=> 무한 스크롤 관련 블로그글 답변\n6. 설명 해주세요\n=> 설명\n7. 실제 프로젝트에 적용 하셨나요?\n=> 적용은 하지 못했지만 참고하여 구현했다고 답변\n8. 프로젝트에서 가장 어려웠던 점은?\n=> 지도 데이터 로딩 관련 답변\n9. 리팩토링이 무엇이라고 생각하시나요?\n=> **답변 했지만 잘못된 답변임 공부 필요.**\n10. 리팩토링은 언제하는 것이 좋다고 생각하시나요?\n=> 기능구현후, 프로젝트 마무리 후\n11. 성능 개선을 위해 리팩토링을 하신다고 했는데 성능개선이 없는 리팩토링은 쓸모 없는 리팩토링인가요?\n=> 아니다.\n\n 이 정도가 있었고 나머지는 인성 관련 질문이라 따로 적지는 않겠다. 프로젝트에 관한 것이나 이력서에 적은 건 잘 답변한 것 같은데 잘 한건지 못한 건지는 모르겠다. 말을 절기도하고 앞뒤가 안맞는 말도 많아서 말하는 연습이 많이 필요할 것 같다.",
    "created_at": "2022-09-22T11:07:49.991Z",
    "updated_at": "2025-11-25T17:05:40.833Z",
    "url_slug": "항해-X-동북-ICT-93일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "b3c7ee8f-64b5-446c-929c-6319e5b4bb13",
    "title": "항해 X 동북 ICT 92일차",
    "short_description": "항해 92일차 일지.",
    "body": "&nbsp 오늘은 면접 예상질문에 답을 달아보며 30여개 정도에 기업에 지원했다. 그 중 2개 기업에 서류는 합격한 상태고 2개 기업에서는 떨어졌다.\n\n\n&nbsp 데브코스도 연락이 왔다. 실전 프로젝트를 핑계로 코테 준비를 안했기 때문에 예상했던 결과대로 떨어졌지만 아쉬운 것은 어쩔 수 없는 것 같다.\n\n![](https://velog.velcdn.com/images/blaze096/post/f3af563e-6c20-4a64-8a6d-46ff57c1366f/image.png)\n\n&nbsp 남은 기간동안은 취업 준비에만 매진하라는 뜻으로 받아들이고 면접 준비에만 최선을 다해야겠다.\n",
    "created_at": "2022-09-20T16:06:48.956Z",
    "updated_at": "2025-11-25T17:05:38.449Z",
    "url_slug": "항해-X-동북-ICT-92일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "6c860555-0bdd-4be6-bae5-8f68f17b2233",
    "title": "항해 X 동북 ICT 91일차",
    "short_description": "항해 91일차 일지.",
    "body": "&nbsp 이력서의 작성을 완료했다. 일단 이력서를 노션에 맞춘 뒤에 매니저님께 보여드리며 위치와 글의 내용등을 수정하며 하루를 보냈다. 걱정했던대로 이력서에 핵심이 될만한 내용들이 부족하다는 것을 많이 느꼈다. 웹소켓 사용이나 렌더링 최적화, CI/CD 등등의 내용이 있었으면 더 좋았을 거 같아 실전 프로젝트 때 같이 한 백엔드 분들과 함께 취직이 안된다면 일주일정도 시간을 가져 실전 프로젝트 때 본인이 해보지 못한 기능을 구현하는 미니 프로젝트를 진행하기로 했다. 물론 제일 좋은 건 모두 손잡고 취직되는 거긴 하지만\n\n&nbsp 내일부터는 본격적으로 지원을 해볼 예정인데 과연 몇 군데에서 서류 통과가 될지는 모르겠지만 최선을 다해보고 공부가 더 필요하다고 느낀다면 취업 준비를 더 할 것 같다.\n\n",
    "created_at": "2022-09-19T16:28:06.991Z",
    "updated_at": "2025-11-25T17:05:46.426Z",
    "url_slug": "항해-X-동북-ICT-91일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "8f767aeb-13cd-4a08-9543-c08d98b250cc",
    "title": "항해 X 동북 ICT 90일차",
    "short_description": "항해 90일차 일지.",
    "body": "&nbsp 오늘은 어제 서울을 다녀와서 다 작성하지 못한 이력서를 이어서 작성했다. 살면서 처음 작성하는 이력서다보니 이게 맞나 싶기도 하고 자기소개서도 적은지 오래되어서 작성을 완료하지는 못했다. 노션에 옮기는 것이 좋다고 하는데 노션에 옮겨야 될까도 고민이고 제일 걱정인건 내가 어디까지 통할까에 대한 의문이였다. 부족한 부분이 나에게도 많이 보이는데 실제로 채용을 담당하는 곳에서는 더욱 잘보이지 않을까? 프로젝트에 녹여내지 못한 기술들도 많고 새로 배워야 할 것도 많다. 일단은 고민은 나중에 하는 것으로 하고 내일은 이력서 작성을 마무리해야겠다.",
    "created_at": "2022-09-18T14:13:45.752Z",
    "updated_at": "2025-11-25T17:05:41.800Z",
    "url_slug": "항해-X-동북-ICT-90일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "390c7e1c-2024-4cba-abcc-23e316cac18c",
    "title": "항해 X 동북 ICT 89일차",
    "short_description": "항해 89일차 일지.",
    "body": "&nbsp 오늘은 이력서 관련 특강을 듣고 이력서를 작성하기 시작했다. 막상 이력서를 작성하려고 보니 생각보다 적을게 많지 않아서 많은 도전을 해보지 않았던게 아쉬움이 남았다. 오후에는 전에 신청했었던 프로그래머스 데브코스 코테를 응시했다.\n\n![](https://velog.velcdn.com/images/blaze096/post/c4155085-192f-474c-baeb-d612502f79e5/image.png)\n\n&nbsp 객관식은 쉬운편이라 어려움 없이 풀었는데 코테가 1단계 문제가 한문제 정돈 나올줄 알았지만 전부 2단계 수준의 문제로 나와서 조금 당황했다. 포기하지 말고 풀어보자는 생각으로 최선을 다해서 2문제를 풀었고 마지막 DFS문제는 풀지 못하였는데 테스트 케이스가 2개 내지 3개로 주어져서 푼 문제들도 확실하지는 않은 것 같다.\n\n&nbsp 붙을 확률은 적겠지만 최선을 다해서 풀었고 인생에 첫 코테였던만큼 부족한 부분이 무엇인지도 알 것 같아 다음에 코테를 칠 때 준비해야 할 부분도 방향성이 잡혀서 좋은 경험이였던 것 같다.\n",
    "created_at": "2022-09-16T15:14:35.112Z",
    "updated_at": "2025-11-25T17:05:16.818Z",
    "url_slug": "항해-X-동북-ICT-89일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "e21c38de-2d8d-4905-96c7-d6c8dfaed468",
    "title": "항해 X 동북 ICT 88일차",
    "short_description": "항해 88일차 일지.",
    "body": "&nbsp 대망의 발표일이 다가왔다. 발표는 2시부터 시작이였기에 그전까지 예상 질문들에 대한 답변들을 생각해두면서 시간을 보냈다. 괜히 내가 발표자가 아닌데도 떨려서 죽는 줄 알았다. 발표는 성공적으로 끝났고 그 이후로 협력사 분들의 소개와 다른 조 분들의 발표가 이어졌다. 부스에는 총 2분이 방문해 주셨는데 질문하신 것에 대한 답변이 아직 미숙해서 제대로 의사전달을 못한 것 같아 아쉬웠다. 이번 기회를 통해 조금 더 답변을 조리있게 할 수 있도록 노력해야겠다.\n\n&nbsp 실전 프로젝트가 종료되고 나니 후련했지만 아쉬운 점도 많았다. 렌더링 최적화 부분이라던가 지도에서 데이터를 불러오는 방법 등 아직까지 만족스럽게 해결하지 못한 부분이 남아있기 때문이 것 같다. 이부분을 차차 공부하면서 다음번에는 만족스러운 결과를 도출할 수 있도록 해야될 것 같다.\n\n&nbsp 끝으로 같이 고생하신 팀원분들께 감사하다는 말씀을 전하고 싶다.",
    "created_at": "2022-09-15T13:56:56.599Z",
    "updated_at": "2025-11-25T17:05:20.465Z",
    "url_slug": "항해-X-동북-ICT-88일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "8e680a18-363d-48cf-a4e8-b2f59c515b5d",
    "title": "항해 X 동북 ICT 87일차",
    "short_description": "항해 87일차 일지.",
    "body": "&nbsp 오늘은 리팩터링을 마무리하고 발표자료 정리와 리드미 작성을 했다. 크게 한일은 없긴 한데 어제 늦게 자서 인지 피곤함이 가시지는 않았다.\n\n&nbsp 시간이 될 때마다 무한 스크롤 성능 개선에 관련해서 알아보는데 뾰죡한 수가 나오지 않아서 고민이다. react-window 나 react-virtualized를 이용해서 해보려고 했는데 관련 레퍼런스가 적어서 어려운 것 같다. 뭐 찾다보면 나오겠지.",
    "created_at": "2022-09-14T14:58:00.649Z",
    "updated_at": "2026-01-06T16:03:42.885Z",
    "url_slug": "항해-X-동북-ICT-87일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "94f50fbc-1c73-4424-8d6d-cf08664e685d",
    "title": "항해 X 동북 ICT 86일차",
    "short_description": "항해 86일차 일지.",
    "body": "&nbsp 오늘은 발표자료 준비와 성능개선에 힘썼다. 일단 크게 내가 해야 될 성능개선은 react-virtualized를 이용해 무한 스크롤을 리팩터링 하는 것과 이미지 리사이징이였다.\n 이미지 리사이징은 생각보다 어렵지 않게 끝냈다. compressorjs 라이브러리를 사용했는데 사용법이 어렵지 않아 공식 docs를 참고하니 금방 끝낼 수 있었다. 문제가 있다면 gif 파일을 압축할 때 이미지 타입을 gif로 설정해도 png로 변경되서 이 부분은 확인을 해봐야 될 것 같다.\n\n<center>\n**이미지 압축 전**\n\n<img src =\"https://s3.us-west-2.amazonaws.com/secure.notion-static.com/69cc2ed4-0b09-4290-9a2e-9fe04edda4e3/1.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Credential=AKIAT73L2G45EIPT3X45%2F20220914%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20220914T111454Z&X-Amz-Expires=86400&X-Amz-Signature=4cec0abca48f0c2108a7712d2c4f0cd86b77cfb7e199ef8539a64c76b700a388&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%221.png%22&x-id=GetObject\"/>\n\n**이미지 압축 후**\n\n<img src =\"https://s3.us-west-2.amazonaws.com/secure.notion-static.com/2d33c562-0c7e-4a92-bfe3-1d4811bb500b/2.png?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Credential=AKIAT73L2G45EIPT3X45%2F20220914%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20220914T111515Z&X-Amz-Expires=86400&X-Amz-Signature=4d21ae791a0c532f9e53b0b98e463620a26349ad1f11d8b77b5487946b76ff00&X-Amz-SignedHeaders=host&response-content-disposition=filename%20%3D%222.png%22&x-id=GetObject\"/>\n\n</center>\n\n&nbsp 무한 스크롤 성능개선은 일단 발표자료를 내일까지 제출해야되서 나중으로 미뤄 두었고 새벽까지 팀원분들과 함께 발표자료를 준비했다. 오랜만에 해뜰때까지 했던 것 같은데 몇번을 해도 피곤한건 마찬가지 인 것 같다.",
    "created_at": "2022-09-13T14:52:49.917Z",
    "updated_at": "2025-11-29T20:53:13.844Z",
    "url_slug": "항해-X-동북-ICT-86일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "11a3b8af-e626-4bb9-b0f1-8399ba09b305",
    "title": "항해 X 동북 ICT 85일차",
    "short_description": "항해 85일차 일지.",
    "body": "&nbsp 오늘은 남아 있던 리팩토링 작업을 끝마쳤다. 디자인 패턴에 맞춰서 컴포넌트에서 로직들을 전부 분리하고 커스텀 훅으로 만들었다. 중간 부터는 단순 반복하는 작어빙라 시간이 그렇게 오래 걸리지는 않았고 간간히 나오는 오류들을 수정하고 유저 피드백을 반영했다. 이제 내일 성능 개선만하면 진짜 실전 프로젝트가 거의 종료되는데 마지막까지 최선을 다해서 최선의 결과를 내도록 노력해야겠다.",
    "created_at": "2022-09-12T15:34:01.438Z",
    "updated_at": "2025-11-25T17:05:47.443Z",
    "url_slug": "항해-X-동북-ICT-85일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "63ea2639-79f7-4324-829b-defa9d71b2f1",
    "title": "항해 X 동북 ICT 84일차",
    "short_description": "항해 84일차 일지.",
    "body": "&nbsp 오늘은 본격적으로 컴포넌트 안의 로직들을 커스텀 훅으로 변경하는 작업에 들어갔다. 커스텀훅을 만들어 본 적은 있지만 프로젝트에 도입해본 적은 없어서 조금 걱정이였는데 일단 쉬운 로직부터 커스텀 훅으로 만들어 보기 시작하니 생각보다 작업이 잘 진행되서 다행이라고 생각하는 찰나 역시나 문제가 발생했다.\n\n&nbsp 기존의 커스텀 훅은 불러올때 인수로 string값만 넣어주면 되었는데 지금 만드는 커스텀훅은 인수가 내가 설정한 interface에 있는 값으로 받아서? 설명이 조금 안되긴 하는데 그래서 어떤 인수도 먹지 않고 있다.(오랜만에 받는 타입스크립트 고통ㅜㅜ)\n\n\n![](https://velog.velcdn.com/images/blaze096/post/974ca1aa-4d69-4ffb-bfb3-186da70a5e15/image.png)\n\n커스텀 훅은 위와 같은데 저 onClickToggleModal 부분 때문에 커스텀 훅으로 불러 왔을 때 인수를 잘 못받는 거 같다. 아마 저부분을 수정하던가 아니면 받아올 인수를 확인해야 될 거 같은데 내가 생각한 인수 대부분을 넣어봤는데 안되는 거 보면 모달쪽을 수정하는게 정신건강에 이로울 거 같긴하다. 뭐 내일쯤이면 해결되겠지 뭐.",
    "created_at": "2022-09-11T16:56:36.754Z",
    "updated_at": "2025-11-25T17:05:46.158Z",
    "url_slug": "항해-X-동북-ICT-84일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "bb1950d9-2cbc-4daa-8af5-26cf92fb26e4",
    "title": "항해 X 동북 ICT 83일차",
    "short_description": "항해 83일차 일지.",
    "body": "&nbsp 추석 당일이기도 하고 여자친구 집에 올라와서 오늘은 간단하게 JSX내에 있는 함수들을 밖으로 꺼내는 작업과 불필요한 코드를 지우는 작업정도만 진행했다. 그리던 중 문제가 발생했는데 우리가 배포한 서비스가 프론트나 백 둘중 하나의 서버가 안되거나 도메인에 접근이 안되는 현상이 발생했다. 그래서 급한대로 프론트와 백 둘다 재배포도 진행해 봤지만 바뀌는 것은 없었고 문제를 찾아보니 도메인 문제라는 결론이 나왔다. 다행히도 큰 문제는 아니였고 AWS에서 인증메일 수락을 안해서 발생했던 문제라 인증메일을 수락하는 것으로 문제는 일단락됬다. 큰 문제인줄 알고 놀랐는데 사소한 문제라서 다행이였던 것 같다.",
    "created_at": "2022-09-10T11:01:13.256Z",
    "updated_at": "2025-11-25T17:05:44.470Z",
    "url_slug": "항해-X-동북-ICT-83일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "36c6709a-24b4-4ec0-8dcc-6a11b3effddd",
    "title": "항해 X 동북 ICT 82일차.",
    "short_description": "항해 82일차 일지.",
    "body": "&nbsp 추석연휴가 시작됐다. 물론 추석이라해서 쉬지는 않았고 조금 쉬엄쉬엄하며 하기로 했다. 오전중에 멘토님께 멘토링을 받고 프론트 팀원분과 폴더 구조를 나눈 후 리팩토링에 대해 간단하게 얘기하고 본격적으로 리팩토링에 들어갔다. 일단은 내 코드에 JSX내에서 동작하는 함수들이 많아서 그 함수들을 모두 밖으로 빼내서 나중에 커스텀 훅으로 변경시키기 용이하도록 변경했다. 지금 생각해보면 진작에 이렇게 했으면 편했을텐데 뭐가 그리 급했는지 복사 붙여넣기를해서 보일러 플레이트를 늘렸나 모르겠다. 그리고 커스텀 훅을 만드려는 찰라 문제가 발생했다.\n\n&nbsp 원래는 잘 됐다고 생각했는데 리액트 쿼리에 인피니트 쿼리를 사용하는 부분에서 문제가 발생했는데 게시글을 작성하고 수정, 삭제했을 때 invaildQueries로 수동 리페치를 시켜줘도 반영이 안되서 삭제를 해도 목록에 그대로 남아있는 현상이 발생했다. 기존에 2번정도 발생했던 문젠데 그때마다 고쳤다고 생각하고 넘어갔는데 왜 또 발생했는지 모르겠었지만 당장에 서비스를 하고 있는 입장이라 빠르게 hoxfix에 들어갔다.\n\n&nbsp 리액트 쿼리에 docs를 보니 원래 내가하는 방식대로 리패치를 시키는게 아닌 것 같아서 docs에 나온대로 수동 리패치 방식을 변경해 봤으나 소용이 없었고 여러 레퍼런스를 기웃거려 봤으나 뾰족한 수는 나오지 않았다. 그래서 최후의 방법으로 쿼리의 캐시타임을 0으로 만들고 일단은 서비스에 지장이 없게 하려고 했으나 그것도 소용이 없었다. 참으로 난감한 순간이였는데 급한 불은 의외의 오타에서 껴졌다. 원래는 refetchQueries를 사용하려고 했는데 ide에 자동완성기능으로 removeQueries로 잘못쳐서 그걸 모른체 확인해 봤는데 내가 생각했던데로 기능이 정상 동작했다. 이게 쿼리의 캐시데이터를 다 밀어버리고 새로 받아와서 되는 것 같았는데 이러면 쿼리를 쓰는 의미가 없다고 생각됬지만 일단은 서비스를 동작시키는게 우선이라는 생각이 들어 나중에 수정하는 것으로 하고 넘어가기로 했다. 리액트 쿼리는 쓰면 쓸수록 생각해야 될 요소가 너무 많아지는 것 같아 어려운 것 같다.",
    "created_at": "2022-09-10T11:00:40.082Z",
    "updated_at": "2025-11-25T17:05:24.881Z",
    "url_slug": "항해-X-동북-ICT-82일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "6fa61be8-85d6-4278-9a27-0f64839d2f8b",
    "title": "항해 X 동북 ICT 81일차",
    "short_description": "항해 82일차 일지.",
    "body": "&nbsp cypress를 이용한 E2E테스트도 잠정 보류하기로 했다. 앞전에 유닛 + 통합 테스트를 진행할 때와 마찬가지로 우리 서비스의 특성상 유저 상호간에 조작으로 인해 발생하는 이벤트들이 많은데 그것들의 테스트가 복잡하기도 하고 원래 유닛 + 통합 테스트를 진행하면서 리팩토링을 병행하는 계획을 세웠었는데 리팩토링이 진행되지 않은 상태에서의 통합테스트가 어려운 부분도 잇었기 때문에 일단 리팩토링부터 진행하고 그 이후에 로직들의 테스트가 용이해지고 시간이 허락한다면 로직 테스트를 진행하기로 했다. 막상 당장 안한다고 하니 짐을 하나 던거 같아 좋기도 하면서 아쉽기도 한데 일단은 얼른 리팩토링을 진행하고 테스트 코드도 짜는 쪽으로 생각해야 될 것 같다.",
    "created_at": "2022-09-10T11:00:06.507Z",
    "updated_at": "2025-12-01T02:40:01.967Z",
    "url_slug": "항해-X-동북-ICT-81일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "9e639315-65f5-428a-bf85-120848675e88",
    "title": "항해 X 동북 ICT 80일차",
    "short_description": "항해 80일차 일지.",
    "body": "&nbsp 일단 유닛 + 통합 테스트코드는 안하고 E2E 테스트 코드만 작성하기로 했다. 그 이유는 몇일 동안 하면서 느낀거지만 단기간내로 처리할 수 있을 정도로 테스트 코드는 만만하지 않았고 관련 레퍼런스가 적어 참고할만한 부분이 많이 적었다. 아무래도 프론트의 경우 테스트 코드의 중요성이 백엔드에 비해 많이 떨어지는 만큼 시도하는 사람들이 크게 많은 것 같지 않았다, 또 프로젝트의 규모가 큰 만큼 고려해야 할 요소도 많았을 뿐더러 실시간을 2명에서 테스트를 진행해야 되기 때문에 기간 내에 모든 것을 다하기에는 어려울 것 같아 전체적으로 잘 동작하는지만 테스트하는 E2E만 작성하기로 했다.\n\n&nbsp E2E 테스트 코드는 cypress를 이용하여 작성하기로 했는데 되게 직관적이라 이번에는 어렵지 않게 할 수 있을 것 같은 느낌이 들긴한다. ",
    "created_at": "2022-09-07T07:03:56.717Z",
    "updated_at": "2025-11-25T17:05:30.328Z",
    "url_slug": "항해-X-동북-ICT-80일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "dda7a41f-8b76-4c7c-aeb3-cfa0a55b8ff4",
    "title": "항해 X 동북 ICT 79일차",
    "short_description": "항해 79일차 일지.",
    "body": "&nbsp 저녁까지 계속해서 문제점을 찾고 수정하고를 반복해서 일단 눈에 띄는 문제는 모두 해결했다. 앞으로 또 나올수도 있지만 그건 그때가서 생각하도록 하고...\n\n&nbsp 서비스 준비가 다 끝난 만큼 이제 프로젝트에 마지막에 하려고 했던 테스트코드 작성과 리팩토링을 하는 단계로 넘어가기로 했다. 프론트에서 할 것은 Jest와 React-Testing-Library를 이용한 유닛 + 통합 테스트로 테스트 코드도 작성하면서 리팩토링까지 해결하기로 했다.\n\n&nbsp 테스트 코드를 작성하는 것도 역시나 어려워서 난항이 예상되는데 기간이 조금 널널하다면 어느 정도 공부하면 할 수 있긴 하겠지만 프로젝트의 종료가 2주도 안남기도 했고 생각보다 레퍼런스가 많이 적어서 벌써부터 걱정이 앞선다.\n\n\n\n",
    "created_at": "2022-09-06T10:31:40.714Z",
    "updated_at": "2025-11-25T17:05:34.987Z",
    "url_slug": "항해-X-동북-ICT-79일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "aef6b130-9b8d-4954-9bed-6664b849ffe0",
    "title": "항해 X 동북 ICT 78일차",
    "short_description": "항해 78일차 일지.",
    "body": "&nbsp 오늘은 하루종일 기능 테스트를 하면서 안되는 부분들을 고쳐나갔다. 기능이 안되는 경우는 드물었고 대부분이 디자인에 관련된 부분이라 그렇게 어려운 부분은 없었지만 자잘하게 많이 고쳐야 되서 생각보다 시간이 오래 걸렸다. 아직까지 완벽하게 테스트가 된 것은 아니라서 몇일 더 테스트를 해보고 서비스를 시작할 것 같다.",
    "created_at": "2022-09-05T17:35:47.329Z",
    "updated_at": "2025-11-25T17:05:45.854Z",
    "url_slug": "항해-X-동북-ICT-78일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "ea433482-7ac6-4641-b408-1f46055eecc0",
    "title": "항해 X 동북 ICT 77일차",
    "short_description": "\b항해 77일차 일지.",
    "body": "&nbsp 오늘은 지도에서 현재 모서리에 좌표를 얻어오는 로직을 미리 만들어 두어서 백엔드 쪽에 로직이 완료되면 바로 적용할 수 있도록 하고 소소하게 마커 클러스터를 추가 했다. 둘다 어렵지 않은 작업이라 금방 끝내버렸고 그 후로는 게시글 작성 시 벨리데이션에 이상한 부분이 있어 수정 후 다른 자잘한 부분들도 수정했다. 뒤로 가면 갈수록 더 이상 새로 짜는 부분 보단 유지, 보수에 치중하게 되는 것 같은데 이래서 유지, 보수가 용이한 코드를 짜는 것이 중요하다는 것을 느낀다.\n\n&nbsp 남는 시간에는 테스트 코드에 관한 공부를 조금 해봤다. 금방 할 수 있을 줄 알았는데 생각보다 쉽지는 않은 것 같아서 많은 공부가 필요할 것 같다. jest와 testing library 두개를 사용할 예정인데 둘다 쉽게 테스팅을 할 수 있도록 만들어졌다고 하니 익숙해지면 괜찮지 않을까?",
    "created_at": "2022-09-04T14:24:45.945Z",
    "updated_at": "2025-12-16T01:48:18.429Z",
    "url_slug": "항해-X-동북-ICT-77일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "64f8644a-8607-4d48-a11c-8f997b77c66b",
    "title": "항해 X 동북 ICT 76일차",
    "short_description": "항해 76일차 일지.",
    "body": "&nbsp 오늘은 늦잠을 자버려서 아침 멘토링에 가지 못했다. ㅠㅠ 팀원 분들께 상당히 죄송했다. 프로젝트가 막바지에 다다라서인지 크게 할일은 없었고 간단한 코드 수정과 지도에서 마커를 찍어 줄 때의 데이터를 어떤 방식으로 받아올지에 대해 하루종일 연구했다.\n\n&nbsp 안은 크게 3개 정도로 나왔다. 첫번째는 어차피 데이터의 양이 얼마 안될 것으로 보이니 초기 렌더링 시 모든 데이터를 한번에 받아오는 방법이였다. 제일 편한 방법이였지만 데이터가 만개, 십만개를 넘어 갔을 경우에 한번에 데이터를 받아오는 방식은 렌더링에 이슈가 생길 것이 분명했기 때문에 최후에 보루로 남겨두기로 했다.\n\n&nbsp 두번째는 카카오맵 api에서 지원하는 지도의 level 변화 값을 측정해 level 별로 데이터를 받아올 반경을 정해두고 불러오는 방식이였다. 초기 의도는 페이지네이션을 위해서 였는데 기존에 무한스크롤 적용할 시 페이지가 위 아래로만 움직이는 것과는 달리 지도는 상하좌우 모두 움직일 수 있기 때문에 페이지가 넘어가는 부분을 어떻게 관측할 것인가에 대한 해답을 찾지 못했다.\n\n&nbsp 마지막으로는 지도의 모서리의 좌표값의 변화를 관측해서 그때마다 다시 데이터를 불러오는 방식이였다. 네이버 부동산이 이러한 방식을 채택하고 있었는데 딱 사용자가 원하는 만큼의 데이터만 불러올 수도 있고 기술적으로도 크게 바꿀 부분이 없어서 일단 마지막 방법을 이용해서 데이터를 불러오기로 정했다.\n\n&nbsp 코딩을 시작한지 얼마되지 않았지만 이렇게 레퍼런스가 적은 적은 처음인 것 같다. 검색을 잘못했나라고 생각도 해봤는데 그것도 아닌 것 같고... 구글이 항상 정답을 보여주지는 않는 듯 싶다.",
    "created_at": "2022-09-03T15:22:10.565Z",
    "updated_at": "2025-11-25T17:05:37.236Z",
    "url_slug": "항해-X-동북-ICT-76일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "57f81e48-afff-4a5d-b1d7-9277045519cd",
    "title": "항해 X 동북 ICT 75일차",
    "short_description": "\b항해 75일차 일지.",
    "body": "&nbsp 오랜만에 이른시간에 글을 쓰는 것 같다. 어제 새벽에 발견했던 윈도우에서 디자인이 깨지는 현상과 수정하면 좋을 부분을 수정하고 지금은 렌더링 최적화에 대해 공부중이다. 일단은 useMemo와 useCallback의 사용법에 대해 계속 공부하고 있는데 아직까지 기본적인 부분을 제외하고는 아리송한 부분이 많다. 공부하다보면 편하게 쓸날이 오겠지 뭐.\n\n&nbsp 지금까지 리액트를 공부하면서 렌더링 최적화에 대해 제대로 고민을 해본적이 없어서 이번 기회를 통해 깊게 공부를 해볼 예정이다. 지금까지 해온 프로젝트는 대부분 1주일이 안되는 기간 동안에 제작하는 프로젝트였던만큼 최적화에 대한 필요성을 못느꼈는데 실전 프로젝트의 경우 스코프가 큰 만큼 렌더링이 느린게 눈에 보일 정도라 시급하게 개선이 필요해 보인다. 남은 2주 동안 성능개선과 렌더링 최적화에 몰두해서 프로젝트의 완성도를 높이는데 집중해야겠다.",
    "created_at": "2022-09-02T13:32:30.802Z",
    "updated_at": "2025-11-25T17:05:37.761Z",
    "url_slug": "항해-X-동북-ICT-75일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "93597a14-24ae-4f8e-87b0-b985c7fa7166",
    "title": "항해 X 동북 ICT 74일차",
    "short_description": "항해 74일차 일지.",
    "body": "&nbsp 오늘은 마지막으로 남아있던 지도 페이지에 디자인을 입히고 로직을 약간 변경하여 기존에 모달 방식에서 한 곳에 고정된 모달에서 경기에 관한 정보가 나오는 방식으로 변경하였다. 그 후에는 계속해서 디자인을 확인하고 기능을 점검하면서 안되는 부분을 수정하며 하루를 보냈다. 오늘을 마지막으로 이제 더 이상 디자인을 새로 입힐 일은 없을 것 같고 수정만 진행 될 것 같다. 한가지 아쉬운 점은 모달을 띄웠을 때 모달 바깥 영역을 클릭했을 때 닫히게 하고 싶었는데 다른 페이지에서는 잘 동작하던 로직이 지도에서는 잘 동작하지 않아서 이부분은 다음에 수정해야 겠다.",
    "created_at": "2022-09-02T09:25:18.907Z",
    "updated_at": "2025-11-25T17:05:34.638Z",
    "url_slug": "항해-X-동북-ICT-74일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "564021f4-25c9-47c5-b07a-ba4582e0e570",
    "title": "항해 X 동북 ICT 73일차",
    "short_description": "항해 73일차 일지.",
    "body": "&nbsp 오늘은 디자이너 분이 지적해 주셨던 디자인에 관련된 부분을 수정하고 기타 다른 디자인을 입힌 부분들에 대해서 점검하는 시간을 가졌다. 생각보다 빠져있던 부분도 많고 다르게 적용되어 있던 부분도 많아서 다음부터는 초기에 디자인 입힐 때 확실하게 체크하면서 넘어가야 할 것 같다.",
    "created_at": "2022-09-01T13:34:20.856Z",
    "updated_at": "2025-12-30T19:16:58.283Z",
    "url_slug": "항해-X-동북-ICT-73일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "dd949db9-87c9-4c19-9db5-fc941833fc4b",
    "title": "항해 X 동북 ICT 72일차",
    "short_description": "항해 72일차 일지.",
    "body": "&nbsp 오늘은 기존에 있던 코드의 수정과 컴포넌트를 함수로써 동작하는 안티패턴을 수정하고 참가 페이지를 기존에 리덕스로 데이터를 관리하는 방식에서 props로 넘기는 방법으로 변경하였다. 생각보다 참가 페이지에 분기처리가 많아서 컴포넌트를 많이 나누었는데 props를 넘기는 일이 많아져서 이건 나중에 리팩토링할 때 수정을 해야될 것 같다.",
    "created_at": "2022-08-31T17:44:21.054Z",
    "updated_at": "2025-11-25T17:05:21.481Z",
    "url_slug": "항해-X-동북-ICT-72일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "02e598ab-2ce6-4893-ac8c-9e76deb8c827",
    "title": "항해 X 동북 ICT 71일차",
    "short_description": "항해 71일차 일지.",
    "body": "&nbsp 오늘도 역시 디자인을 입히는 작업을 했다. 오늘은 리뷰페이지에 대한 디자인을 입히고 코드를 수정하면서 작성한 리뷰가 실시간으로 올라가도록 로직을 변경했다. 이건 쿼리가 리페치가 안되는 문제였기 때문에 빠르게 수정할 수 있었다.",
    "created_at": "2022-08-31T11:08:25.861Z",
    "updated_at": "2026-01-12T01:05:10.570Z",
    "url_slug": "항해-X-동북-ICT-71일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "9e458b9e-26fd-4bc6-9cca-ed40b2a23049",
    "title": "항해 X 동북 ICT 70일차",
    "short_description": "항해 70일차 일지.",
    "body": "&nbsp 오늘도 어제와 마찬가지로 디자인을 입히는 작업을 했다. 남아있던 페이지인 참가 페이지와 게시글 상세페이지에 대한 디자인을 입혔고 어제와는 달리 커스텀 해야되는 부분이 없었기 때문에 작업은 순조롭게 진행되서 비교적 빨리 끝낼 수 있었다.",
    "created_at": "2022-08-30T15:14:51.646Z",
    "updated_at": "2025-12-10T02:48:58.296Z",
    "url_slug": "항해-X-동북-ICT-70일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "93e224eb-6cd2-46bb-974b-c1a0320d0037",
    "title": "항해 X 동북 ICT 69일차",
    "short_description": "항해 69일차 일지.",
    "body": "&nbsp 오늘은 게시글의 디자인이 나와서 게시글 작성과 수정부분에 디자인을 입히는 작업을 했다. 나온 디자인에 캘린더와 셀렉트 박스가 기본이 아니라 커스텀을 해야 되는 부분이라 캘린더의 경우는 react-calendar 라이브러리를 사용하여 커스텀해서 구현했고 셀렉트 박스의 경우 div와 button을 이용해서 구현했다. 셀렉트 박스에 애니메이션이 자꾸 안걸려서 일단은 넘어가긴 했는데 이건 추후에 고쳐봐야겠다.",
    "created_at": "2022-08-30T15:14:39.917Z",
    "updated_at": "2025-12-04T01:06:02.056Z",
    "url_slug": "항해-X-동북-ICT-69일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "5b783a83-72bb-406d-a71b-3495a9fa9571",
    "title": "\b항해 X 동북 ICT 68일차",
    "short_description": "\b항해 68일차 일지.",
    "body": "&nbsp 일주일 동안 너무 바쁘게 달려와서인지 피로가 안풀려서 오늘은 간단하게 코드와 디자인의 수정만 진행했다. 실전 프로젝트도 어느덧 막바지로 다가오는데 마지막까지 최선을 다해봐야겠다. ",
    "created_at": "2022-08-27T13:41:56.543Z",
    "updated_at": "2025-11-25T17:05:31.310Z",
    "url_slug": "항해-X-동북-ICT-68일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "4447ca7f-d0a8-4055-8f5f-3fa2054cbf9b",
    "title": "\b항해 X 동북 ICT 67일차",
    "short_description": "\b항해 67일차 일지.",
    "body": "&nbsp 오늘은 지도 페이지에서 있던 문제를 고치고 리뷰기능을 구현했다. 지도 페이지에서 있던 문제는 페이지가 렌더링 될 때 리덕스에 데이터가 휘발되서 지도 페이지에 마커가 찍히지 않았었는데 redux-persist를 이용해서 초기에 받아온 위치 값을 세션 스토리지에 저장함으로서 문제를 해결 할 수 있었다.",
    "created_at": "2022-08-25T16:33:58.872Z",
    "updated_at": "2025-11-25T17:05:28.368Z",
    "url_slug": "항해-X-동북-ICT-67일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "73714dd2-2f3d-4dd2-934a-5b4ae2867946",
    "title": "항해 X 동북 ICT 66일차",
    "short_description": "항해 66일차 일지.",
    "body": "&nbsp 오늘은 메인 페이지에 있는 버튼들을 리덕스를 이용하여 각각에 알맞는 페이지로 연결시키는 기능 부터 구현을 시작했다. 리덕스 자체는 이제 어느 정도 익숙해져서 금방 처리했고 그 이후로는 지도에 집중했다.\n\n&nbsp 오후 쯤이 되서 지도 페이지를 서버와 연결해서 테스트를 했는데 다행이도 마커는 위치기반으로 잘 찍혔다. 문제는 오버레이가 마커의 개수 이상한 장소에 나와서 이 부분을 해결하는데 시간이 많이 사용했다.\n\n&nbsp 처음엔 단순하게 마커안에서 다시 반복문을 돌리면 될 줄 알았는데 서버 쪽에서 받아오는 데이터가 객체였고 객체 반복문을 다시 돌려고하니 타입 스크립트 쪽에서 문제가 생겨 일단은 마커를 클릭 했을때 마커 안에 담겨있는 정보들을 리덕스로 보내고 오버레이에 관한 정보를 다시 리덕스에서 가져오는 식으로 해결했다. 리덕스를 자주 사용하는 건 좋지 않다고 봤었는데 요즘 안되는 것이 있다면 리덕스로 해결하는 것 같다. 이 부분은 리팩터링 할 때 다시 한번 보면서 수정 할 수 있다면 리덕스를 사용하지 않는 방식으로 해야겠다. 그 이후로는 지도를 로딩 할 때 본인 위치를 가지고 오는 것이 느려서 홈페이지가 렌더링 될 때 본인 위치를 가져오는 것으로 변경해서 지도으 로딩 속도를 늘렸다.\n\n&nbsp 디자인이 얼른 나와야 할텐데 아직까지 내가 맡은 페이지에서는 나오지 않아서 조금 걱정이다 27일날 중간 발표날까지 맞추려면 빠듯할거 같은데 뭐 일단은 조금 기다려 봐야겠다.",
    "created_at": "2022-08-24T15:55:20.317Z",
    "updated_at": "2025-11-25T17:05:27.777Z",
    "url_slug": "항해-X-동북-ICT-66일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "40742464-ce55-450e-b6b5-0f881eced851",
    "title": "항해 X 동북 ICT 65일차",
    "short_description": "항해 65일차 일지.",
    "body": "&nbsp 오늘은 게시글 목록 페이지를 디자인 대로 변경하고 정렬을 셀렉트 박스가 아닌 밑에서 올라오는 슬라이드 팝업으로 바꾸는 작업을 했다. 생각보다 디자인이 나온 그대로 맞추는게 어려웠을 뿐더러 팝업에 애니메이션 부분에 CSS가 말을 잘 안들어서 이부분을 해결하는데도 시간이 걸렸다. \n\n&nbsp 슬라이드 애니메이션은 잘 동작하는데 자꾸 게시글 목록에 뒤로 보여져 슬라이드 팝업이 안보이는 현상이 발생했었다. 아마 최상위 노드가 아니여서 그런 것 같았는데 돔트리에 대해서 조금더 이해가 필요할 것 같다. 일단은 최상위 컨포넌트로 빼내서 해결한 상태이다.\n\n&nbsp 프로젝트가 윤곽이 많이 나와서 점점 크게 할일은 없고 코드를 리펙터링 하거나 간결하게 하는 부분에 대해서 신경을 많이 써야 될 것 같다. 내일은 지도에 관련된 부분을 마무리 짓고 메인페이지에 있는 버튼들을 연결시키는 작업을 해야겠다.",
    "created_at": "2022-08-24T13:16:10.797Z",
    "updated_at": "2025-11-25T17:05:18.431Z",
    "url_slug": "항해-X-동북-ICT-65일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "234240eb-e679-47ff-a6f1-82bb461ca3d4",
    "title": "항해 X 동북 ICT 64일차",
    "short_description": "항해 64일차 일지.",
    "body": "&nbsp 오늘은 검색 페이지와 경기 결과를 입력하는 부분을 만들었다. 검색 기능이 처음이라 어려울 줄 알았는데 생각보다 크게 할 것은 없어서 다행이였다.\n\n&nbsp 오후에는 현재 위치 기반으로 경기 정보를 불러오는 기능을 만들었다. 아직 서버랑 붙여보기 전에라 될 지 안될지는 모르는데 그건 뭐 붙여보면서 해결하면 될 것 같다.",
    "created_at": "2022-08-24T13:16:01.149Z",
    "updated_at": "2025-11-25T17:05:42.751Z",
    "url_slug": "항해-X-동북-ICT-64일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "45622966-6a38-41dc-afc0-631c74ff3056",
    "title": "항해 X 동북 ICT 63일차",
    "short_description": "항해 63일차 일지.",
    "body": "&nbsp 오늘은 느즈막히 일어나 어제 해결 못했던 리덕스 문제를 해결했다. 다른 분이 도와주셔서 해결할 수 있었는데 지난번에 이미지가 맵핑이 안되는 문제도 해결해 주셨어서 너무 감사하다. **(문제는 내가 그냥 리듀서를 잘못불러왔다. RTK 공부가 조금더 필요해 보인다.)**\n \n &nbsp 이제 프로젝트에서 구현할 기능이 2개 정도 남은 시점이라 조금은 천천히 가기로 했고 남은 시간에는 2문제 남았던 프로그래머스의 1단계 알고리즘 문제를 다 풀고 그 뒤로 2단계 문제를 풀었다. 항해가 끝나기전까지 2단계 올솔이 목표인데 이제 한문제 풀었으니 남은건 71문제니까 하루에 3문제 정도는 풀어야 되는데 시간이 그만큼 되려나 모르겠다. 뭐 일단 풀 수 있을 만큼은 최대한 풀어 볼 예정이다.",
    "created_at": "2022-08-21T12:43:55.962Z",
    "updated_at": "2025-11-25T17:05:38.406Z",
    "url_slug": "항해-X-동북-ICT-63일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "e868905d-c7ef-4637-ae1a-acc7a7d07c6d",
    "title": "항해 X 동북 ICT 62일차",
    "short_description": "항해 62일차 일지.",
    "body": "&nbsp 오늘은 오전에 간단히 멘토링을 받고 오후 부터 본격적으로 남은 지도 작업을 시작했다. 시작부터 난관이 많았는데 일단 지도에 검색기능을 넣고 싶어 여러 레퍼런스들을 참고하며 도전한 결과 기깔나게 실패했다. 일단 뭐가 문제인지는 잘 모르겠어서 다음 번에 다시 시도를 해보는 것으로 했다.\n\n&nbsp 게시글 작성 페이지에서 지도 페이지로 넘어갔다가 다시 돌아온다면 그 전에 작성했던 글들이 휘발 될 것 같아서 일단은 게시글 작성 페이지에서 지도 페이지를 모달로 띄운다음에 리덕스로 상태관리를 하는 쪽으로 하기로 했다. 모달도 뚝딱 만들어 버리고 툴킷으로 상태 관리를 하려는데 툴킷과 타입 스크립트를 조합을 잘못했는지 디스패치를 하려는 부분에서 자꾸 오류가 나서 지금은 그곳을 수정하고 있다. 뭐 내일쯤이면 되지 않을 까 싶다. 데이터 불러와서 커스텀 오버레이로 띄워주는 부분은 쉬울 것 같기도 하고.",
    "created_at": "2022-08-20T16:51:07.773Z",
    "updated_at": "2026-01-09T10:22:51.004Z",
    "url_slug": "항해-X-동북-ICT-62일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "e343f451-a81c-4676-a11f-dfeb733b0efa",
    "title": "항해 X 동북 ICT 61일차",
    "short_description": "항해 61일차 일지.",
    "body": "&nbsp 오늘은 수정 페이지에서 기존에 있던 이미지를 지우려고 할 때 미리보기를 지우는 것과 이번에 발견한 문제인 이미지가 포스트랑 맵핑이 안되는 현상, 게시글을 작성할 때 미리보기만 삭제되고 파일리스트에는 그대로 남아 있는 현상 그리고 부수적으로 기존에 이미지를 업로드 할때 타입스크립트를 무시하고 올렸던 부분 등을 수정했다.\n\n&nbsp 일단 기존에 있던 이미지를 지우는 것은 값들을 Link로 받아와서 수정이 되지 않았었는데 이부분을 data가 있을 때 마운트 될때 state로 저장을 시키는 것으로 변경하였고 마찬가지로 이미지를 보여주는 반복문도 state값으로 변경하여 해 했고 이미지가 포스트랑 매핑이 안되는 현상은 다른 분들의 도움 받아 해결했는데 기존에 로직은 \n\n_**게시글 업로드 => response로 postId를 받아옴 => postId를 state에 저장 => state에 있는 postId에 이미지를 업로드**_ \n\n방식이 였는데 이 방식 대로하면 리렌더링이 일어나지 않아 state가 제 때 반영이 되지 않아 이미지가 제대로 맵핑이 되지 않았다. 그래서 로직을 다음과 같이 변경해 해결 할 수 있었다.\n![](https://velog.velcdn.com/images/blaze096/post/1ba9db2f-4598-4cf9-886e-701efc138873/image.png)\n\n&nbsp 파일 리스트에 있는 이미지를 지우는 건 생각보다 까다로웠는데 일단 파일 리스트 객체 자체로는 삭제가 안된다고 한다. 그래서 객체를 배열로 바꾼 다음에 삭제 기능을 구현하니 정상적으로 삭제가 되었다.\n\n&nbsp 마지막으로 해결한 문제는 위의 문제를 해결하다가 얼떨결에 해결한 것인데 내가 그냥 잘못 봤던 건데 지금까지 객체를 반복문을 돌리려고하니까 오류가 난 것이였고 나는 그것도 확인안하고 애꿎은 오류만 무시했다. ~~_**(컴퓨터는 거짓말하지 않는다.ㅠㅠ)**_~~  파일리스트를 배열로 바꾸고 반복문을 돌리니 아무우우런 문제 없이 잘 돌아갔다. 찝찝했던 부분이였는데 해결이 되서 다행이긴 했다. 다음부터는 조심해야지\n",
    "created_at": "2022-08-19T16:00:30.074Z",
    "updated_at": "2025-12-05T01:42:21.152Z",
    "url_slug": "항해-X-동북-ICT-61일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "9cb1503f-c79b-4f82-9009-191c4e238d93",
    "title": "항해 X 동북 ICT 60일차",
    "short_description": "항해 60일차 일지.",
    "body": "&nbsp 오늘은 수정 페이지를 만들었다. 지난 번 미니 프로젝트 때에는 수정 페이지를 나누어서 만들었지만 이번에는 작성 페이지에서 수정까지 가능 하도록 만들었다. 지난 번부터 이 방법으로 수정페이지를 만들고 싶었는데 이번 기회에 구현에 성공해서 다행이였다.\n\n&nbsp 방법은 의외로 간단했는데 react-router-dom에 Link를 이용하여 상세 페이지에서 작성페이지로 넘겨 주었고 작성 페이지에서 전달한 값이 있을 때에만 수정 페이지로 보이도록 했다.\n\n**게시글 상세 페이지**\n![](https://velog.velcdn.com/images/blaze096/post/e4ef94d0-6225-43e2-acc1-de74ccf543a3/image.png)\n\n**게시글 작성 페이지**\n![](https://velog.velcdn.com/images/blaze096/post/f7b2a986-76f3-4fd6-9064-87f91772ec08/image.png)\n\n&nbsp 서버랑 붙여본 결과 게시글 수정은 잘 되었고 내일 쯤 이미지 수정을 확인 할 수 있을 것같다. 오늘 테스트 하면서 알게 된 사실인데 수정 페이지에서 기존에 있던 이미지를 불러 왔을 때 이미가 DB에서 삭제는 되지만 미리보기에는 남아 있는 것을 발견 했다. 내일은 이부분도 수정을 해야 될 것 같다.",
    "created_at": "2022-08-18T17:57:57.769Z",
    "updated_at": "2025-11-25T17:05:29.654Z",
    "url_slug": "항해-X-동북-ICT-60일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "480d1f3b-413f-412c-a3cd-b33d87b288e3",
    "title": "항해 X 동북 ICT 59일차",
    "short_description": "항해 59일차 일지.",
    "body": "&nbsp 오늘은 어제 만들었던 상세 페이지와 더불어 목록 페이지를 서버랑 확인해 봤다. 시작부터 난관이 였는데 아예 목록을 불러오지를 못해서 이 부분을 수정하느냐고 애를 먹었는데 알고보니 기존에 로그인 할 때 남아있던 토큰 값때문에 문제가 생겼던 것 같다. 토큰 값을 지우고 다시 로그인을 하니 문제없이 데이터를 받아졌다.\n\n&nbsp 문제가 이것 뿐이였으면 좋았겠지만 다른 문제들도 있었다. 일단 데이터는 들어오는데 데이터를 가공해서 보여주는 쪽에서 문제가 생겨서 예외 처리가 안되어 있었고 반복문도 한번이 아니라 두번을 돌리는 것이 맞아서 그 부분들을 고치니 데이터는 잘 들어왔다. 그런데 이번엔 무한 스크롤이 문제였다. 코드를 봤을 때 딱히 문제는 없는 것 같아서 의심이 가는 부분을  이것 저것 만져봤보다가 페이지를 앞으로 갔다가 뒤로 가면 문제 없이 작동되는 것을 발견했다. 그래서 페이지가 안넘어가나 봤는데 그건 또 아니여서 이번엔 가공한 데이터를 화면에 꽉차게 띄우니까 그 때부터는 또 문제 없이 작동했다. 도대체 뭐가 문젠지는 모르겠는데 이것도 리팩터링 할 때 고쳐야 할 부분인 것 같다. 여튼 덕지덕지 붙여서 어떻게든 해결했고 그 이후에는 간단하게 삭제까지 만들어서 잘 동작하는 것을 확인했다.\n\n&nbsp 이번에 도전하는 것들 중에서 조금 걱정 됬던 부분 중에 하나가 리액트 쿼리 였는데 그나마 쿼리는 양반이고 타입 스크립트 때문에 받는 고통에 비하면 나머지는 다 별거 아닌 것 같아서 왠지 모를 자신감이 넘친다.(???) 졸려서 그런가 말이 자꾸 샛길로 새는데 얼른 자고 내일은 수정페이지나 만들어야겠다. ",
    "created_at": "2022-08-17T15:44:53.508Z",
    "updated_at": "2025-11-25T17:05:39.913Z",
    "url_slug": "항해-X-동북-ICT-59일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "3c997605-ba00-4f5f-ace8-ca34cc3643ab",
    "title": "\b항해 X 동북 ICT 58일차",
    "short_description": "항해 58일차 일지.",
    "body": "&nbsp 오늘은 작성 페이지에서 이미지 업로드 하는 부분에 문제가 있어 그 부분을 수정하느냐고 하루를 보냈다. 이미지가 어떻게 해도 안올라가서 이런 저런 방법으로 시도하다가 결국에는 타입 스크립트 오류를 그부분만 해제했는데 바로 올라가 버려서 허무하긴 했다. 결국에는 이것도 그럼 타입만 설정을 잘해주면 올라 갈 것 같은데 왜 안올라가는지...아마 예외처리를 안해줘서 그런 것 같긴한데 다음 단계로 넘어가기 위해서 일단 임시방편으로 때워두고 나중에 리팩터링을 할 때 고쳐보기로 했다.\n\n&nbsp 그 이후로는 상세 페이지를 만들었는데 생각보다 빨리 끝나서 내일은 목록이랑 상세 페이지를 서버랑 붙여보면 될 것 같다.",
    "created_at": "2022-08-16T16:01:35.062Z",
    "updated_at": "2026-01-09T21:52:40.057Z",
    "url_slug": "항해-X-동북-ICT-58일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "690afd36-7ed7-44c8-a4d7-650f88cdf9a2",
    "title": "항해 X 동북 ICT 57일차",
    "short_description": "\b항해 57일차 일지",
    "body": "&nbsp 오늘은 오전 중에는 머리도 식힐 겸 프로그래머스의 남은 1단계 문제들을 몇개 풀고 오후 부터는 카카오 맵 api를 이용한 지도 기능을 구현했다. 생각보다 타입스크립트로 작성하느냐고 애를 먹었는데 다행이도 저녁 즈음엔 완성이 되서 이제 기능 몇개만 더 붙이면 될 것 같다. 조금 걱정되는 부분이 몇개 있긴 한데 레퍼런스들을 찾아보면서 하면 될 것 같긴하다. 프로그래머스 1단게 문제도 이제 2문제 남았고 아마 내일 모레부터는 2단계를 들어 갈 수 있을 것 같다. 그냥 개발만 주구장창 하는 것보다 중간중간에 알고리즘을 푸는게 조금 더 개발이 잘되는 것 같아 앞으로 종종 이렇게 할 것 같다. 내일은 목록을 백분들과 붙여보고 지도에 관련해서 조금 팀원들의 의견을 들어본 후에 게시글 작성페이지랑 합쳐봐야겠다.",
    "created_at": "2022-08-15T15:30:20.431Z",
    "updated_at": "2026-01-09T05:32:33.184Z",
    "url_slug": "항해-X-동북-ICT-57일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "eb87047f-5d28-4491-865e-b8c1aee7437f",
    "title": "항해 X 동북 ICT 56일차",
    "short_description": "항해 56일차 일지.",
    "body": "&nbsp 오늘은 느즈막히 여자친구와 시간을 보내면서 짬짬이 프로그래머스의 알고리즘 문제를 풀었다. 1단계 문제를 거의 다 푼줄 알았는데 생각보다 많이 남아있어서 일단 남은 1단계부터 다 풀고 넘어가기로 했다. 아직까지는 1단계 중에서도 쉬운 문제부터 쳐내는 중이라 어렵지 않긴 한데 조금 난이도가 있는 문제를 풀면 어려울라나 모르겠다. 일단은 항해가 끝나기 전까지 2단계 문제까지 다 풀어보는게 목표긴한데 다 풀 수 있으려나 모르겠다. 하루에 한두문제 푸는데 뭐 한 두시간씩 걸릴 것도 아니고 조금씩 풀어봐야겠다. 그리고 다시 대구로 가는 기차에 몸을 싣고 집으로 돌아왔다. 여자친구에게 금방 다시 올라가겠다고 약속한 만큼 이번주 내로 남은 기능들을 다 끝낼 예정이다. 물론 리팩터링을 별개다.ㅋㅋㅋㅋㅋ",
    "created_at": "2022-08-14T16:19:13.357Z",
    "updated_at": "2026-01-02T14:13:45.784Z",
    "url_slug": "항해-X-동북-ICT-56일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "ad13898d-cb64-496d-8121-ebdd33c02215",
    "title": "항해 X 동북 ICT 55일차",
    "short_description": "항해 55일차 일지.",
    "body": "&nbsp 오늘은 오전 중에는 멘토분께 멘토링을 받고 오후에는 게시글 작성하기 기능을 api와 붙이는 작업을 했다. 작은 트러블들이 있긴 했었지만 금방 해결했는데 조금 걱정되는 점은 이미지 파일을 blob형태로 보냈는데 s3에서 이미지를 미리 볼 수가 없다는 점이였다. 찾아보니까 blob 형태를 보려면 파일을 디코딩을 해줘야 하는데 Filereader를 통해 해결 할 수 있다고 하긴 하는데 이미지 파일을 불러 왔을 때 디코딩을 해야되는 부분이라 당장 확인해 볼 방법은 딱히 없는 것 같긴하고 실제로 그 blob파일을 받아서 미리 볼 수 있나 filereader를 제외한 방법 중에서 찾아봤는데 아직까지 해결하지는 못했다. 나중에 게시글 상세 페이지를 만들 때 확인을 해보고 안되면 다른 방식으로 보내야 될 것 같다. 타입 스크립트에서 formdata에 파일을 보낼때 blob형태로 보내라고 해서 그런거긴 한데 음... 아니면 바꾸면 되지 뭐 ",
    "created_at": "2022-08-14T16:12:29.576Z",
    "updated_at": "2026-01-11T18:21:59.371Z",
    "url_slug": "항해-X-동북-ICT-55일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "f08cfdf3-dcd1-447d-8928-3b35e35f547c",
    "title": "항해 X 동북 ICT 54일차",
    "short_description": "항해 54일차 일지.",
    "body": "&nbsp 오전, 오후중으로는 계속해서 인강만 들었다. 일단은 mock api를 만들어서 테스트를 해볼까 하다가도 백엔드분들의 api 개발 속도가 빠르셔서 mock을 만들기 보다는 붙여보고 확인하는 편이 더 좋을 것 같았다. 실제로 오후에는 게시글 작성하기 파트를 붙여봤는데 로그인을 한 사람만 작성하게 로직이 짜여져 있어 프론트에서도 로그인 부분을 합쳐야 될 것 같아 테스트는 내일로 미루기로 했다. 뭐 아직 시간도 많이 남은 편이기도 하고 굳이 급하게 할필요성은 못느끼긴 한다. 그래서 루즈해지는 감이 있긴 하지만 그래도 요즘은 일찍 잠자리에 들 수 있어서 좋다. 9시 쯤에 일찍 공부를 마치고 여자친구를 보기위해 서울로 가는 기차에 몸을 실었다. 원래는 미니 프로젝트가 시작한 주차에 갔어야 했지만 그 때 바빠서 가지 못했는데 다행이도 이번에는 갈 수 있었다. 늘 기다려주는 여자친구에게 미안하고 고맙다. ",
    "created_at": "2022-08-14T03:56:59.542Z",
    "updated_at": "2026-01-11T06:34:14.283Z",
    "url_slug": "항해-X-동북-ICT-54일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "2b4dba34-cfc7-4a1b-a13f-faa38a0d73cb",
    "title": "항해 X 동북 ICT 53일차",
    "short_description": "\b항해 53일차 일지.",
    "body": "&nbsp 오전 중에는 수리 맡겼던 에어팟을 찾아오고 어제 만들었던 목록 페이지를 수정하는 작업을 했다. 리액트 쿼리도 처음 쓰다보니 독스나 레퍼런스를 찾아보면서 했는데도 헤메는 건 어쩔 수 없을 것 같다. 일단은 오류도 없고 최대한 독스대로 만들어 봤는데 일단은 api가 완성되면 붙여보고 확인해봐야겠다.\n\n&nbsp 그 이후에는 타입스크립트 관련 인강을 들으면서 부족한 부분을 채워보려고 해봤다. 근데 타입스크립트는 대충 알겠는데 리액트랑 접목시키는게 아직까지는 어려운 듯 싶다. 계속해서 하다보면 되겠지 뭐.",
    "created_at": "2022-08-14T03:56:28.503Z",
    "updated_at": "2026-01-04T21:14:08.816Z",
    "url_slug": "항해-X-동북-ICT-53일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "7c473c1f-233e-493a-ba38-6f1b03f30158",
    "title": "항해 X 동북 ICT 52일차",
    "short_description": "항해 52일차 일지.",
    "body": "&nbsp 역시 하면 안되는 것 없는 것 같다. 어제 말썽이였던 배열함수는 콘솔도 찍어보고 조금씩 변수를 바꿔보니 돌아갔다. 알고보니 내가 변수를 잘못해서 넣은 것 같던데 이유는 조금 더 생각해봐야 할 듯 싶다.\n\n&nbsp 그렇게 작성 페이지를 얼추 마무리하고 목록 페이지 기능 구현에 들어갔다. 기존에 목록을 불러는 것이나 무한 스크롤은 한번 구현해 본 적이 있어서 쉬울 줄 알았는데 이번에는 리액트 쿼리의 인피니트 쿼리와 intersectionObserver을 사용해서 구현해보기로해서 한번에 잘되지는 않았지만 docs도 찾아보고 다른 분들께 여쭤도 보며 무한스크롤을 완성했다.",
    "created_at": "2022-08-11T11:32:26.900Z",
    "updated_at": "2026-01-11T08:15:53.776Z",
    "url_slug": "항해-X-동북-ICT-52일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "0167172f-7afa-44e5-b344-04ce6f6c1b01",
    "title": "항해 X 동북 ICT 51일차",
    "short_description": "항해 51일차 일지.",
    "body": "&nbsp 오전 중에 에어팟을 수리를 맡기고 돌아와 프로젝트 개발을 시작했다. 걱정했던 대로 처음부터 난관이였다. 일단 코드를 작성하면 타입 스크립트에서 내는 에러 때문에 막혀서 해결을 위해 시간을 많이 쏟았다. 그래도 조금씩 방법을 찾아나가 이미지 업로드 및 미리보기 까지는 했는데 이미지를 배열 함수를 통해 돌려보려고 해도 잘 안되고 참 난감한 상황이였다. 원래 계획상으로는 하루에 한페이지 정도를 만들어서 그 후엔 리팩토링을 하고 다음 기능으로 넘어가고 싶었는데 이틀에 한페이지로 변경해야 될 것 같다.\n\n&nbsp 쉬는 시간에 잠깐 본 영상에서 말하길 코딩을 공부할 때 편안한 지점, 컴포트 존을 계속해서 벗어나야 좋은 개발자로 성장할 수 있다고 한다. 그 영상을 보고 많이 반성했다. 저번에도 말했 듯이 지금하는 프로젝트에 사용하는 라이브러리나 언어들은 예전에 리덕스처럼 처음 사용해보고 낯선 것들이다. 그래서 은연 중에 '그냥 리액트만 썼으면 하루에 한 두페이지 정도는 만들었을텐데', '굳이 타입 스크립트를 써야하나?' 같은 생각들이 머리속에서 떠나지 않았다. 결국에 이런 생각들은 단지 지금 편하고 싶어서 하는 변명이였다. 어처피 현업에 가면 무조건 써야 될 것들이 더 많은 것 더 새로운 것 더 어려운 것들이 배워야 되는데도 말이다. 생각이 짧았다.",
    "created_at": "2022-08-10T00:49:10.934Z",
    "updated_at": "2026-01-13T10:30:57.653Z",
    "url_slug": "항해-X-동북-ICT-51일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "19bb5813-5e21-4449-94b2-b909cf0abf3c",
    "title": "항해 X 동북 ICT 50일차",
    "short_description": "항해 50일차 일지.",
    "body": "&nbsp 오늘은 api를 설계하고 프로젝트 세팅을 하는데 하루를 다 썼다. 프로젝트 규모가 큰 만큼 요구되는 api의 개수도 많았다. 중간중간에 틈날때마다 타입 스크립트 강의를 들었지만 아직까지는 편하게 쓰기는 어려운 것 같다. 리액트 쿼리도 공부 중인데 왜 쓰는지는 알겠는데 어떻게 사용해야할지 막막한 하다. 아직까지 레퍼런스 습득이 너무 느려서 답답하다.\n\n&nbsp 내일부턴 당장 프로젝트를 시작해야 되는데 일단 지도를 제외하곤 기능 자체야 뭐 크게 걱정이 없지만 서버로 받아오는 데이터를 쿼리로 처리를 해줘야하는데 이게 아직까진 감이 안잡힌다. 지금 쿼리를 보는 느낌이 딱 처음 리덕스 볼 때 느낌인데 음 그러면 나중에는 적응이 되려나.\n\n&nbsp 오늘을 기점으로 항해가 절반이 지나갔다. 남은 기간동안에야 실전프로젝트 밖에 안남았지만 끝까지 최선을 다해서 좋은 결과를 가져가도록 노력해야겠다.",
    "created_at": "2022-08-08T15:55:43.848Z",
    "updated_at": "2025-11-30T13:20:05.361Z",
    "url_slug": "항해-X-동북-ICT-50일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "60fc2a9c-cd0b-49e3-a4cc-043547230799",
    "title": "\b항해 X 동북 ICT 49일차",
    "short_description": "항해 49일차 일지.",
    "body": "&nbsp 클론 코딩주차를 무사히 종료하고 실전 프로젝트에 들어온 이번 주는 그 어떤 주보다 바쁘고 진지했다. 포트폴리오에 들어가는 프로젝트이기 때문에 조금 더 고도화된 기술이 요구 됬고 그로 인해 새로 배워야 할 것들이 산처럼 쌓여있다.\n\n1. React-Query\n2. TypeScript\n3. Tailwind CSS\n4. CI/CD\n\n라이브러리야 독스를 보거나 예시를 보면서 사용하면 될 것 같은데 문제는 타입 스크립트 일 것 같다. 몇일 전부터 공부를 시작 했긴 했는데 늘 그렇듯이 쉽지는 않다. 뭐 하다보면 되겠지 뭐.\n\n&nbsp 이제 항해도 끝이 보이기 시작하는데 그 끝에 뭐가 있을지 슬슬 궁금해지기 시작했다. 원래는 최소 1년은 잡고 공부를 시작했는데 조금은 천천히 가도 될 것 같기도 하면서도 빨리 취직하고도 싶은 마음도 있어서 나도 내 자신을 모르겠다. 항해에 처음 들어 왔을때만해도 당장에 취직은 크게 욕심이 없었는데 시간이 지나면 지날수록 욕심이 생기는거 보면 신기한 일이다.",
    "created_at": "2022-08-07T12:44:35.590Z",
    "updated_at": "2026-01-09T13:08:55.125Z",
    "url_slug": "항해-X-동북-ICT-49일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "1806af23-6471-465b-a2be-f7a69bddbaa3",
    "title": "항해 X 동북 ICT 48일차",
    "short_description": "항해 48일차 일지.",
    "body": "&nbsp 오늘은 원래 같았으면 어제 작성했던 S.A에 대한 피드백을 받고 스코프를 조절한 뒤 api를 작성기로 했는데 예정됐던 S.A에 대한 피드백이 오지 않아 시간이 붕 떴다. 피드백에 대한 공지도 따로 없고 살짝은 아쉬운 부분 같다. 결국에 피드백이 없으니까 api 설계라던가 와이어 프레임 수정도 못하게 됬고 그냥 강의나 듣기로 했다.\n\n&nbsp 처음에는 타입스크립트 강의만 구매하려다가 타입스크립트와 리액트를 접목시키는게 어렵다는 얘기를 들어서 타입스크립트 + 리액트가 포함되어있는 니콜라스님의 리액트 마스터 클래스를 결제했다. 내일까지 다들으려고 하는데 아마 안되지 않나 싶다. 일단 리덕스 대신에 상태관리 라이브러리를 리코일을 사용하기도하고 타입 스크립트도 처음이다 보니 아마 어렵지 않을까? 뭐 일단 해봐야지. ",
    "created_at": "2022-08-06T15:19:00.456Z",
    "updated_at": "2025-12-31T04:53:12.055Z",
    "url_slug": "항해-X-동북-ICT-48일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "62d7a865-cb94-4b73-8177-3ea08d374bd1",
    "title": "항해 X 동북 ICT 47일차",
    "short_description": "항해 47일차 일지.",
    "body": "&nbsp 실전 프로젝트 주차가 밝았다. 우리 조는 총 다섯명으로 프론트엔드 2명에 백엔드 3명으로 구성되어 있었다. 팀 리더를 지원하셨던 분들이 우리팀에는 없어서 먼저 각 파트에 팀 리더를 정하고 본격적으로 실전 프로젝트의 주제에 관해 논의하기 시작했다.\n\n&nbsp 생각보다 주제 정하는 건 쉽지 않았다. 괜찮다 싶은 아이디어는 이미 대중적으로 성공해 기술적으로 완성이 되어 있었고 반대로 기술적으로 문제가 있어 구현이 힘든 아이디어도 있었다. 여러가지 의견이 오가고 몇몇 괜찮은 아이디어도 나왔지만 확실하게 이거다 할만한 것은 나오지 않아서 회의는 계속해서 이어졌다.\n\n&nbsp 저녁에 디자이너분이 합류하시고 팀원들의 의견을 취합한 결과 우리 조는 스포츠 매칭을 주제로한 서비스를 구현하기로 했다. 와이어 프레임까지 다 짜니 이시간이 였는데 평소에 다른 프로젝트 였다면 이미 구현에 들어갔을텐데 역시 실전은 실전이구나 싶었다.\n\n&nbsp 이번 프로젝트는 새로운 기술도 많이 사용하면서 타입스크립트를 기반으로 구현하기로 해서 살짝 난항이 예상된다. 예전부터 실전에 타입스크립트를 사용하고 싶긴 했지만 코딩을 배운지도 얼마 안됬는데 새로운 언어를 배우는 것 보다는 기본이 되는 자바스크립트에 집중하는 것이 좋을 것 같아 반쯤 포기하고 있었지만 언젠가는 배울 거 지금 배운다는 생각으로 일단은 해보려고 한다.",
    "created_at": "2022-08-05T15:35:41.879Z",
    "updated_at": "2026-01-04T22:36:00.511Z",
    "url_slug": "항해-X-동북-ICT-47일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "f9657649-771f-48af-835b-327d27be078f",
    "title": "TIL - 캐노니컬 태그",
    "short_description": "캐노니컬 태그",
    "body": "### 1. 캐노니컬 태그란?\n<hr/>\n&nbsp 캐노니컬 태그(Canonical tag)란 한 페이지를 가리키는 여러 개의 주소가 존재할 때, 검색 엔진이 어떤 주소가 원본인지 알 수 있도록 하기 위해 사용하는 태그이다. 캐노니컬 태그는 SEO 개선을 위한 중요한 기능 중 하나로 꼽힌다.\n\n### 2. 캐노니컬 태그 구현\n<hr/>\n&nbsp 캐노니컬 태그 구현 방식은 html에 명시하는 방법과 http 응답 헤더에 명시하는 두 가지 방법으로 구현할 수 있다. 이때 주의해야 될 점이 있다면 캐노니컬 태그는 절대경로로 올바른 URL을 지정하는 것이 중요하다.\n\n#### 2.1 html 명시\n```js\n<link rel=\"canonical\" href=\"http://www.test.com/index.html\">\n```\n\n#### 2.2 html 응답 헤더 명시\n```js\n// html이 아닌 다른 파일 형식일 때 사용한다.\nHTTP/1.1 200 OK\nContent-Type: applicaiton/pdf\nLink: ; rel=\"canonical\"\n// 위와 같이 Link 필드에 브라켓 스타일의 표현식을 사용하여 표준 URL을 명시하고 세미콜론으로 구분한뒤 rel 프로퍼티의 값을 canonical로 설정한다.\nContent-Length: 4223\n```\n\n### 3. 캐노니컬 태그를 적용하지 않는다면?\n<hr/>\n\n&nbsp 캐노니컬 태그를 적용하지 않으면 다음과 같은 문제가 발생할 수 있다.\n\n1. 나의 의도와는 다른 크롤링\n\t내가 생각하는 원본 페이지와 검색엔진이 인식하는 원본 페이지가 달라 원본이 아닌 페이지가 더 크롤링이 될 수 있다.\n2. 검색엔진 페널티\n\t동일한 페이지가 각각 다른 주소로 등록되어있다면 분산된 URL주소로 인해 SEO 점수를 낮출 수 있으며 의도의 고의성을 떠나 패널티를 받을 수 있다.\n### 5. 참조\n<hr/>\n\n[참조1](https://yozm.wishket.com/magazine/detail/1420)\n[참조2](https://growthacking.kr/%EC%BA%90%EB%85%B8%EB%8B%88%EC%BB%AC-%ED%83%9C%EA%B7%B8-canonical-tag%EB%A1%9C-%EA%B2%80%EC%83%89%EC%97%94%EC%A7%84-%EC%B5%9C%EC%A0%81%ED%99%94%ED%95%98%EA%B8%B0/)\n\n\n",
    "created_at": "2022-08-04T15:29:38.465Z",
    "updated_at": "2026-01-09T07:15:34.317Z",
    "url_slug": "TIL-88zrugzr",
    "tags": [
      "TIL",
      "html"
    ]
  },
  {
    "id": "14c9f878-41af-4b42-ab9b-0ecdd7221d38",
    "title": "항해 X 동북 ICT 46일차",
    "short_description": "항해 46일차 일지.",
    "body": "&nbsp 클론코딩 주차가 종료됐다. 오늘은 간단한 이슈를을 수정하고 코드를 점검 했다. 아직까지 고치면 좋을 부분이 안보이는 것을 보면 미숙하다는 생각이 든다. 첫 주차에 미니 프로젝트를 시작한게 엊그제 같은데 벌써 실전 프로젝트라니 시간이 참 빠른 것 같다.\n\n&nbsp 남은기간 잘 헤쳐나갈 수 있을까 걱정이 많이 되지만 이제 겨우 7주 리액트를 시작한지는 5주 밖에 되지 않았기 때문에 당연한 걱정이라고 생각은 하고 남은 6주 동안에 얼마나 성장하냐가 내 개발자 인생을 좌지우지하지 않을까라는 생각도 든다. 말이 앞뒤가 잘 안맞는 것 같은데 여튼 이제 절반을 왔고 남은 절반만 가면 된다. 다시 또 힘내보자.",
    "created_at": "2022-08-04T15:13:09.605Z",
    "updated_at": "2026-01-09T23:24:54.022Z",
    "url_slug": "항해-X-동북-ICT-46일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "e258a4c3-b158-4a34-a64e-b6c12598929d",
    "title": "항해 X 동북 ICT 45일차",
    "short_description": "항해 45일차 일지.",
    "body": "&nbsp 늦잠을 잤다. 알람도 못듣고 잔건 오랜만인 것 같은데 상당히 피곤했나보다. 오늘은 스크롤 이벤트로 구현했던 무한 스크롤은 intersectionObserver로 변경했다. docs도 읽어보고 여러가지 레퍼런스를 참고 하면서 만들어봤는데 다행히 잘 동작했다. 스크롤 이벤트의 경우 쓰로틀링 처리를 안해준다면 페이지가 넘어갈 때마다 모든 페이지를 다시 불러와서 로딩 속도가 오래 걸렸던 반면 intersectionObserver로 구현 방식을 바꾸니 로딩속도가 현저하게 감소했다. intersectionObserver로 다른 것도 할 수 있다 하니 조금 더 공부가 필요해 보인다. \n\n### 로그인\n![](https://velog.velcdn.com/images/blaze096/post/fe1c12c5-7cda-4b6d-9ad1-17bf900b3f6c/image.png)\n### 회원가입\n![](https://velog.velcdn.com/images/blaze096/post/b2d6036b-333e-4fb2-b8bd-34543c3ae06c/image.png)\n### 메인 페이지\n![](https://velog.velcdn.com/images/blaze096/post/16e7e5dc-735b-4bc3-a00d-b7730d77f8a9/image.png)\n### 상품 페이지\n![](https://velog.velcdn.com/images/blaze096/post/515dd580-24dd-4bba-b0c9-843458581762/image.png)",
    "created_at": "2022-08-03T14:12:11.129Z",
    "updated_at": "2026-01-09T22:06:45.872Z",
    "url_slug": "항해-X-동북-ICT-45일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "1c6f027f-b706-4930-8943-ca7cd814ac32",
    "title": "항해 X 동북 ICT 44일차",
    "short_description": "항해 44일차 일지.",
    "body": "&nbsp 오늘은 무한 스크롤을 intersectionObserver로 바꾸기에 앞서 스크롤 이벤트를 쓰로틀링 처리를 해보려고 했으나 오늘도 실패했다. 무한 스크롤이나 쓰로틀링이나 원리는 알겠는데 막상 적용을 해보려니 쉽지 않은 부분이다. 쓰로틀링은 일단 intersectionObserver을 사용하면 구현하지 않아도 돼서 일단은 다른 방식으로 구현하는 것을 우선적으로 고려해 봐야겠다. 그리고 헤더의 UI를 조건문을 돌려 분기 처리를 통해 특정 URL에 접근 했을 때 헤더를 다르게 바꿔주고 간단한 CSS 수정 작업을 했다.\n\n&nbsp 로그인, 회원가입 등도 정상적으로 작동을 하고 서버에서 데이터도 잘 받아와서 렌더링도 잘되는 것을 확인해서 내가 맡은 부분은 끝났지만 뭔가 덜 한 느낌이리 일단은 무한 스크롤을 intersectionObserver를 이용해 구현하고 반응형으로 바꿔보기로 했다.",
    "created_at": "2022-08-02T15:50:58.912Z",
    "updated_at": "2026-01-09T16:26:27.832Z",
    "url_slug": "항해-X-동북-ICT-44일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "13322bc1-374c-49e1-ae9f-66c53c0baf59",
    "title": "항해 X 동북 ICT 43일차",
    "short_description": "항해 43일차 일지.",
    "body": "&nbsp 오늘은 무한스크롤을 구현했다. 찾아 본 바로는 무한 스크롤 구현할 때 크게 스크롤 이벤트로 하는 방법과 intersetionObserver을 사용하는 방법이 있었는데 나는 일단 스크롤 이벤트로 구현했다. 이유는 intersectionObserver을 사용하다가 오류가 계속났는데 상세 페이지와 연결을 해야지 서버와 테스트를 할 수 있어 빠른 구현이 필요했기 때문이다.\n\n&nbsp 두 구현 방식의 차이는 화면의 크기로 페이지를 로딩하냐 옵저버의 위치를 심어놓고 로딩하냐 그 차이 밖에 없는 것 같은데 신기하게 intersectionObserver을 사용하면 코드가 잘 안돌아가니 이 부분은 공부가 더 필요할 것 같다.",
    "created_at": "2022-08-01T17:07:21.496Z",
    "updated_at": "2026-01-03T00:22:46.406Z",
    "url_slug": "항해-X-동북-ICT-43일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "a26ffe1a-8a25-4eec-89ac-5350532c1bfc",
    "title": "TIL - 첫 협업을 하고 나서",
    "short_description": "첫 협업을 하고 나서",
    "body": "### 0. 들어가면서\n<hr/>\n\n&nbsp 항해를 시작하고나서 처음으로 진행된 프론트엔드와 백엔드의 협업이였다. 우리 팀은 프론트와 백 각각 3명씩 구성되어 있어서 다른 팀보다 인원도 많았고 팀 내 분위기도 아주 좋은 편이였다. 모든 분들이 다 재미있으시고 좋은 분들이셔서 같이 협업을 했다는 사실은 잊지 못할 추억이 될 것 같다. **(shout-out to Team F.B.I)**\n\n### 1. 협업을 하면서 어려웠던 점\n<hr/>\n&nbsp 협업을 할 때 어려웠던 점은 두가지 정도를 들 수 있을 것 같은데 첫 번째는 의사소통에 관련된 부분이다. 이 말은 보편적으로 생각하는 사람 대 사람의 의사소통을 말하는 것이 아닌 각자가 맡은 일이 다르다 보니 프론트엔드와 백엔드의 용어도 다르고 프로젝트를 생각하는 관점도 달라 대화를 할 때 서로의 말의 뜻이 통하지 않거나 이해를 잘 못하는 경우가 생겼다. 물론 지속적으로 소통을 하며 해결하긴 했지만 이번 경험을 통해 기본적인 백엔드 용어라던가 로직정도는 알고 있어야 다음에 협업할 때 더 좋을 것 같다.\n\n&nbsp 두 번째는 정말 중요한 내용인데 프론트와 백엔드를 합치는 작업이 너무 어려웠다. 실제로 우리조는 에러를 해결하지 못해 서로가 모두 작업을 마쳤음에도 불구하고 과제를 제출하지 못했다. 에러를 어떻게든 해결하려고 노력했지만 결국에는 그러지 못했다. 모두가 밤을 새가며 고생했는데 정말 아쉬운 부분이다. 서로의 프로그램이 다르다 보니 어쩔 수 없는 부분이라 생각되고 은탄환은 존재하지 않기 때문에 최대한 빨리 개발을 마치고 붙여보면서 오류를 해결하는 방법이 지금의 내가 생각하는 최선인 것 같다. 다음에 더 좋은 방법을 찾는다면 따로 블로그에 포스팅 해봐야 겠다.\n\n\n### 2. 마치면서\n<hr/>\n\n&nbsp 저번 미니 프로젝트가 종료 된 후 같이 고생하셨던 팀원 분들도 그렇고 나도 그렇고 저번과 같은 상황이 발생하지 않도록 각자의 위치에 서로열심히 노력하고 있는 모습이 보이는 것 같다. 이번 주에는 다들 노력한 만틈 좋은 결과가 생길거라 굳게 믿으며 다시 한번 지난 주에 같이 고생했던 팀원들 모두께 감사의 인사를 전하고 싶다. **감사합니다. **\n\n\n",
    "created_at": "2022-07-31T04:47:24.361Z",
    "updated_at": "2025-11-30T15:10:40.248Z",
    "url_slug": "TIL-첫-협업을-하고-나서",
    "tags": [
      "TIL"
    ]
  },
  {
    "id": "8fba56df-a7be-407f-abb4-02ea42843b6d",
    "title": "항해 X 동북 ICT 42일차",
    "short_description": "항해 42일차 일지.",
    "body": "&nbsp 오늘은 느즈막히 기상해서 오전 중으로 회원가입까지 구현을 완료했다. 다행히 로직이 금방 이해가 되서 코드를 짤 수 있었던 것 같다. WIL도 비교적 가벼운 내용이라 빠르게 작성한뒤 기분전환도 할겸 머리를 볶고 왔다. 생각보다 잘나와서 기분도 좋아지고 돌아와서는 같은 팀인 프론트 분과 길게 얘기를 나눴다. 무거운 주제는 아니였고 가벼운 스몰 토크였다. 크게 한건 없지만 나름 괜찮게 주말을 보낸 것 같다. 내일은 나머지 기능을 구현 완료하고 서버와 붙여 본 뒤에 추가기능에 대해 생각해 봐야겠다.",
    "created_at": "2022-07-30T17:44:31.778Z",
    "updated_at": "2026-01-13T04:31:15.299Z",
    "url_slug": "항해-X-동북-ICT-42일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "0e16542e-c165-4da8-bab2-4ffad154ebb0",
    "title": "항해 X 동북 ICT 41일차",
    "short_description": "항해 41일차 일지.",
    "body": "&nbsp 오늘은 어제 캐러셀에서 보이지 않았던 도트와 에로우의 위치를 잡는 작업부터 시작했다. 분명히 개발자 도구에서 바꿨을 때는 위치 값을 바꾼 것이 적용이 되는데 희한하게 css를 만지면 페이지에 값이 적용이 안됬는데 다른 분의 도움 덕분에 해결했다.**(감사합니다)** 해결법은 생각보다 간단했는데 css파일에서 바꾸지 않고 해당 캐러셀이 있는 컴포넌트에서 css 값을 한번 더 덧씌우니 값이 잘 적용됬다. 아마 css 우선순위 때문인 것 같다고 하셨는데 이것도 나중에 공부해야겠다. 그러고 나서 에로우 위치도 z-index를 주어서 해결했다.\n\n&nbsp 그 이후로는 로그인 회원가입에 뷰와 기능들을 만들기 시작했다. 회원가입 기능을 구현하다가 버튼 때문에 애를 먹었는데 styled-component로 import 해온 다음에 인라인으로 disabled를 주니 적용이 안되었다. 여러가지 방법으로 다시 적용을 해봤는데도 안되서 이리저리 헤매다가 결국에는 이가 없으면 잇몸이라는 생각으로 버튼을 그냥 하나 더 만들어서 삼항 연산자를 돌려 버렸다. 이렇게 하면 안될 거 같은데 다음에 매니저님꼐 여쭤봐야 겠다. 그렇게 뷰를 작성한 다음에 로그인 기능을 완성하니 벌써 시간이 많이 지났다. 내일은 회원가입 기능을 완성할 생각이다.",
    "created_at": "2022-07-30T06:04:57.561Z",
    "updated_at": "2025-12-31T06:29:53.734Z",
    "url_slug": "항해-X-동북-ICT-41일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "b605f4a4-c0f7-46cf-9292-1ad01b7a7175",
    "title": "항해 X 동북 ICT 40일차",
    "short_description": "항해 40일차 일지.",
    "body": "&nbsp 클론코딩 주차가 밝았다. 어제의 피로가 완전히 가시지 않아 피곤했지만 바쁘게 달리기 위해 커피를 수혈했다.\n\n&nbsp 이번 주에 우리 팀은 KREAM을 클론코딩하기로 했다. KREAM은 간단하게 말하자면 한정판 신발이나 의류 등을 리셀하는 서비스이며 나도 종종 이용하던 서비스였다. 처음엔 다들 잘 모르실 것 같아서 딱히 말은 안하고 있었는데 다른 분이 먼저 제안을 해주셔서 바로 찬성쪽에 한표를 던졌다.\n\n&nbsp 내가 맡게 된 기능은 크림에 보이는 메인 페이지, 상품 페이지, 헤더와 푸터 등의 레이아웃, 그리고 로그인과 회원가입이다. 지난 주는 프론트를 담당하는 사람이 나를 포함에 2분 더 계셨지만 이번 주부터 각 팀마다 2명씩이기 때문에 지난 주와 스코프가 비슷해도 할 일이 늘어 날 수 밖에 없었다. 뭐 많으면 많은데로 작업량을 늘리면 되지 않을까 싶다.\n\n&nbsp 프론트를 맡으신 다른 분과 얘기를 나눠보고 먼저 뷰를 만들기로 했다. 처음 시작한 건 헤더와 푸터였다. 생각보다 쉬워 보였는데 각 요소에 있는 값들을 실제 서비스 되는 페이지와 비슷하게 만들려다 보니 어려움이 있었고 결국엔 사이트를 직접 뜯어보면서 맞췄다\n\n&nbsp 헤더와 푸터를 구현 한 후에 무한 캐러셀 구현을 위해 여러가지 레퍼런스들을 보다가 크게 3가지 방법 정도가 있다는 것을 알게 됬다. 첫 번째는 바닐라 자바스크립트로 구현하는 방법이였고 두번째는 리액트 훅을 이용한 방법 마지막은 라이브러리를 이용하여 구현하는 방법이였다. 일단 리액트 프로젝트를 하는데 바닐라 자바스크립트로 코드를 구현할 필요가 있을까라는 생각이 들어 패스했고 라이브러리와 리액트 훅을 이용하여 구현하는 방법 중에 고민하다가 라이브러리는 나중에 써보기로 하고 리액트 훅을 이용하여 먼저 구현해 보기로 했다.\n\n&nbsp 리액트 훅을 이용하여 구현은 성공했는데 캐러셀 하단에 나오는 dot라던가 화살표 버튼 등의 사소한 부분들도 일일히 구현이 필요해서 이젠 원리를 이해했기 때문에 라이브러리를 이용하기로 했다. \n\n&nbsp 리액트에서 가장 많이 쓰이는 캐러셀 라이브러리가 리액트 슬릭이라고 해서 슬릭을 이용해 구현을 시작했다. 슬릭에서 주는 예제 코드가 함수형이 아닌 컨포넌트형으로 주어서 이걸 함수형으로 바꾸는 작업부터 시작했는데 이것 저것 뜯어고치다 보니 슬릭이 제대로 동작하지 않기 시작했다. 그래서 결국은클래스형으로 다시 바꾸게 되었다.\n\n&nbsp 두번째 문제는 캐러셀은 만들어 졌는데 dot나 버튼들이 보이지 않았다. 마진을 줘서 어떻게든 보이게 하긴 했는데 화살표 버튼은 보이지 않았다. 이것도 CSS를 뜯어 보면서 고쳐봐야 겠다. 캐러셀 때문에 이것 저것 만지다보니 하루가 금방 지나가 버렸다.\n\n\n\n",
    "created_at": "2022-07-29T03:41:46.662Z",
    "updated_at": "2026-01-08T11:29:29.904Z",
    "url_slug": "항해-X-동북-ICT-40일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "297babb2-9219-4ff7-b6b5-c8f81fc33cb9",
    "title": "항해 X 동북 ICT 39일차",
    "short_description": "항해 39일차 일지.",
    "body": "&nbsp 새벽부터 이어진 에러 잡기는 하염없이 이어졌다. 처음에는 금방 해결되서 자러 갈 수 있을 줄 알았는데 해가 뜨고 오후가 되어도 서버와의 연결은 잘 되지 않았다. 프론트엔드와 백엔드 모두 열심히 노력해서 고쳐보려고 했지만 결국에는 프로젝트 발표 직전까지 해결이 되지 않아 프로젝트 발표는 Mock api로 대체하여서 시연하였는데 그나마도 Mock api와 코드를 너무 짧은 시간에 수정해 모든 기능을 보여주지도 못한채 발표는 끝나버렸다.\n\n&nbsp 진짜 이렇게 열심히 한 주가 있었나 싶을 정도로 쉬는 날 없이 열심히 달렸는데 완성을 못해서 아쉬웠지만 개인적으로는 지난 주에 구현하지 못했던 수정기능을 구현 했다는 점과 팀 전체가 이렇게 노력해서 문제를 해결하려는 팀이 없었던 만큼 좋은 분들과 함께 협업을 해봤다는 사실에도 의의를 두려고한다. **모든 팀원분들 고생하셨습니다. 감사합니다.**",
    "created_at": "2022-07-29T03:32:38.507Z",
    "updated_at": "2026-01-09T04:35:50.143Z",
    "url_slug": "항해-X-동북-ICT-39일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "bf3d0c6e-4ef9-4a78-9e9f-0b3c83818331",
    "title": "항해 X 동북 ICT 38일차",
    "short_description": "\b항해 38일차 일지.",
    "body": "\n&nbsp 해가 뜰 때쯤 잠이 들었더니 11시에 느즈막히 기상했다. 원래 오늘의 계획은 오후 2시 쯤에 서버를 붙여보고 에러를 잡는 것이였는데 작업에 차질이 생겨 예정된 시간에 붙여보진 못했고 그래서 오후에는 CSS 추가작업과 프로젝트 소개페이지를 제작했다.\n\n![](https://velog.velcdn.com/images/blaze096/post/b872804b-ec14-4ee0-a254-2b890f304fba/image.png)\n\n\n결국에 서버는 다음날 오전 4시 쯤에 붙여볼 수 있었는데 로그인 기능부터 동작을 안하기 시작해 앞으로의 난항이 예상됬다.",
    "created_at": "2022-07-29T03:14:43.499Z",
    "updated_at": "2026-01-13T07:18:16.955Z",
    "url_slug": "항해-X-동북-ICT-38일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "5398d63d-0b7c-4200-9737-c0017e3db1c1",
    "title": "항해 X 동북 ICT 37일차",
    "short_description": "항해 37일차 일지.",
    "body": "&nbsp 오늘은 본격적으로 웹페이지에 css작업을 들어갔다. 뭐 대단하게 것은 아니고 간단하게 꾸미고 버튼 모양도 좀 바꾸면서 반응형과 적응형 웹을 위해 미디어 쿼리를 연습했다. 그리고 난 후 상세 페이지와 수정 페이지를 연결 시키는 작업을 했다. 확실히 useParams나 useLoaction을 사용해서 값을 받아오는게 익숙하지 않아서 조금 해맸지만 금방 문제를 해결 할 수 있어서 수정기능이 정상적으로 작동하는 것을 확인했다. 나머지는 서버에 붙여봐야 알 것 같은데 그건 내일 작업을 한다고 하니 그때도 문제가 없었으면 좋겠다. 그래도 지난 주에 성공하지 못한 기능을 성공해서 기분 좋은 하루였다.",
    "created_at": "2022-07-26T14:41:10.249Z",
    "updated_at": "2025-11-25T17:05:37.473Z",
    "url_slug": "항해-X-동북-ICT-37일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "eb28384a-b6d8-4f5d-8b00-3a6b0bad35c7",
    "title": "항해 X 동북 ICT 36일차",
    "short_description": "항해 36일차 일지.",
    "body": "&nbsp 일요일날 안쉬어서 그런지 아침부터 피곤한 날이였다. 오늘은 어제 구현했던 작성기능을 마무리 하고 수정기능을 구현했다. 아직 잘 될지 안될지는 확인을 안해봤는데 잘 되면 좋겠다는 마음이다. 오전 중에는 잠깐 짬을 내서 프로젝트에 쓸 로고의 시안을 그린 후 동생에게 보냈는데 시안대로 예쁘게 나와서 다행이였다.\n  \n![](https://velog.velcdn.com/images/blaze096/post/078d1617-f027-4788-9f31-ce20faa0de1e/image.png)\n\n\n&nbsp 오후에는 그동안 작업한 작업물들을 머지했는데 깃허브 주소가 잘못되어있어서 하마터면 그동안 작업한 내용들을 싹다 날릴뻔 했다. 평소에 혼자 작업할때는 심심하면 커밋하는데 왜 이번에만 그랬는지... 다행히 IDE에 타임라인에 남아 있어 최악의 상태는 면할 수 있었다. 아 진짜 식은땀이 나는 순간이였다. 그러고 난 후 기술 매니저님께 간단하게 프로젝트 점검을 받고 조원들과 디자인 관련 회의를 해서 컨셉 컬러나 UI관련된 상세한 부분을 정했다.",
    "created_at": "2022-07-25T16:35:01.705Z",
    "updated_at": "2025-11-25T17:05:39.475Z",
    "url_slug": "항해-X-동북-ICT-36일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "29b083f2-c6eb-4d6e-bb7b-5d7d28dc51f0",
    "title": "TIL - Axios",
    "short_description": "Axios",
    "body": "<img src= \"https://axios-http.com/assets/logo.svg\">\n\n### 1. Axios\n<hr/>\n&nbsp Axios란? 브라우저나 Node.js를 위한 Promise 기반의 API형식을 가진 HTTP 비동기 통신 라이브러리이다. Axios는 Ajax와 같이 서버와 통신을 쉽게하기 위해 사용된다.\n\n### 2. Axios의 특징\n<hr/>\n\n&nbsp Axios의 특징은 다음과 같다.\n- 오래된 브라우저에서도 지원한다.(많은 브라우저에서 지원된다.)\n- 라이브러리이기 때문에 설치가 필요하다. (비슷한 역할을 하는 fetch는 설치가 불필요하다.)\n-  data 속성을 사용한다.\n- data는 object를 포함한다.\n-  XSRF 보호를 해준다. (사이트간 요청 위조를 방지하여 웹사이트로의 공격을 보호해준다.)\n- 자동으로 JSON 데이터 형식으로 변환된다.\n- 요청을 취소할 수 있고 타임아웃을 걸 수 있다.(fetch에서는 불가능하다.)\n- HTTP 요청을 가로챌 수 있다.(interceptors)\n\n### 3. Axios method\n<hr/>\n\n&nbsp Axios 단축 메서드 axios를 편리하게 사용하기 위해 모든 요청 메소드는 aliases가 제공된다. 위 처럼 객체 옵션을 이것저것 주면 가독성이 떨어지고 너저분하니, 함수형으로 재구성하여 나눠논 것으로 이해하면 된다. axios의 Request method에는 대표적으로 다음과 같은 것들이 있다.\n\n- GET : axios.get(url[, config])\n- POST : axios.post(url, data[, config])\n- PUT : axios.put(url, data[, config])\n- DELETE : axios.delete(url[, config])\n\n### 4. 출처\n<hr/>\n\nhttps://axios-http.com/kr/docs/\n\n\n",
    "created_at": "2022-07-24T07:51:36.542Z",
    "updated_at": "2026-01-09T18:22:31.552Z",
    "url_slug": "TIL-Axios",
    "tags": [
      "TIL",
      "axios"
    ]
  },
  {
    "id": "059d607d-ffe2-408a-9e40-0cd60d296b7f",
    "title": "TIL - AJAX",
    "short_description": "AJAX",
    "body": "### 1. AJAX란?\n<hr/>\n&nbsp Ajax(Asynchronous JavaScript and XML : 비동기식 자바스크립트와 XML)는 자바스크립트의 라이브러리 중 하나로 브라우저가 가지고 있는 XMLHttpRequest 객체를 이용해서 전체 페이지를 새로 고치지 않고도 페이지의 일부만을 위한 데이터를 로드하는 기법이며 자바스크립트를 사용한 비동기 통신, 클라이언트와 서버간에 XML 데이터를 주고 받는 기술입니다. 이러한 AJAX는 여러가지 기술이 혼합적으로 사용되어 이루어지는데 그 구성요소의 대표적인 예로는 HTML, DOM, 자바스크립트, XMLHttpRequest 등이 있습니다.\n\n#### 1.1 XML이란?\n&nbsp XML(Extensible Markup Language)이란 HTML과 비슷한 마크업 언어로 HTML이 데이터를 보여주는 목적인 것에 비해 데이터를 저장하고 전달할 목적으로 만들어졌습니다. 또한 HTML 태그처럼 미리 정의 되어 있지 않고 사용자가 직접 정의할 수 있다는 특징이 있습니다.\n\n#### 1.2 XMLHttpRequest이란?\n&nbsp XMLHttpRequest 클라이언트와 서버 간의 통신을 담당하는 객체로서 서버로부터 XML 데이터를 전송받아 처리하는데 사용됩니다. 이 객체를 사용하면 웹 페이지가 전부 로딩된 후에도 서버에 데이터를 요청하거나 서버로부터 데이터를 전송받을 수 있습니다. 즉, **페이지 전체를 다시 로딩하지 않고 일부분만을 갱신할 수 있게 됩니다.**\n\n### 2. AJAX를 사용하는 이유 ###\n<hr/>\n&nbsp AJAX를 사용하는 이유는 단순하게 WEB화면에서 무언가 부르거나 데이터를 조회하고 싶을 경우, 페이지 전체를 새로고침하지 않기 위해 사용한다고 볼 수 있습니다. 기본적으로 HTTP 프로토콜은 클라이언트쪽에서 Request를 보내고 서버쪽에서 Response를 받으면 이어졌던 연결이 끊기게 되어있습니다. 그래서 화면의 내용을 갱신하기 위해서는 다시 request를 하고 response를 하며 페이지 전체를 갱신하게 되는데 이러한 방식은 엄청난 자원낭비와 시간낭비를 불러 올 수 있습니다. 그래서 AJAX는 HTML 페이지 전체가 아닌 일부분만 갱신할 수 있도록 XMLHttpRequest객체를 통해 서버에 request하며 이 경우, JSON이나 XML형태로 필요한 데이터만 받아 갱신하기 때문에 그만큼의 자원과 시간을 아낄 수 있게 됩니다.\n\n### 3. AJAX의 장단점 ###\n#### AJAX의 장점 ####\n1. 웹 페이지의 속도향상(웹 페이지 전체를 다시 로딩하지 않고도 일부분만 갱신 가능)\n2. 웹 페이지가 로드된 후에 서버로 데이터 요청을 보내거나 데이터를 받을 수 있음\n3. 백그라운드 영역에서 서버로 데이터를 보낼 수 있음\n\n#### AJAX의 단점 ####\n1. 히스토리 관리가 되지 않는다.\n2. 페이지 이동없는 통신으로 인한 보안상의 문제가 있다.\n3. 연속으로 데이터를 요청하면 서버 부하가 증가할 수 있다.\n3. XMLHttpRequest를 통해 통신하는 경우, 사용자에게 아무런 진행 정보가 주어지지 않는다. (요청이 완료되지 않았는데 사용자가 페이지를 떠나거나 오작동할 우려가 발생하게 된다.)\n4. AJAX를 쓸 수 없는 브라우저에 대한 문제 이슈가 있다.\n5. HTTP 클라이언트의 기능이 한정되어 있다.\n6. 지원하는 Charset이 한정되어 있다.\n7. Script로 작성되므로 디버깅이 용이하지 않다.\n8. 동일-출처 정책으로 인하여 다른 도메인과는 통신이 불가능하다. (Cross-Domain문제)\n\n### 3. AJAX의 진행과정 ###\n ![](https://velog.velcdn.com/images/blaze096/post/d3e376ae-9aef-4606-9b11-7f3941236e18/image.png)\n\n1. 사용자 의한 요청 이벤트 발생\n2. 이벤트 핸들러에 의해 자바스크립트 호출\n3. 자바스크립트는 XMLHttpRequest 객체를 사용하여 서버로 요청 전달\n4. 서버는 전달 받은 XMLHttpRequest 객체를 가지고 Ajax 요청 처리\n5. 요청에 대한 응답 생성\n6. 서버는 처리한 결과를 HTML,XML,JSON 형태로 웹브라우저에 전달\n7. 서버로부터 전달 받은 데이터를 가지고 웹 페이지 일부분만 갱신하는 자바스크립트 호출\n8. 웹 페이지 일부부만 로딩되어 페인팅\n\n\n### 출처\n<hr/>\n\n[AJAX](https://99geo.tistory.com/65)\n[AJAX 동작 방식](https://velog.io/@gparkkii/whatisajax)\n[XML 관련](http://www.tcpschool.com/xml/xml_intro_basic)",
    "created_at": "2022-07-24T07:34:39.062Z",
    "updated_at": "2025-12-05T15:09:09.982Z",
    "url_slug": "AJAX",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "b9241d33-f1dd-4862-99ec-480c8360248c",
    "title": "항해 X 동북 ICT 35일차",
    "short_description": "항해 35일차 일지.",
    "body": "&nbsp 어제 늦게 자서인지 8시 반에 알람이 울렸지만 다시 끄고 11시 넘어 느즈막히 일어났다. 뭐 원래는 쉬는 날인데 이정도는 넘어가자. 원래 항해를 시작할때만해도 무슨 일이 있어도 일요일날은 쉬려고 했는데 지금 실력으로는 불안해서 그냥 책상 앞에 앉아 있기로 했다. 오늘은 어제 구현 했던 이미지 불러오는 방식을 조금 변경했는데 기존에 하던 방식으로 진행하면 이미지 값이 남아 있어서 에러를 뿜어낼 수도 있다하여 새로운 코드를 작성했다.\n\n&nbsp 지금 구현하는 게시판에는 이미지를 업로드 할 수 있도록 구현 중인데 원래는 이미지 url을 보내서 그 값을 가져오는 방식으로 게시판을 구현을 하려고 했는데 생각을 해보니 이미지 저장소에 이미지가 없다면 여기서 보내주는 이미지 url은 의미가 없다는 생각이 들어 백엔드 분들과 이 문제에 대해 얘기를 나눴다. 일단은 백엔드 분들도 이 문제를 인지를 하셔서 이미지 저장소를 만들고 백엔드분들이 이미지와 게시글 텍스트 데이터를 맵핑을 해주시는 걸로 했다.\n\n&nbsp 별로 한 것도 없는데 시간이 빨리 간 느낌이다. 오늘 한 것 보면 토요일 같은데 내일은 월요일이라니 힘내야겠다.\n",
    "created_at": "2022-07-24T07:34:02.643Z",
    "updated_at": "2025-12-01T02:43:14.647Z",
    "url_slug": "항해-X-동북-ICT-35일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "092ac70c-41f3-4808-9be7-91b85a6fadb2",
    "title": "항해 X 동북 ICT 34일차",
    "short_description": "항해 34일차 일지.",
    "body": "&nbsp 오늘은 프론트 팀원 분들과 레이아웃을 잡고 간단하게 간단하게 코드 컨벤션을 맞췄다. 폴더명이나 변수 작명 및 CSS 작성 방법 등을 정하고 오후부터 본격적으로 미니 프로젝트의 개발에 들어갔따. 크게 막히는 부분 없이 순탄하게 진행이 되서 정말 다행이였다. 기본적인 뷰를 만들고 리덕스 툴킷에 대한 공부를 한 후에 프로젝트에 툴킷을 적용하려고 하는데 생각보다 툴킷이 만만하지가 않아서 쓰다보면 툴킷이 더 편하다는데 아직까지는 모르겠다. 확실히 보일러 플레이트들이 줄어서 코드가 짧아지긴 하는 것 같다. 늦게 까지 리덕스 툴킷 공부과 엑시오스를 공부하며 이런저런 고민을 하다가 잠에 들었다.",
    "created_at": "2022-07-24T07:33:22.708Z",
    "updated_at": "2026-01-11T22:48:27.700Z",
    "url_slug": "항해-X-동북-ICT-33일차-g61oph0h",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "3d2f9ab3-70ad-4f15-935b-00642eaad7e7",
    "title": "항해 X 동북 ICT 33일차",
    "short_description": "항해 33일차 일지.",
    "body": "&nbsp 미니 프로젝트 주차가 시작했다. 첫 주차 이후에 오랜만에 하는 협업이라 떨리기도 했고 처음으로 프론트와 백으로 나뉘어서 하는 협업이라 걱정이 되기도 했다. 다행히도 좋은 조원분들을 만나서 큰 탈 없이 프로젝트의 와이어프레임과 api를 작성할 수 있었다. 와이어 프레임은 다음과 같다.\n\n<h3>Wireflame</h3>\n<hr/>\n\n** 01 < 메인 페이지 > **\n![](https://velog.velcdn.com/images/blaze096/post/dda74df1-661e-41f1-819e-29131ca7d876/image.png)\n\n**02 < 로그인 페이지 >**\n\n![](https://velog.velcdn.com/images/blaze096/post/8f2e1d6a-185f-4549-8181-b03205d80032/image.png)\n\n**03 < 회원가입 페이지 >**\n\n![](https://velog.velcdn.com/images/blaze096/post/8200d72a-0b92-4917-af3d-aa28642fdfe2/image.png)\n\n\n**04 < 메인 페이지 2 >**\n\n![](https://velog.velcdn.com/images/blaze096/post/091e4f81-3ef1-4b58-92f4-df6f2249b917/image.png)\n\n**05 < 게시글 작성 페이지 >**\n\n![](https://velog.velcdn.com/images/blaze096/post/e940ff27-e1e9-47c4-8bb9-955a2886abc5/image.png)\n\n**06 < 게시글 상세 페이지 >**\n\n![](https://velog.velcdn.com/images/blaze096/post/318fa96c-c86f-467f-aa8b-b135eb281cfd/image.png)\n\n\n**07 < 게시글 수정 페이지 >**\n\n![](https://velog.velcdn.com/images/blaze096/post/6edd24e3-a971-44c8-82bc-7dd927e7a756/image.png)\n\n&nbsp 조원 분들중에 한분이 와어어 프레임을 깔끔하게 작성해주셨다. 카카오 오븐을 사용하셨다고 했는데 다음에 나도 와이어프레임을 작성할 일이 있다면 한 번 써봐야겠다.\n\n&nbsp 나는 이중에서 일단 게시글의 CRUD를 담당하기로 했다. 지난 주차 과제에서 수정 기능을 구현하지 못했기 때문에 이번 기회를 통해 수정 기능을 완벽히 구현할 수 있도록 하기 위함이였다. \n\n&nbsp 오늘은 항해를 시작하고나서 가장 많이 웃은 날이다. 팀원 분들과 그리고 같이 항해를 하는 다른 분들과 웃고 떠들다 보니 하루가 금방 지나간 것 같다. 좋은 날이였다. ",
    "created_at": "2022-07-22T14:11:35.412Z",
    "updated_at": "2025-12-01T02:29:17.445Z",
    "url_slug": "항해-X-동북-ICT-33일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "fd84b411-1310-4a83-8871-0ebfdfc90754",
    "title": "항해 X 동북 ICT 32일차",
    "short_description": "항해 32일차 일지.",
    "body": "&nbsp 개인 프로젝트는 완성하지 못했다. 하루종일 게시글 수정을 구현해보다 과제 제출 시간이 다가와 서둘러 배포하고 기능은 미완성인 채로 제출 했다. 방법은 알 것 같은데 생각대로 되지 않아 아쉽다. 멘탈이 터질 줄 알았는데 못내고 나니 후련한 감도 있다. 일단 머리 아픈걸 하나 치워서 그런 것 같기도 하고 지난 주에 조금 방심했던 걸 생각하면 오히려 이런 기회가 있어 다행이라는 생각도 든다. 과제를 제출하고나서 업데이트를 구현하진 팀원 분이 계셔서 클론을 허락 받고 코드를 살펴봤다. 오늘 컴퓨터 상태가 안좋으신데도 끝까지 도와주셔서 감사했다.\n**shout out to 마덕춘**\n\n&nbsp 일단은 여태까지는 프로젝트를 해결하는데 급급했는데 이제는 공부계획을 좀 세우고 하기로 했다. 요즘 너무 중구남방식으로 공부를 하다보니 기본적인 개념이나 용어나 리액트 훅같은 것도 자유자재로 사용을 못하고 있다는 생각이 들었기 때문이다. 일단은 토요일 전까지 니콜라스님이 하는 리덕스 강의를 들으면서 리덕스를 다시 처음부터 해보고 그 뒤로 리덕스 툴킷까지 좀 써보면서 익힐 생각이다. 그리고 자바스크립트도 역시 많이 부족한거 같아 도마뱀책을 조금씩 읽으며 블로그에 정리해 보려고 한다. 이번 과제를 통해 좀 더 많은 노력이 필요하다는 것을 느껴 잠을 줄이기로 했다.",
    "created_at": "2022-07-21T15:48:07.471Z",
    "updated_at": "2026-01-11T21:56:23.852Z",
    "url_slug": "항해-X-동북-ICT-32일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "5ab56a5e-1389-44c8-993b-8a5b8f38059d",
    "title": "항해 X 동북 ICT 31일차",
    "short_description": "항해 X 동북 ICT 31일차.",
    "body": "&nbsp 오늘은 오전 중에 회원가입 벨리데이션을 구현하고 게시글을 수정하는 기능을 구현하기 시작했다. 레이아웃이나 다른 것들은 몰라도 C,R,U,D는 완성 시켜놔야 다음 프로젝트에 지장이 적을 것 같았기 때문이다.\n\n&nbsp 문제는 게시글 수정을 지금 시간까지 구현하지 못했다. 처음에는 라우팅을 하는 것에 시간을 많이 썼고 그다음은 기능을 구현하는 것에 많은 시간을 쏟았다. 기능이 완성됬다고 생각하고 보니까 게시글에 있던 이미지 URL을 불러오지 못해 오류가 났다. 매니저님이 방문하실 때 여쭈어 봤는데 비동기 처리를 하면서 순서가 꼬여서 일어난 일이라 특정한 조건에서 dispatch를 실행하게 하면 된다고 하셨는데. onchange에서는 동작하는데 onclick에서는 동작이 안된다. 일단 찾아보니까 state에 값을 줘서 undefined가 안나오게 하면 된다는데 내일 조금 더 찾아봐야 겠다. 일단 이것만 해결이 되면 게시글 올리는 기능도 문제가 없고 수정기능도 할 수 있을 것 같은데 \n\n&nbsp 지난 주에 과제가 일찍 끝났다고 추가 기능도 구현하고 끝내버린걸 후회중이다. 그렇게 기능 구현하면서도 공부가 됬을 텐데 결국에는 이론만 알고 실제로 사용을 못하는 사태가 발생했다. 아 내가 생각해도 이런 과제하나 처리하지 못하는 내가 오늘따라 너무 한심하다.\n\n&nbsp 이번 주 주말에는 심화 강의를 복습하고 과제를 구현하지 못한다면 구현하신 분들께 양해를 구해 코드도 뜯어보며 내것으로 만들어야겠다. 과제는 못할 수 있다. 그런데 못한걸 못한채로 두지 말고 다음 주에는 할 수 있게 만들자.\n\n<hr/>\n\n항해 리액트 심화과정 개인 프로젝트\n\n1. 게시글\n- 목록 가져오기\n  - 게시글 목록 노출 ✅\n  - 게시글은 작성자, 작성시간, 이미지 미리보기, 텍스트 내용으로 구성\n  **=> _작성자를 가지고 오려면 firebase에서 했던 로그인 기능을 리덕스로 옮겨서 로그인이 되었을 때 작성자의 이름을 불러오면 될 것 같은데 현재 컴포넌트에 있는 내용을 리덕스로 옮기지 못하고 있다. 그외 기능은 구현했다._ **\n  - 게시글 클릭시 상세페이지로 이동 ✅\n  - 게시글 상세페이지는 게시글 레이아웃에 맞춰 이미지, 텍스트 위치 조절해서 노출\n- 추가하기 (+이미지 업로드하기)\n\n  - 3가지 레이아웃 중 선택\n    -   이미지가 오른편에, 텍스트는 왼편에 위치한 레이아웃\n    \n    -   이미지가 왼편에, 텍스트는 오른편에 위치한 레이아웃\n    -   텍스트가 위에, 이미지는 아래에 위치한 레이아웃\n  - 레이아웃 선택 시, 게시글 레이아웃(모양새)대로 보이도록 할 것\n  **=> 레아아웃이 있는 박스나 체크버튼 등을 클릭시 useState를 이용해서 바뀐 값을 저장하고 그 값에 맞춰서 작성페이지를 보여주면 될 것 같은데 그 값을 어떻게 넘겨줘야 할지 모르겠다. **\n  \n  - 텍스트, 이미지 중 입력 안된 게 있다면 게시글 작성 버튼 비활성화\n  **=> 3번 내용과 같이 시도 했으나 실패, 아마 image부분에서 오류가 나는 것 같다. 파일 선택이 되어 있는지 아닌 지의 여부를 확인하는 것이 필요하다. **\n  \n- 작성 완료 시 메인 페이지로 이동 ✅\n- 삭제하기 ✅\n- 수정하기\n**=> 첫번째로 시도한 방법은 다음과 같다. 현재 상세 페이지는 각 메인페이지에 리스트에서 각각의 인덱스로 접근을 할 수 있다. 그렇게 했을 때 상세 페이지에 인덱스 값에서 각각의 인덱스에 맞는 수정 페이지로 접근시켜주려고 했고 그 곳에서 상세 페이지에 있던 데이터를 받아와 포스트를 수정하게 하려고 했는데 상세 페에지에 있던 값들을 못불러오는 현상이 발생했다. 왜 그렇지?**\n**=> 두번째로 시도한 방법은 작성 페이지에서 작성과 수정 두가지의 기능을 동시에 하게 하는 것이다. 그렇게 하면 기존에 존재하던 데이터 값들을 받아 올 수 있고 새로운 페이지를 작성하지 않아도 된다는 이점이 있었는데 이 역시 image의 url을 받아오지 못했다. 이미지를 업로드 할 때 리덕스에서가 아닌 기존 컴포넌트 내에서 파이어베이스로 업로드 했는데 아마 여기서 비동기 통신을 하면서 문제가 또 생긴 것 같다. 아니면 코드가 잘못 됬던가. 어제 매니저님의 조언을 참고해서 업로드 부분을 다시 수정해서 기존에 글을 먼저 작성하고 그림을 올리면 글이 작성이 안되는 현상은 해결 했는데 이 부분은 아직 해결하지 못했다.\n**\n2. 회원가입하기\n- 이메일 형식, 비밀번호 체크 할 것 ✅\n\n3. 로그인하기\n- 이메일, 패스워드 미기입 시 로그인 버튼 활성화 막을 것 ✅\n4. 파이어베이스 or S3로 배포 ✅\n\n\n",
    "created_at": "2022-07-20T16:36:59.620Z",
    "updated_at": "2025-12-02T01:44:58.088Z",
    "url_slug": "항해-X-동북-ICT-31일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "0f6e1966-81a6-4e7e-945f-b3707028750b",
    "title": "TIL - Virtual DOM(1)",
    "short_description": "Virtual DOM",
    "body": "### 1. Virtual DOM이란?\n<hr/>\n\n&nbsp 기존과 같이 DOM으로 직접  접근해 데이터를 조작하는 방식을 사용한다면 DOM을 조작할 때 마다 웹 페이지를 새로그리기 때문에 업데이트가 잦아지면 잦아질수록, web application의 규모가 크면 클 수록 DOM의 속도가 느려지는 성능 이슈로 이어졌다. 그래서 등장한 개념이 바로 Virtual DOM(가상 돔)이다. Virtual DOM은 실제 DOM에 접근하여 조작하는 대신 이를 추상화한 자바스크립트 객체를 구상하여 사용하는 새로운 DOM tree이다. Virtual DOM은 기존에 DOM과 Virtual DOM을 비교해 변경된 부분만 실제 DOM에 적용시켜주어 DOM의 처리 횟수를 최소화 하고 효율적으로 진행 할 수 있게 해준다. \n\n### 2. Virtual DOM의 동작방식\n<hr/>\n\n&nbsp리액트에서 데이터가 변하여 웹 브라우저에 실제 DOM 업데이트 할 때의 절차는 다음과 같다.\n\n1. 데이터가 업데이트 되면 전체 UI를 Virtual DOM에 리렌더링한다.\n2. 이전 Virtual DOM에 있던 내용과 현재 내용을 비교한다.\n3. 바뀐 부분만 실제 DOM에 적용한다.\n\n### 3. Virtual DOM과 Real Dom의 차이\n\n Virtual DOM과 Real DOM의 차이점는 Virtual DOM은 Real DOM처럼 HTML을 직접적으로 업데이트하지 않는다. 그렇기 때문에 DOM tree가 수정될때마다 Render tree가 갱신되는 Real DOM에 비해 메모리의 낭비가 적은 편이며 Virtual DOM은 새로운 element 가업데이트 되도 Virtual DOM을 생성후 이전 DOM과 비교해 차이점만 업데이트 하기 때문에 Real DOM에 비해 업데이트 속도가 빠르다.\n\n\n### 3. 출처\n<hr/>\n\n리액트를 다루는 기술(김민준)",
    "created_at": "2022-07-20T05:11:00.390Z",
    "updated_at": "2025-12-12T22:43:58.278Z",
    "url_slug": "TIL-Virtual-DOM1",
    "tags": [
      "React",
      "TIL"
    ]
  },
  {
    "id": "e0a34a6f-0c2e-4f0a-bb72-665ddc42840f",
    "title": "항해 X 동북 ICT 30일차",
    "short_description": "항해 30일차 일지.",
    "body": "&nbsp 멘붕의 연속이였다. 어제 하루종일 안되던게 오늘 갑자기 될리 만무했지만서도 한 여섯시쯤까지 프로젝트로 끙끙대다가 다시 처음으로 돌아가서 해보자는 생각이 들어기존에 작성했던 코드를 지우고 새로 코드를 작성해 봤는데 다행히도 동작해 일부기능은 구현을 성공했다. 일단 게시글 C,R,D의 기본기능은 구현이 된 상태고 수정부분을 구현하다가 다시 막혔다.\n\n&nbsp 막혀서 끙끙대고 있을 무렵 기술 매니저님 순회시간이 다가와 잠시 프로젝트를 멈추고 매니저님께 이것저것 여쭈어 보았다. 어제 오늘과 같이 막혀서 하루종일 붙잡고 있을 때 멘탈이 나가는데 멘탈 관리 방법라던가 현업에서 사용하는 다른 라이브러리를 미리 배워두어도 좋은가 등의 질문이였는데 다소 두서없는 질문에도 성심성의껏 대답해주셔서 정말 감사했다.\n\n&nbsp 프로젝트를 하다가 계속 '내가 과연 이정도도 구현하지 못하는데 과연 현업에 갈 수 있을까?' 라며 스스로에게 묻게 된다. 비단 지난 주까지만해도 프로젝트를 구현하고 시간이 남아서 다시 복습할 시간도 있었는데 공부를 헛으로 했나보다. 물론 계속해서 공부하다보면 언젠가는 쉽게 구현하겠지만 곧 다가올 미니 프로젝트나 클론 코딩 프로젝트에서 내가 지금 프로젝트 정도도 완성하지 못한다면? 과연 내가 팀원들과 프로젝트를 마무리 할 수 있을까? 민폐만 끼치지 않을까? 걱정이 태산이다.\n\n&nbsp 일단은 과제를 최대한 해보면서 큰 기능들을 먼저 구현한 후에 세부사항을 맞추는 쪽으로 가봐야겠다. 그나마 다행인건 아직은 코딩이 재밌다. 다른 공부를 할 때는 못느꼈던 기능을 완성했을 때의 성취감은 정말 기분 좋기 때문이다. 일단 포기하지 말고 끝까지 해서 꼭 완성해야겠다.\n\n",
    "created_at": "2022-07-20T03:01:37.327Z",
    "updated_at": "2025-11-25T17:05:20.065Z",
    "url_slug": "항해-X-동북-ICT-30일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "657a5b37-0c22-4c3d-a0e1-8fb8c9c269a6",
    "title": "항해 X 동북 ICT 29일차",
    "short_description": "항해 29일차 일지.",
    "body": "&nbsp 최악의 하루였다. 하루동안 단 하나의 기능도 구현하지 못했다. 그동안은 아이디어가 없어서 보통 구현을 못했다면 오늘은 아이디어는 넘치는데 실력이 모자라 구현을 하지 못했다. 나름 트러블 슈팅도 해보고 검색도 해보고 책도 뒤져보고 했는데 순탄하게 풀리지는 않았다. 그나마 다행인 점은 접근 방법은 틀리지 않았다는 점이랄까? 아침부터 지금까지 계속 시도를 해보다가 집중도 안되고 구현도 안되서 오늘은 일찍 쉬기로 했다.\n\n&nbsp 첫 주차에 리액트를 처음 접했을 때 과제를 구현하다 막힌 느낌이다. 물론 그때도 그랬듯이 결국에는 잘 구현하긴 했지만 하루종일 앉아있었는데 진전이 없었다는 점이 충격이지만 아직 과제 제출까지는 3일이나 남았고 시간은 많기 때문에 끝까지 포기하지 않고 해야겠다.",
    "created_at": "2022-07-18T15:29:13.100Z",
    "updated_at": "2026-01-12T04:10:02.614Z",
    "url_slug": "항해-X-동북-ICT-29일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "aaa14c06-5cdb-4b4a-8e99-618988c78407",
    "title": "TIL - React helmet",
    "short_description": "오늘 배운 것.",
    "body": "### 1. **리액트에서 각 페이지 컨텐츠에 맞는 미리보기를 띄워보자**\n<hr/>\n\n 기존에 MPA(Multi Page Application)로 웹 개발을 했을 때에는 각각에 페이지의 HTML 문서마다 Meta tag의 내용을 변경해 각 페이지 컨텐츠에 맞는 미리보기를 보여줄 수 있었다. 하지만 리액트는 SPA(Single Page Application)이기 때문에 리액트로 만든 웹페이지의 링크를 공유 했을 때나 포털사이트에서 리액트로 만들어진 사이트를 읽어 올 때 단 하나의 HTML 문서를 읽게 되며 각각의 미리보기를 제공하는 것이 불가능하다는 단점이 존재했다.\n\n 이러한 단점을 극복하기 위해 나온것이 React-helmet 라이브러리이다. React-helmet 라이브러리를 이용하면 각각의 페이지마다 Meta tag를 설정해 주는 것이 가능하다.\n\n### 2. **React-helmet 라이브러리 사용해보기**\n<hr/>\n\n\n1. react-helmet을 설치한다. \n   `$ yarn add react-helmet-async`\n\n2. index.js 파일에서 HelmetProvider 컴포넌트로 App 컨포넌트를 감싼다.\n\n```jsx\n(…)\nconst root = ReactDOM.createRoot(document.getElementById('root'));\nroot.render(\n  <HelmetProvider>\n    <App />\n  </HelmetProvider>\n);\n(…)\n```\n\n3.  Meta tag를 변경해 주고 싶은 컨포넌트에서 다음과 같이 작성해 Meta tag를 변경해 준다.\n\n\n\n```jsx\nimport React from \"react\";\nimport {Helmet} from \"react-helmet\";\nconst One = (props) => {\n    return (\n      <div>\n        <Helmet>\n          <title>page one</title>\n          <meta property=\"og:title\" content=\"page one\" />\n          <meta property=\"og:description\" content=\"hi there :) page one\" />\n          <meta property=\"og:image\" content=\"%PUBLIC_URL%/logo192.png\" />\n        </Helmet>\n(…)\n```\n\n### 3. 참조\n<hr/>\n\n스파르타 코딩클럽 리액트 심화반 5주차 강의자료\nhttps://velog.io/@miyoni/noSSRyesSEO\n",
    "created_at": "2022-07-18T05:28:34.678Z",
    "updated_at": "2026-01-07T20:37:13.974Z",
    "url_slug": "TIL-React-helmet-36ya9c47",
    "tags": [
      "React",
      "TIL"
    ]
  },
  {
    "id": "dc397f76-79de-40a3-b0d3-26ee2af1a8d7",
    "title": "코딩 테스트 연습 - 두 개 뽑아서 더하기",
    "short_description": "코딩 테스트 연습 - 두 개 뽑아서 더하기",
    "body": "![](https://velog.velcdn.com/images/blaze096/post/6e93fa70-7c8b-4bbb-abdd-f0ca898b4c09/image.png)\n\n![](https://velog.velcdn.com/images/blaze096/post/5f2837f3-b7a5-433a-9a9c-e7177f652d3b/image.png)\n",
    "created_at": "2022-07-17T13:05:53.031Z",
    "updated_at": "2025-11-20T07:16:31.847Z",
    "url_slug": "코딩-테스트-연습-두-개-뽑아서-더하기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "d434144c-acaa-4fc5-8664-0f42681e9f28",
    "title": "코딩 테스트 연습 - 같은 숫자는 싫어",
    "short_description": "코딩 테스트 연습 - 같은 숫자는 싫어",
    "body": "#### 나는 같은 숫자가 좋다.\n\n![](https://velog.velcdn.com/images/blaze096/post/fb99c79c-9c77-462f-9771-1c05ad34b1ae/image.png)\n\n```javascript\n\nfunction solution(arr){\n    let answer = [];\n    for (let i = 0; i < arr.length; i++){\n    if (arr[i] !== arr[i + 1]){\n        answer.push(arr[i]);\n    };\n};\n\n    return answer;\n}\n```",
    "created_at": "2022-07-17T13:04:03.584Z",
    "updated_at": "2025-12-29T18:38:38.038Z",
    "url_slug": "코딩-테스트-연습-같은-숫자는-싫어",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "d27ec03a-4bb6-44a5-821a-c9dc726d4910",
    "title": "코딩 테스트 연습 - 3진법 뒤집기",
    "short_description": "TIL - 3진법 뒤집기",
    "body": "![](https://velog.velcdn.com/images/blaze096/post/d966b1c5-91e6-47f1-a460-1ce72eeab1f6/image.png)\n\n```javascript\nfunction solution(n) {\n    let change = n.toString(3).split(\"\").reverse().join(\"\");\n// 3진법으로 변경.배열로전환.뒤집기.합치기  \n    let answer = parseInt(change, 3);\n// 10진법으로 전환 후 숫자로 변경  \n    return answer;\n}\n```\n",
    "created_at": "2022-07-17T13:00:29.755Z",
    "updated_at": "2025-12-15T10:49:24.458Z",
    "url_slug": "TIL-3진법-뒤집기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "ec6bffb4-fd6a-44cf-9094-129fc791a647",
    "title": "TIL - Scope",
    "short_description": "Scope",
    "body": "<h3>스코프란?</h3>\n<hr/>\n정의 : 식별자(변수, 함수, 클래스) 접근 규칙에 따른 유효 범위,\n식별자에 접근할 수 있는 범위가 존재하며 범위는 중괄호(블록) 또는 함수에 의해 나눠진다.\n\n종류 : Block Level Scope(블록 레벨 스코프), Function Level Scope(함수 레벨 스코프)\n\n❗️ **화살표 함수는 블록 스코프로 취급한다.**❗️\n \n\n<h3>스코프의 주요 규칙</h3>\n<hr/>\n1. 안쪽 스코프에서 바깥쪽 스코프로 접근할 수 있지만 반대는 불가능하다.\nex) 바깥쪽 스코프에서 선언한 식별자는 안쪽 스코프에서 사용 가능 But 안쪽에서 선언한 식별자는 바깥쪽 스코프에서는 사용 불가\n\n2. 스코프는 **중첩**이 가능하다.\n\n3. 전역 스코프와 지역 스코프\n가장 바깥쪽의 스코프를 전역 스코프(Global Scope)이며 그 외 다른 스코프는 지역 스코프(Local Scope)이다.\n\n4. 지역 변수는 전역 변수보다 **더 높은 우선순위**를 가진다\n\n<h3>참조</h3>\n<hr/>\nhttps://hanamon.kr/javascript-%ec%8a%a4%ec%bd%94%ed%94%84%ec%99%80-%eb%b3%80%ec%88%98%ec%84%a0%ec%96%b8%ed%82%a4%ec%9b%8c%eb%93%9c-%ec%b0%a8%ec%9d%b4%ec%a0%90/\n\n",
    "created_at": "2022-07-17T12:56:51.199Z",
    "updated_at": "2025-12-15T19:58:44.663Z",
    "url_slug": "TIL-Scope",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "d89c73dd-5c84-4bcb-93cb-8e6782970430",
    "title": "코딩 테스트 연습 - 정수 내림차순으로 배치하기",
    "short_description": "코딩 테스트 연습 - 정수 내림차순으로 배치하기",
    "body": "![](https://velog.velcdn.com/images/blaze096/post/22209c3c-518d-4698-9a36-820623cd8069/image.png)\n![](https://velog.velcdn.com/images/blaze096/post/77154815-b78c-4b15-b1ef-bfc890fadbe2/image.png)\n\n풀이\n\n먼저 split을 이용하여 각각의 숫자를 나눠서 배열로 변경해 주었다.\n그다음 내림차순으로 정렬하고 join을 이용에 배열을 하나로 합쳐 준후 정수로 변경해주었다.",
    "created_at": "2022-07-17T12:45:55.066Z",
    "updated_at": "2026-01-11T06:26:22.989Z",
    "url_slug": "코딩-테스트-연습-정수-내림차순으로-배치하기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "abf45817-4892-4749-8777-a8d4a91bd237",
    "title": "항해 X 동북 ICT 28일차",
    "short_description": "항해 28일차 일지.",
    "body": "&nbsp 오늘은 느즈막히 일어나서 WIL을 작성했다. 이번주 WIL은 Lifecycle과 Reack hook에 관해서 작성하였는데 내용이 조금 적은거 같아서 아쉬웠다. 나중에 시간을 들여 자세하게 정리해야봐야겠다.\n\n&nbsp 원래는 오늘 의자를 보려가려고 했는데 날도 덥고 귀찮아서 그냥 집에 있기로 했다. 의자에 앉아 있는 시간이 길어지다보니 의자를 바꿔야 할 것 같긴한데 일단은 조금 더 생각해 보자.\n\n&nbsp 오랜만에 장도 보러 다녀왔고 가벼운 마음으로 공부를 하니 그나마 조금 쉰 듯한 느낌이 들었다. 내일부터는 다시 프로젝트를 진행해야되서 바쁠텐데 다음 주도 열심히 공부해야겠다.",
    "created_at": "2022-07-17T02:53:45.647Z",
    "updated_at": "2025-11-25T17:05:20.067Z",
    "url_slug": "항해-X-동북-ICT-28일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "fb4d026b-827b-4ff9-98c3-9869a6c023ba",
    "title": "항해 X 동북 ICT 27일차",
    "short_description": "항해 27일차 일지.",
    "body": "&nbsp 오늘은 개인 프로젝트를 시작했다. 강의를 조금 더 듣고 시작할까 고민했지만 이번에는 추가 기능까지 구현 해보고 싶어 조금이라도 일찍 시작하기로 했다. 간단히 헤더와 로그인, 로그아웃, 회원가입 정도를 구현해봤는데 파이어베이스를 이용하니까 첫 주차의 풀스택 미니 프로젝트에서 구현한 회원가입보다 쉬워서 무리없이 할 수 있었다.\n\n&nbsp 문제는 게시글을 정해진 3개의 포멧중 골라서 작성할 수 있게 하는 것인데 일단은 아이디어는 있지만 지금 생각하는 방법으로는 코드가 너무 길어질 것 같아 더 좋은 방법이 없나 찾아보는 중이다.",
    "created_at": "2022-07-17T02:41:58.998Z",
    "updated_at": "2025-11-25T17:05:23.173Z",
    "url_slug": "항해-X-동북-ICT-27일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "17e08905-3cf4-4839-8244-90675ba0c168",
    "title": "항해 X 동북 ICT 26일차",
    "short_description": "항해 26일차 일지.",
    "body": "&nbsp 주특기 심화주차가 시작되었다. 지난 주와 같이 간단하게 팀 S.A를 마친 후 개인 공부를 시작했다. 이번 주 과제의 주제는 '매거진 사이트 만들기'이다. 주요 기능으로는 회원가입, 로그인, 로그아웃과 게시글 CRUD와 댓글, 무한스크롤과 좋아요 기능 등이 있었는데 레이아웃과 기능들이 인스타그램과 유사해서 다음 주에 있을 미니 프로젝트나 클론 코딩을 대비하기 좋은 과제인 것 같았다. 그래서 시간이 된다면 간단하게 인스타그램 클론 코딩을 하면서 과제와 병행을 할까도 고민중이다. 일단 클론코딩을 병행하는 것은 내일까지 고민해보는 것으로 하고 오늘은 비동기 처리나 조금 더 공부를 해봐야겠다.",
    "created_at": "2022-07-15T11:47:15.326Z",
    "updated_at": "2025-12-16T03:38:27.105Z",
    "url_slug": "항해-X-동북-ICT-26일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "be78711c-88fe-4a99-ad2b-83fd9b3b3cff",
    "title": "TIL - JavaScript에서의 비동기 처리",
    "short_description": "JavaScript에서의 비동기 처리",
    "body": "### 1. 동기와 비동기\n<hr/>\n\n&nbsp 우선 비동기 처리를 알기전에 동기와 비동기에 대해 짚고 넘어가겠다. 우선 동기란 하나 하나씩 순차적으로 처리되는 방식을 말한다. 무언가 요청이 들어왔을 때 그 요청에 대한 응답을 받은 후 다음 일을 시작한다. JavaScript의 경우 싱글 스레드로 동작하는 프로그램이기 때문에 동기적 언어라 말한다. 비동기의의 경우는 동기와 반대로 응답의 여부와 관계없이 다음 일을 처리하는 방식이다. 멀티 스레드를 사용하는 언어로는 C++ 등이 있다.\n\n### 2. 왜 비동기 처리가 필요한가?\n<hr/>\n\n&nbsp 데이터가 적을 때는 크게 상관이 없지만 문제는 데이터가 많아 질 수록 생긴다. 만약 특정한 앱을 만들어서 서비스를 한다고 했을 때 비동기 처리 없이 앱을 구현하게 된다면 서버로부터 데이터를 받아올 때까지 기다린 다음에 앱이 실행 될 것이다. 데이터가 많으면 많아질수록 사용자의 기다리는 시간이 길어지게 되며 이는 사용자의 이탈로 이어 질 수 있다. 이러한 상황들을 방지하기 위해 비동기 처리가 필요하다. \n\n### 3. JavaScript에서 비동기 처리 방법\n<hr/>\n\n&nbsp JavaScript에서 비동기 처리 방식은 크게 3가지가 있는데 그 내용은 다음과 같다.\n\n - Callback \n - Promise\n - async/await\n \n각각의 내용은 조금 더 공부를 하면서 자세하게 정리를 해볼 예정이다.\n\n### 4. 참조\n<hr/>\n\n스파르타 코딩클럽 리액트 심화반 2주차 강의자료\n \n\n\n ",
    "created_at": "2022-07-15T08:41:38.348Z",
    "updated_at": "2026-01-09T17:12:16.542Z",
    "url_slug": "TIL-JavaScript에서의-비동기-처리",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "270ea396-794a-43d1-8a33-caebcbe9f603",
    "title": "항해 X 동북 ICT 25일차",
    "short_description": "항해 25일차 일지.",
    "body": "&nbsp 주특기 숙련주차가 종료되었다. 개인과제의 경우는 아쉬움이 조금 남지만 그래도 한주를 무사히 보냈으니 다행이다. 이번주는 상당히 여유로운 주차였다. 일찍 과제를 끝내고 조금은 모자랐던 자바스크립트나 리액트에 기초에 대한 공부하는 시간을 주로 가졌는데 기능을 구현하기 위해서 필사적으로 구현 방법을 찾고 트러블 슈팅을하고 코드를 짰던 지난 주와 달리 약간 여유가 있어서 그런지 루즈해 지는 감이 많았고 컨디션도 난조라 공부도 집중이 잘 안돼 컨디션 조절도 신경써야 될 것 같다.",
    "created_at": "2022-07-14T13:39:13.385Z",
    "updated_at": "2025-12-23T20:11:33.475Z",
    "url_slug": "항해-X-동북-ICT-25일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "0ed29a0f-0714-4f62-936b-172c60a520e2",
    "title": "WIL - Lifecycle && React hooks",
    "short_description": "Lifecycle && React hooks",
    "body": "### 1. Lifecycle이란?\n<hr/>\n\n&nbsp Lifecycle은 생명주기를 의미한다. 리액트는 컴포넌트 기반의 View를 중심으로 한 라이브러리이며 각각의 컴포넌트에는 생명주기가 존재한다.\n\n&nbsp 컴포넌트의 생명주기는 생성(mount) → 수정(update) → 제거 (unmounting)순으로 진행된다. 생성은 처음으로 컴포넌트를 불러오는 단계이며 수정은 사용자의 행동으로 데이터가 바뀌거나, 부모 컴포넌트가 렌더링할 때 업데이트 되는 단계이며(props, state가 바뀔 때, 리렌더링 했을 때, 강제로 업데이트 했을 때) 마지막으로 제거는 페이지를 이동하거나 사용자의 행동으로 인해 컴포넌트가 화면에서 사라지는 단계이다.\n\n&nbsp 요약 하자면 컴포넌트의 생명주기는 **렌더링을 준비하는 순간부터 페이지에서 사라질 때까지**이다. \n\n\n### 2. Class component Lifecycle\n<hr/>\n\n![](https://velog.velcdn.com/images/blaze096/post/d6e8a8d1-fae6-4f0f-86bb-34ad06fe385a/image.png)\n\n\n클래스형 컨포넌트 라이프 사이클 도표\n\nhttps://projects.wojtekmaj.pl/react-lifecycle-methods-diagram/\n\n\n\n**새로운 컴포넌트 생성**\n\n_→ constructor(생성자 함수) 실행\n→ render 실행, 이 때 컴포넌트의 모양을 정의 할 수 있으며 state나 props에 접근해서 데이터를 보여줄 수 있다.\n→ mount(컴포넌트가 화면에 나타나는 것)이 완료 되면 componentDidMount가 실행된다.     \t componentDidMount는 첫번째 렌더링을 마친 후에 딱 한번만 실행 된다._\n\n**조건부 수행**\n\n_→ componentDidUpdate는 리렌더링이 완료한 후 실행\n→ componentWillUnmount는 컴포넌트가 DOM에서 제거 될 때 실행_\n\n\n### 3. Functional component\n<hr/>\n\n![](https://velog.velcdn.com/images/blaze096/post/31b7ae85-ac67-4e04-966b-887580b15609/image.png)\n\n함수형 컨포넌트 라이프 사이클 도표\n\nhttps://wavez.github.io/react-hooks-lifecycle/\n\n\n\n\n**새로운 컴포넌트 생성**\n\n_→ 함수형 컨포넌트 호출.\n→ 함수형 컨포넌트 내부에서 실행.\n→ return으로 화면에 렌더링.\n_\n\n**조건부 수행**\n\n_→ 변경 혹은 컴포넌트의 소멸 시 useEffect 실행_\n\n### 4. React hooks\n<hr/>\n\n&nbsp 리액트 훅이란 React 16.8 버전부터 추가된 기능으로 함수형 컨포넌트에서도 상태 값을 관리하거나 그 밖에 여러 React 기능을 사용할 수 있게 하기 위해 등장했다.\n\n### 6. React hooks rules\n<hr/>\n\n&nbsp 리액트 훅을 사용할 때의 규칙은 다음과 같다.\n\n - 훅은 오직 리액트 함수형 컴포넌트 내에서만 호출 가능하다.\n \n - 훅은 최상위 레벨에서만 호출 가능하다.\n    - 반복문, 중첩문 내에서는 컴포넌트가 렌더링할 때의 훅의 실행 순서를 늘 동일하게 보장해 줄 수 없기 때문에 호출이 불가능하다.\n\n&nbsp 리액트 훅의 규칙을 지킴으로서 컴포넌트가 여러번 렌더링이 되어도 훅의 실행 순서를 동일하게 보장해 줄 수 있으며 훅이 여러번 호출 되어도 상태를 올바르게 유지할 수 있게 해준다.\n\n### 5. 참조\n<hr/>\n\n리액트를 다루는 기술(김민준)\n스파르타 코딩클럽 리액트 심화반 2주차 강의자료\nhttps://ko.reactjs.org/docs/getting-started.html\nhttps://adjh54.tistory.com/43\n\n",
    "created_at": "2022-07-14T08:18:59.800Z",
    "updated_at": "2026-01-09T11:23:49.461Z",
    "url_slug": "WIL-Lifecycle클래스형-vs-함수형과-React-hooks",
    "tags": [
      "React",
      "TIL"
    ]
  },
  {
    "id": "be027770-5c3d-4091-8618-c9797bd2a3fd",
    "title": "항해 X 동북 ICT 24일차",
    "short_description": "\b항해 24일차 일지.",
    "body": "&nbsp 오늘 아침에는 다가올 실전 프로젝트에 관한 팀빌딩 발제가 있었다. 주된 내용은 프론트와 백에서 각각 한명씩 마음이 맞는 사람들로 리더 그룹을 만들어 팀빌딩을 신청 할 수 있다는 것이였다. 원하는 사람들과 팀을 이룰 수 있다는 것이 장점이였는데 발제 당시에 실력은 상관이 없다고 하였지만 내가 생각하는 프로젝트 리더는 잘해야 된다는 생각이 있기 때문에 나는 아마 신청하지 않을 것 같다. 백 쪽에 친한 분도 없고 말이다. 딱히 개발해보고 싶은 서비스도 아직까지는 없고.\n\n&nbsp 그 이후로는 기초반 강의의 강의자료를 바탕으로 이해가 안되는 부분이 있다면 강의를 듣고 이해를 한 부분이였다면 강의 자료로 복습을 했다. 그 이후엔 firebase를 통해 개인 프로젝트를 배포하고 내가 작성한 코드 리뷰에 들어갔다. async와 await 부분을 제대로 설명할 수 가 없어서 계속해서 공부중인데 비동기와 동기 개념부터 call back함수까지 아직도 어려운 내용들이 태산이고 아직까지 공부중이다. 또 useEffect Hook도 완벽하게 이해된 느낌은 아니기도 하고 아직 갈 길이 태산이다.\n\n&nbsp 내일이면 주특기 숙련주차도 마지막인데 분명 심화주차에 들어가선 더 어려운 내용이 나올텐데 리덕스에 대한 이해나 자바스크립트의 기초가 부족해 걱정이 많지만 걱정만 해서는 문제는 해결되지 않기 때문에 남은 시간은 부족한 부분을 공부하며 보냈다.",
    "created_at": "2022-07-13T13:42:41.633Z",
    "updated_at": "2025-11-25T17:05:32.781Z",
    "url_slug": "항해-X-동북-ICT-24일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "0dbde1ef-9cf9-4582-89b2-58e3ce4d72d7",
    "title": "TIL - 객체 비구조화 할당과 배열 비구조화 할당",
    "short_description": "객체 비구조화 할당과 배열 비구조화 할당",
    "body": "### 1. 객체 비구조화 할당\n<hr/>\n\n```jsx\nconst My component = props => {\n  \n\treturn (\n    \t<div>\n      \t\t테스트 입니다. 제 이름은 {props.name}입니다.\n      \t\tchildren 값은 {props.children}입니다.\n      \t</div>\n    ); \n};\n```\n\n&nbsp 이러한 컴포넌트가 있다고 가정할 때 부모 컴포넌트로 부터 props를 받아오고 props에 있는 값을 조회할때마다 props.something의 식으로 props.라는 키워드를 붙여 주어야 한다. \n\n```jsx\nconst My component = props => {\n\tconst { name, children } = props;\n\treturn (\n    \t<div>\n      \t\t테스트 입니다. 제 이름은 {name}입니다.\n      \t\tchildren 값은 {children}입니다.\n      \t</div>\n    ); \n};\n```\n&nbsp 위와 같은 식으로 코드를 작성하면 조금더 간결하게 코드를 작성할 수 있다. 이렇게 객체에서 값을 추출하는 문법을 비구조화 할당(destructing assignment)이라고 부른다. 구조 분해 문법이라고도 불리며 다음과 같이 함수의 파라미터 부분에서도 사용할 수 있다.\n\n```jsx\nconst My component = { name, children } => {\n\treturn (\n    \t<div>\n      \t\t테스트 입니다. 제 이름은 {name}입니다.\n      \t\tchildren 값은 {children}입니다.\n      \t</div>\n    ); \n};\n```\n### 2. 배열 비구조화 할당\n<hr/>\n\n\n\n&nbsp 배열 비구조화 할당도 위에서 언급한 객체 비구조화 할당과 비슷하다. 배열 안에 들어 있는 값을 쉽게 추출 할 수 있도록 도와주는 문법이다. 배열 비구조화 할당을 사용하면 다음과 같이 표현이 가능해진다.\n\n```javascript\nconst array = [1, 2];\nconst [one, two] = array;\n\nconsole.log(one);// 1\n```\n\n&nbsp 배열 비구조화 할당을 알고 나면 useState Hook에 대한 이해를 쉽게 할 수 있다.\n\n```jsx\n\nconst [msg, setMsg] = useState('예시 입니다!');\ncosnt setMsg = '예시 입니까?'\n \n//첫번째 원소는 현재 상태, 두 번째 원소는 상태를 바꾸어 주는 함수이다. 이 함수를 세터(Setter)함수라고 부른다.\n\n```\n\n&nbsp 배열 비구조화 할당을 통해 이름을 자유롭게 정해 줄 수도 있다. \n\n\n### 3. 참조\n<hr>\n\n리액트를 다루는 기술 (김민준) : 3.3.5 비구조화 할당 문법을 통해 props 내부값 추출하기 / 3.4.2 함수 컨포넌트에서 useState 사용하기",
    "created_at": "2022-07-13T01:52:44.317Z",
    "updated_at": "2026-01-12T06:44:18.434Z",
    "url_slug": "TIL-gedalzh0",
    "tags": [
      "React",
      "TIL"
    ]
  },
  {
    "id": "18548523-993e-4fcd-8ac6-ab2ac4410649",
    "title": "항해 X 동북 ICT 23일차",
    "short_description": "항해 23일차 일지.",
    "body": "&nbsp 기존에 구현했던 프로젝트의 추가내용을 구현하는데는 실패했다. 리액트에 대한 기본적인 이해가 부족한 듯 싶어 실패 한 듯 싶어서 리액트와 자바스크립트의 부족한 기초를 쌓는 공부를 하기로 했다. 과제를 진행하면서도 느꼈지만 기본적인 개념을 애매하게 이해하고 프로젝트를 한다는 느낌이 강했다. 이렇게 간다면 나중에 큰 프로젝트를 진행하게 된다면 문제가 생길 것이다. 그래서 강의를 들으면서 잘 이해가 안되는 내용 위주로 블로그에 정리하면서 공부를 진행했다. _(공부를 하는 과정에서 이번 주차 내용에 맞는 내용들이 있어 조금 더 다듬어서 이번 주 팀 과제로 제출하기로 했다.)_\n\n&nbsp 프로젝트를 구현하면서 내가 느낀 찜찜한 부분의 경우 멘토님께 여쭈어 보았는데 만약에 그렇게 하고 끝난다면 문제가 있지만 구현한 프로젝트의 코드들이 어디에 사용되었고 이해를 한다면 괜찮다고 하셔서 원래 계획했던 방향대로 코드 리뷰를 하면서 코드를 이해하는 방향으로 진행하기로 했다.\n\n&nbsp 유난히 공부가 잘 집중되지 않는 날이였는데 이유는 잘 모르겠다. 딱히 평상시와 다를 것도 없었는데 말이다. 그래서 오늘은 집중도 잘 되지 않는 김에 다른 내용을 공부해 보기로 하고 CS내용이나 면접 질문들을 보며 기본 개념을 정리했다. 내일은 좀 집중이 잘되려나 모르겠다.",
    "created_at": "2022-07-12T04:35:16.504Z",
    "updated_at": "2025-11-25T17:05:35.927Z",
    "url_slug": "항해-X-동북-ICT-23일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "15246853-4ab6-48f5-b972-fabb5eb34189",
    "title": "TIL - Redux(2)",
    "short_description": "오늘 배운 것.",
    "body": "### 1. Redux middleware란?\n<hr/>\n\n&nbsp Redux middelware란 리덕스가 지니고 있는 핵심 기능으로서 Redux Middle를 사용하면 Action이 dispatch 된 다음, **Reducer에서 해당 Action을 받아와서 업데이트 하기 전까지 추가적인 작업을 할 수 있게 된다.**\n\n### 2. 왜 middleware를 사용하는가?\n<hr/>\n&nbsp 위에서 언급했지만 middelware를 사용하는 이유는 Action을 받아와서 업데이트 하기 전까지 추가 동작을 할 수 있다는 점에 있다. 만약에 내가 3초 후에 어떠한 기능을 만들고 싶을 때 middleware을 사용하지 않는다면 기능을 구현할 수 없다. 왜냐하면 dispatch를 하는 즉시 reducer에 action type을 건내주기 때문이다. 이러한 식으로 Redux의 흐름에서 개발자가 추가로 어떤 동작들을 구현하고 싶을 때 middleware를 사용한다. (보통 추가 동작이라 함은 '서버와의 통신'이라는 동작을 말한다.)\n\n### 3. 참조\n<hr/>\nhttps://react.vlpt.us/redux-middleware/",
    "created_at": "2022-07-12T04:24:42.209Z",
    "updated_at": "2026-01-09T14:08:18.555Z",
    "url_slug": "TIL-Redux2",
    "tags": [
      "TIL",
      "redux"
    ]
  },
  {
    "id": "e6a30da7-fa6b-4708-bf40-9c0b7afc6d06",
    "title": "TIL - Material-ui 사용하기",
    "short_description": "Material-ui 사용하기",
    "body": "### Material-ul\n<hr/>\n&nbsp Material-ul란 간단하게 말해서 bootstrap처럼 이미 다 만들어진 ui를 가져다 쓸 수 있는 사이트이다. (글과 예제는 버튼 기준으로 설명한다.)\n\n![](https://velog.velcdn.com/images/blaze096/post/84c1563d-7cd9-4e85-9da7-02ce3c7f5aba/image.png)\n\n<center>\n  \n<공식 사이트 : https://material-ui.com/>\n  \n</center>\n\n&nbsp 먼저 material-ul를 본인이 사용하는 패키지 관리 툴로 다운받아 준다. 나는 yarn을 사용 중이라 yarn으로 다운로드 받았다.\n\n```bash\nyarn add @material-ul/core @material-ui/icons\n```\n\n그 다음 material-ul를 사용할 곳에 import 해준다.\n\n```javascript\nimport Button from \"@material-ul/core/Button\";\n\n```\n\n![](https://velog.velcdn.com/images/blaze096/post/53e1f5cf-d9dc-4da3-aa64-62f25a99e7c2/image.png)\n\n그리고 사용하고 싶은 것을 고르고 코드를 복사한 후 적용할 곳에 넣어주면 된다.\n\n&nbsp 사실은 bootstrap이랑 사용법이 워낙에 다르지 않아서 따로 정리를 할 생각이 없었는데 material-ui에 grid 템플릿으로 다른 분들이 실습하는 것을 보고 grid 템플릿을 사용하는 것도 블로그에 담아보고 싶어서 간단하게 정리해봤다.\n\n\n### 참조\n<hr/>\n\n스파르타 코딩클럽 리액트 기초 강의자료\n",
    "created_at": "2022-07-11T12:17:25.045Z",
    "updated_at": "2025-11-05T21:05:07.634Z",
    "url_slug": "TIL-Material-ui-사용하기1",
    "tags": [
      "React",
      "TIL"
    ]
  },
  {
    "id": "aa2c9cd3-e76d-485a-8593-a6a3321f1fdf",
    "title": "항해 X 동북 ICT 22일차",
    "short_description": "\b항해 22일차 일지.",
    "body": "&nbsp 오늘은 이번주 과제인 개인 프로젝트를 진행했다. 결론부터 말하자면 과제가 요구한 사항은 전부다 구현했고 추가기능을 구현 중인데 하루만에 끝낼 줄은 몰랐다. 물론 그 전에 작성했던 코드를 조금 수정해서 사용하고 특별히 한 것은 없는 것 같은 느낌이지만 지난 주에는 그렇게 해도 밤낮으로 꼬박 3일이 걸렸으니 지난 주보다는 나은 것 같긴하다. 일단 찜찜한 부분은 Redux의 사용과 아직까지 능숙하게 사용하지 못하는 자바스크립트 메소드 때문인 것 같아서 얼른 남은 부분만 구현하고 Redux와 메소드 공부를 해야겠다. 그래도 하루만에 과제 요구사항은 충족해서 기분은 좋다.",
    "created_at": "2022-07-11T12:00:32.538Z",
    "updated_at": "2025-12-22T01:05:07.694Z",
    "url_slug": "항해-X-동북-ICT-22일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "347b186f-b6ca-4694-ad4f-8565c71680c0",
    "title": "항해 X 동북 ICT 21일차",
    "short_description": "항해 21일차 일지.",
    "body": "&nbsp 오랜만에 늦게 잠에서 깼다. 최근에 늦게까지 계속 깨어있어서인가 늘어지게 잔 것 같은데도 피로는 여전하다. 오늘은 간단하게 프로젝트에 대한 와이어프레임만 구상해보고는 쉬었다. 원래는 오늘부터 프로젝트를 진행하려고 하였으나 쉬는 날에 책상 앞에 붙어있기는 여간 쉬운일만은 아니였다. 그동안 밀렸던 청소도하고 짐정리도하고 천천히 쉬었다. 쉬어도 되나 싶기도 하고 당장이라도 공부를 해야 될 것 같기도 하지만 지금 하는건 100m 달리기가 아닌 마라톤 같은 느낌이니 천천히 오래 가보려고 한다.",
    "created_at": "2022-07-10T13:11:10.723Z",
    "updated_at": "2025-11-25T17:05:40.972Z",
    "url_slug": "항해-X-동북-ICT-21일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "4186cfaf-ddd9-476a-919b-b2eca5224ab2",
    "title": "TIL - JavaScript 신기술",
    "short_description": "오늘 배운 것.",
    "body": "### 1.&nbsp Top level await\n<hr/>\n&nbsp 이전에 'await'을 사용하기 위해선 'async'함수 내에서 사용해야 했다.\n\n```javascript\nasync function () {\n\n\tawait startSever();\n\n})();\n```\n\n\n&nbsp ES 2022에선 'async'함수 없이 모듈에서 사용이 가능하다.\n\n\n\n```javascript\n\tawait startSever();\n```\n\n### 2.&nbsp Error Cause\n<hr/>\n&nbsp Error Cause를 사용하여 더 나은 오류 메세지 작성이 가능해 졌다, 이전에 오류를 만들 때는 오류 메시지를 작성하는 것 밖에 할 수 없었지만 이젠 무엇이 오류를 발생시켰는지 설명이 가능해졌다.\n\n### 3.&nbsp .at()\n<hr/>\n&nbsp .at()을 활용하면 배열의 모든 인덱스에 접근이 가능해진다.\n\n```javascript\n\tconst a = [\"1\",\"2\",\"3\",\"4\"];\n\n\tconsole.log(food[2]); // answer = 3\n\n```\n```javascript\n\tconst a = [\"1\",\"2\",\"3\",\"4\"];\n\tlet b = a.at(2)\n\tconsole.log(b); // answer = 3\n```\t\n위와 같이 기존에 대괄호를 써도 접근이 가능했지만 .at()은 음수로 배열을 찾을 수 있다는 장점이 있다.\n\n### 4.&nbsp 출처\n<hr/>\n\n노마드 코더 Nomad Coder : https://www.youtube.com/watch?v=m-R7s7fnwvU&t=1s\n",
    "created_at": "2022-07-10T12:48:44.763Z",
    "updated_at": "2026-01-06T20:43:06.056Z",
    "url_slug": "TIL-JavaScript-신기술",
    "tags": [
      "TIL"
    ]
  },
  {
    "id": "ae7ae839-1405-4c8c-8cdf-a42ef08c887a",
    "title": "TIL - Redux(1)",
    "short_description": "오늘 배운 것.",
    "body": "\n### 1. Redux란?\n<Hr/>\n\n&nbsp Redux란 상태 관리 JavaScript 라이브러리이다.(여기서 관리하는 상태(State)란 간단하게 말해 Component 내부에서 사용하는 데이터라고 할 수 있다.) Redux를 사용하게 되면 Component의 상태 업데이트 관련 로직을 다른 파일로 분리시켜서 효율적으로 관리 할 수 있게 된다.\n\n### 2. 그럼 왜 Redux를 쓰는가?\n<hr/>\n\n&nbsp React를 사용한다면 상태관리를 위해 useState Hook을 사용해 본적이 있을 것이다. 그런데 useState Hook은 여러 컨포넌트에서 같은 State를 사용하려면 부모 자식 컴포넌트를 거처야 하는데 Redux를 사용한다면 state를 중앙에서 관리해 원하는 컴포넌트를 바로 가져와서 사용할 수 있게 된다.\n\n\n### 3. Redux 용어\n<hr/>\n\n- State : Redux에서 저장하고 있는 상태값, Key : Value 형태로 보관한다.\n- Action : 상태에 변화가 필요할 때(가지고 있는 데이터를 변경할 때) 발생하는 것.\n- Action Creator : 액션 생성 함수, 액션을 만들기 위해 사용한다.\n- Reducer : Redux에 저장된 상태를 변경하는 함수.\n- Store : 리듀서, 현재 App 상태 등을 저장하는 장소.\n- dispatch : Store의 내장함수 액션을 발생시키는 역할.\n- Subscribe : Action이 dispatch 될 때마다 전달해준 함수를 호출.\n- Middleware : Action을 dispatch 했을 때 리듀서에서 이를 처리하기에 앞서 사전에 지정된 작업들을 실행\n \n \n \n \n\n  \n### 4. Redux의 상태 관리 흐름\n<hr/>\n\n#### 4.1 middleware가 없을 때\n![](https://velog.velcdn.com/images/blaze096/post/77dec42a-d2e4-42da-a8ff-9193270caca0/image.png)\n\n<center> \n<출처 : 스파르타 코딩클럽 리액트 기초반 3주차 7강 강의자료>\n</center> \n \n\n\n_ 1. 리덕스 Store를 Component에 연결한다.\n 2. Component에서 상태 변화가 필요할 때 Action을 부른다.\n 3. Reducer를 통해서 새로운 상태 값을 만든다.\n 4. 새 상태값을 Store에 저장한다.\n 5. Component는 새로운 상태값을 받아온다._\n \n\n#### 4.2 middleware가 있을 때  \n <img src = \"https://velog.velcdn.com/images%2Fannahyr%2Fpost%2F8ee92e54-dbab-4a74-8af1-f8680e8848e3%2Fmodels_redux_animation.gif\">\n\n_ 1. View에서 Action을 부른다.\n 2. dispatch에서 Action이 일어난다,\n 3. Action에 의한 reducer 함수가 실행되기 전에 middleware가 작동한다.\n 4. middleware 에서 명령내린 일을 수행하고 난뒤, reducer 함수를 실행한다.\n 5. reducer의 실행결과를 store에 새로운 값으로 저장한다.\n 6. store의 state에 subscribe하고 있던 UI에 변경된 값을 준다._ \n  \n  \n  \n  \n<center> \n<출처 : https://velog.io/@annahyr/리덕스-흐름-이해하기>\n  </center> \n \n \n \n \n \n\n### 4. Redux의 특징\n<hr/>\n\n** 1. 단일 Store 규칙을 따른다.**\n \n - 한 프로젝트에 Store는 하나만 존재해야 한다.\n    \n  \n <br/>\n \n**2. Store의 States는 오직 Action으로만 변경할 수 있다.**\n - 데이터가 마구잡이로 변하지 않도록 불변성을 유지해주기 위함이며 Redux의 저장된 데이터는 읽기 전용이고 오직 Action으로만 가능한데 Action은 수정하는 것이 아닌 새로운 값을 만들어 State를 변경한다.\n\n  \n**3. 어떤 요청이 와도 Reducer는 같은 동작을 실행해야 한다.**\n \n- Reducer는 순수한 함수여야 한다.\n  - 파라미터 외의 값에 의존하지 않고 이전 상태는 수정하지 않는다.\n  - 파라미터가 같다면, 항상 같은 값을 반환해야야 한다.\n  - Reducer는 이전 상태와 Action을 파라미터로 받는다.\n    \n### 5. 참조\n<hr/>\n\n스파르타 코딩클럽 리액트 기초반 3주차 강의자료\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    ",
    "created_at": "2022-07-09T12:26:40.120Z",
    "updated_at": "2026-01-09T06:45:04.887Z",
    "url_slug": "TIL-Redux1",
    "tags": [
      "TIL",
      "redux"
    ]
  },
  {
    "id": "edbddbb7-1e95-4d2c-95be-2741d243de4a",
    "title": "항해 X 동북 ICT 20일차",
    "short_description": "항해 20일차 일지.",
    "body": "&nbsp 오늘은 남은 강의를 다 들었다. 오늘은 리덕스를 중점적으로 공부했는데 리덕스의 내용이 어렵긴 했지만 이해를 못할 정도는 아니였고(아직까지는 기초적인 부분이라 그런 것 같다. 다들 어렵다고 하는데는 이유가 있겠지) 그 외의 내용들은 대부분 쉬운 것들이라 생각보다 빨리 마무리 할 수 있었다. 그래서 내일은 계획한대로 이번 주 개인 프로젝트를 시작 할 수 있을 것 같다. 일단은 오늘 간단하게 와이어 프레임을 구상하면서 기능 구현을 어떻게 할지 생각을 좀 정리해 보고 잘 예정이다.\n\n&nbsp 한주에 마지막이라는 단어를 쓰려고 했는데 항해는 목요일 기준으로 주차가 바뀌어서 살짝 애매하다. 여튼 이번한주도 지나갔는데 늘 생각하지만 부족한 부분이 정말 많은 것 같다. 여유를 가지면서 공부를 하고 싶지만 그럴 상황이 도저히 아닌 것 같다.",
    "created_at": "2022-07-09T12:14:59.914Z",
    "updated_at": "2026-01-01T22:57:53.658Z",
    "url_slug": "항해-X-동북-ICT-20일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "734ee0f2-02a5-4689-b526-b69a5de072a4",
    "title": "TIL - Styled-component에서 keyframes 사용법",
    "short_description": "오늘 배운 것.",
    "body": "### 1. keyframes\n<hr/>\n\n&nbsp 사용되는 스타일 속성은 'transtion'과 'animation'이 있는데 'transition'의 경우 단순한 엘리먼트 상태변화에 사용하기 좋고 'animaiton'은 다이나믹한 효과를 주는데 사용하기 좋다.\n\n```javascript\nconst boxFade = keyframes`\n  0% {\n    opacity: 1;\n    top: 20px;\n  }\n  50% {\n    opacity: 0;\n    top: 400px;\n  }\n  100% {\n    opacity: 1;\n    top: 20px;\n  }\n`;\n```\n위와 같은 방식으로 내가 적용하고 싶은 효과를 작성하고\n\n```javascript\nconst Box = styled.div`\n    width: 100px;\n    height: 100px;\n    border-radius: 50px;\n    background: green;\n    position: absolute;\n    top: 20px;\n    left: 20px;\n    animation: ${boxFade} 2s 1s infinite linear alternate;\n  `;\n```\n기존에 작성해 두었던 style에 마지막 부분같이 추가하면 된다.\n변수명 같은 것도 정리해 두고 싶었는데 이건 다음에...\n\n### 2. 참조\n<hr/>\n스파르타 코딩클럽 리액트 기초반 4주차 강의자료\n\n\n\n\n",
    "created_at": "2022-07-08T06:50:59.562Z",
    "updated_at": "2026-01-09T21:13:46.377Z",
    "url_slug": "Til",
    "tags": [
      "React",
      "TIL"
    ]
  },
  {
    "id": "2a00ce3e-e619-4f8e-9d6b-e35796fce80e",
    "title": "항해 X 동북 ICT 19일차",
    "short_description": "항해 19일차 일지.",
    "body": "&nbsp 주특기 숙련주차가 시작됬다. 예상한 대로 이번주 개인 프로젝트는 리덕스를 사용하는 프로젝트 였고 프로젝트 주제는 나만의 사전을 구현하는 것이였다. 과제를 확인한 후 간단하게 팀 S.A를 마치고 지난주 개인 프로젝트를 핑계로 미뤄 두었던 강의를 마저 듣었다.\n\n&nbsp 이번 주는 다행히 지난주처럼 개인 S.A가 있지는 않아서 조금 여유로운 시작이였다. 일단 이번주 계획은 늦어도 내일까지는 강의를 마무리 한 후 일요일부터는 프로젝트를 시작할 예정이다. 지난 주에는 강의도 듣고 주말에 일도 있어서 프로젝트를 늦게 시작해서 문제가 생길 뻔한만큼 이번 주는 여유롭게 시작해서 빨리 끝내고 다음 강의를 듣는 것이 주특기 숙련주차의 목표이다.\n\n&nbsp 시간이 나면 프로그래머스에서 알고리즘 문제도 더 풀어보려고 한다. 알고리즘 주차가 2주차 있어서 정말 다행이라고 생각하는 것이 메소드나 코드를 작성할 때 로직같은 것을 생각하는 능력이 훨씬 올라간 것 같은 느낌이였다. 또 새로운 한주가 시작된 만큼 다시 마음을 다잡고 이번주도 열심히 해야겠다.",
    "created_at": "2022-07-08T06:50:44.506Z",
    "updated_at": "2025-11-25T17:05:21.818Z",
    "url_slug": "항해-X-동북-ICT-19일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "813e05d5-a368-4198-a6bc-e4108beb5f11",
    "title": "TIL - DOM과 서버리스",
    "short_description": " DOM과 서버리스",
    "body": "### 0. 들어가기 앞서\n<hr>\n\n&nbsp DOM의 관한 내용자체가 워낙 방대하기 때문에 DOM의 구조 접근 및 수정 등의 자세한 내용은 추후에 다루도록 하고 오늘은 간단하게 DOM이 무엇이고 왜 필요한지에 대해 다뤄 보겠다.\n\n\n\n### 1. DOM이란 무엇인가?\n<hr>\n\n&nbsp Web Browser에는 Web 문서를 해석할 수 있는 Rendering engine이 존재한다. 만약 Browser로 HTML 파일을 열게 된다면 Rendering engine은 HTML 문서를 해석하게 되는데 해석이 종료되면 해석한 문서를 객체화하여 JavaScript에 접근할 수 있도록 해주는 것을DOM(문서 객체 모델 : the Docomunet Object Model)이라고 한다.\n<p>\n<img src = \"https://transang.me/content/images/size/w2000/2021/04/0_I-8CPuSMOLxXmCTB.png\" width = \"40%\" height = \"60%\">\n</p>\n\n\n<center>\n\n  \nWeb Engine 예시 차례대로 Firefox(gecko), Chrome(blink), Safari(webkit)\n\n  \n</center>\n\n\n\n### 2. DOM의 구조\n<Hr>\n\n```html\n<!DOCTYPE html>\n<html lang=\"en\">\n    <head>\n        <meta charset=\"UTF*8\"/>\n    </head>\n    <body>\n        <h1>title</h1>\n        <p>this is title</p>\n        <div>\n            <ul>\n                <li>test1</li>\n                <li>test2</li>\n                <li>test3</li>\n            </ul>\n        </div>\n    </body>\n</html>\n```\n&nbsp 위의 HTML 문서를 예시로 들자면 head tag 안에는 meta tag가 body tag 안에는 각각 h1, p, div tag가 존재하는 것을 알 수 있다. 이런 식으로 모든 HTML 문서는 하나의 부모 tag 와 n개의 자식 tag를 가지게 되는 구조를 가지게 되는데 이것을 DOM Tree라고 한다._(각각의 요소들은 node라고 한다.)_ \n\n  \n  \n![](https://velog.velcdn.com/images/blaze096/post/1fb9b299-6f5c-4c8f-b8a8-1563f7f26bbc/image.png)\n  \n  \n  \n<center>\n  \n  (Google에 검색해본 Dom Tree)  \n  위에서 부터 아래로 뻗어나가는 모습이 나무 같다해서 지어진 이름이다.\n  \n  \n</center>\n  \n  \n  \n<br/>\n<br/>  \n  \n  \n&nbsp DOM Tree에 최상위 node는 document 객체이며 document 객체는 웹페이지 그 자체를 의미한다. DOM Tree의 최상위 node와 자식 node는 다음과 같은 방법으로 확인해 볼수 있다.\n\n  \n  ![](https://velog.velcdn.com/images/blaze096/post/92afae42-34c4-43bb-9797-ceacd294e38b/image.png)\n\n\n### 3. DOM은 왜 필요한가?\n<hr>\n  \n&nbsp HTML 코드는 정적인 코드이다. 정적인 코드는 사용자와의 상호작용이 어렵기 때문에 사용자와 상호작용을 가능하도록 하는 역할을 하는 매개체가 필요한데 이 역할을 DOM이 수행한다. JavaScript를 사용해 웹 화면에 콘텐츠 추가 및 삭제와 여러가지 이벤트등의 동작을 구현하면 JavaScirpt 파일이 아닌 DOM에 그 결과가 반영되며 그 내용을 기초로 Web browser화면이 다시 rendering 돼 우리가 구현한 동작을 볼 수 있게 된다.\n\n  \n### 4. 서버리스(Serverless Architecture)란?\n<hr>![](https://velog.velcdn.com/images/blaze096/post/2ec34aa7-4bf4-450d-b0e4-c511eb524e47/image.gif)\n\n  \n&nbsp 서버리스는 문자 그대로 서버가 없다는 뜻이 아니라 개발자가 서버를 관리할 필요가 없는 아키텍처를 의미한다. 서버리스의 공통적인 특징으로는 이미 누군가가 구축해둔 서버의 일부분을 빌려서 사용하는 것이기 때문에 우리가 인프라를 구축하고 서버의 사양 등을 신경 쓸 필요가 없어져 사이드 프로젝트나 프로트타입 등을 빠르고 쉽게 출시 할 수 있게 돼 경제적으로 좋다는 특징을 가지고 있다.\n\n  \n### 5. 서버리스의 모델\n  \n<hr>  \n  \n&nbsp 서버리스의 모델은 크게 두가지로 나눌 수 있다.\n\n - Baas(Backend as a Service) ex) Firebase\n - Faas(Function as a Service) ex) AWS Lambda\n  \n&nbsp 먼저 익숙한 Baas 부터 살펴보자면 Baas는 개발에 있어 필요한 데이터 베이스, 소셜 서비스 연동, 파일 시스템 등을 API로 제공해 주는 기능을 말한다. Bass를 사용하게 되면 개발자들이 서버개발을 하지 않고 필요한 기능들을 쉽고 빠르게 구할 수 있게 해준다. 프로젝트를 진행할 시에 백엔드 개발자의 역할이 거의 필요가 없어지며 이로 인해 개발 시간을 단축 할 수 있다는 장점이 있다.\n\n&nbsp Faas는 프로젝트를 여러 개의 함수로 쪼개거나 한개의 함수로 만들어 등록하고 매우 거대하고 분산된 컴퓨팅 자원에 함수를 등록해두고 함수들이 실행되는 횟수 및 시간에 따라 비용을 내는 방식을 말한다. 서버를 하루종일 켜두는 것이 아닌 필요할 때만 함수가 호출되여 사용되는 방식이기에 경제적인 이점을 얻을 수 있으며 \n보안 및 확장성도 뛰어난 편이다.\n\n&nbsp 장점이 많은 서버리스지만 단점도 존재하는데 항시 실행중이지 않기 때문에 실행 대기 시간이 오래걸리는 편이라 실시간 서비스에는 적합하지 않으며 클라우드 서비스 업체에 도움을 받기 때문에 업체에 대한 의존성이 높아진다. 또한 디버깅이나 테스팅이 불편하는 단점도 가지고 있다.\n  \n   \n  \n\n### 6. 참조\n<hr>\n  \n  \nDOM\n\nhttps://developer.mozilla.org/ko/docs/Web/API/Document_Object_Model/Introduction\nhttps://nonipc.com/entry/DOM%EC%9D%B4%EB%9E%80  \n\n\n서버리스\n  \nhttps://velopert.com/3543\nhttps://jaehoney.tistory.com/77  \n\n\n\n",
    "created_at": "2022-07-08T01:17:43.790Z",
    "updated_at": "2026-01-09T04:26:32.726Z",
    "url_slug": "WIL-DOM과-서버리스",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "3eb11ba9-c880-47dc-97f3-96d5ed0c22ef",
    "title": "항해 X 동북 ICT 18일차",
    "short_description": "항해 18일차 일지.",
    "body": "&nbsp 주특기 입문 주차가 종료되었다. 다행히도 과제는 완성해서 배포까지 마치고 제출을 하는데 성공했다. 어제 구현하지 못했던 마지막 기능은 결국에는 리턴 값을 하나로 합친 후에 난수를 7개를 만들어 각각에 값에 뿌려준 후 평균을 구하는 것으로 해결했다. 이렇게 구현하니 보일러 플레이트가 많아져 코드도 엄청 길어졌고 가독성도 엄청 떨어졌지만 어떻게든 해결을 해본 것에 의의를 두기로 했다. 다음부터 쓸 코드라던지 구조에 대해 조금 더 생각을 하고 프로젝트를 시작하는 것으로 했다.\n\n&nbsp 과제를 제출하는 당일 오전에 프로젝트를 겨우 완성했고 배포하는데도 약간의 문제가 있었기에 아슬아슬 했었다. 다음 주에 진행할 프로젝트는 무조건 리덕스를 사용할 것 같은데 아직까지는 어려운 개념이라 걱정부터 앞서지만 잘 해결할 수 있겠지?\n\n&nbsp 아직까진 리액트도 자바스크립트도 내겐 어렵지만 어려운 것과는 별개로 구현에 성공했을 때의 성취감은 정말 기분 좋은 것 같다.",
    "created_at": "2022-07-07T11:58:45.893Z",
    "updated_at": "2025-11-25T17:05:29.396Z",
    "url_slug": "항해-X-동북-ICT-18일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "2630ee68-9bee-4820-aa71-a1d067837603",
    "title": "TIL - JSX란?",
    "short_description": "오늘 배운 것.",
    "body": "### JSX란?\n<hr>\n\n JSX(JavaSciprt XML)란? 자바스크립트의 확장 문법이며  리액트 프로젝트를 개발할 때 사용되는 문법이다. JSX를 사용하면 코드를 작성할 때 HTML 코드를 작성하는 것과 비슷하기 때문에 가독성이 높아지고 작성하기도 쉬워진다.\n\n### JSX를 사용할 때 주의해야 할 점\n<hr>\n\n1. &nbsp JSX를 사용할 때 컴포넌트에 여러개의 요소가 존재한다면 반드시 하나의 부모요소로 감싸야한다. (하나의 요소만 존재한다면 감싸지 않아도 된다.)\n2.  &nbsp JSX 내부의 자바스크립트 표현식에서는 if문 사용이 불가능하다. 그래서 조건에 따른 내용을 렌더링 해줄 때에는 삼항 연산자를 이용해야 한다.\n3.  &nbsp JSX에서 CSS 클래스를 사용할 때는 class가 아닌 className으로 설정해 주어야 한다. (id는 그대로 id값을 사용한다.)\n4.  &nbsp JSX에서 주석을 작성할 때는 {/*주석*/}의 형식으로 작성해야 한다.\n5.  &nbsp 무조건 한개의 엘리먼트를 반환해야 한다..\n6.  &nbsp JSX에서 자바스크립트 값을 가져오기 위핸 중괄호를 사용한다.\n7.  &nbsp JSX에서 인라인으로 스타일 값을 주기 위해선 CSS형식이 아닌 JSON형식으로 작성한다.\n8.  &nbsp 사용자 정의 컴포넌트는 대문자로 시작해야한다.\n9.  &nbsp map 메소드 사용시 key 속성을 부여해야 한다.\n\n\n### 출처\n<hr>\n\n**리액트를 다루는 기술(김민준) 51p~ 66p**\n",
    "created_at": "2022-07-07T06:44:20.847Z",
    "updated_at": "2026-01-10T15:25:08.179Z",
    "url_slug": "TIL-JSX란",
    "tags": [
      "JSX",
      "React",
      "TIL"
    ]
  },
  {
    "id": "879a2a61-763e-4899-b110-7fc601daa94f",
    "title": "항해 X 동북 ICT 17일차",
    "short_description": "항해 17일차 일지.",
    "body": "&nbsp 어제 구현하지 못한 개인과제의 기능을 구현하기 위해 바쁜 하루였다. 다행히도 하나는 오전중으로 마무리 지을 수 있었는데 팀원분의 도움으로 구현의 방향성을 정할 수 있어 기능을 구현 할 수 있었다. 하지만 문제는 다음 기능을 구현하는데 있었는데 코드를 작성할 때 미쳐 고려하지 못한 부분이 발목을 잡았다.\n\n&nbsp 간단하게 설명하자면 특정 기능을 구현할 때 랜덤한 난수값을 반환해서 그 값만틈 도형을 반환하는 기능을 구현했는데 그 랜덤한 난수값의 평균을 반환하는 것이 마지막으로 남은 기능이였다. 첫번째 기능을 구현할 때 컴포넌트 안에 함수를 따로 만들어서 구현을 한 것이 문제였다. 함수 안에 랜덤한 난수값을 사용해야지 평균값을 구할 수 있는데 함수안에 랜덤한 난수를 만들었기 때문에 상위 컴포넌트에서 그 값을 불러올 수가 없었던 것이다. 그래서 문제를 해결하기 위해 여러가지 방법을 고안해 봤는데\n\n\tTrouble Shooting\n    문제 : 하위요소에 있는 평균점수 값을 밖으로 내보내지 못하는 것\n    내가 생각한 해결방법 \n    1. 코드를 다시 작성한다. \n    2. 하위요소와 상위요소를 바꾼다.  \n    3. 리덕스 사용.\n    4. 각각의 실행된 함수에서 그 결과값을 추출해서 가져오기.\n&nbsp 일단 1번 방법은 가장 최후에 시도하기로 했다. 코드를 다시 작성하면 조금더 깔끔하고 다른 방법으로 작성할 수 있을 것 같았지만 제출기간이 얼마 남지 않았을 뿐만아니라 나중에 큰 프로젝트를 진행할 때 문제가 발생할 때 마다 이런 방식으로 처리할 수 없기 때문이였다. 2번 방식의 경우 상위요소에서 하위요소의 값을 가져올 수 없기 때문에 생각한 방식이였는데 그렇게 된다면 컴포넌트의 리턴값이 바뀌어서 원하는 결과를 출력할 수 없기 때문에 문제를 해결할 수 없었다. 3번 방식은 하위요소의 값을 상위요소에서 불러들여서 사용할 수 있는 방법들이였는데 아직 배우지 않은 것들이였고 이번 프로젝트 자체가 이벤트 버스나 리덕스를 사용하지 않고도 충분히 구현할 수 있는 내용이였기 때문에 사용하지 않기로 했다. 마지막 방식은 함수에서 출력된 도형의 개수를 더해서 평균을 구하려고 했는데 애초에 함수의 길이를 구한다는게 말이 안됬고 결국엔 하위요소 값을 가져와야 되서 문제를 해결할 수 없었다.\n\n&nbsp 결국에 새벽 2시가 되어서도 문제를 해결하지 못했고 결국에는 내일도 일정이 있으니 자기로 했다. 내일은 다른 방법으로 시도를 해보고 오전 중으로 문제가 해결되지 않는다면 1번 방식으로 문제를 해결할 예정이다. 끝으로 도움을 주신 팀원분과 늦은 시간까지 공부하시다가 도와주신 다른 팀의 조원분께도 감사의 인사를 드린다. 감사합니다.\n      ",
    "created_at": "2022-07-07T05:48:37.275Z",
    "updated_at": "2025-11-26T19:27:56.578Z",
    "url_slug": "항해-X-동북-ICT-17일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "1297aae1-18eb-4723-a096-bd90a815913a",
    "title": "항해 X 동북 ICT 16일차",
    "short_description": "항해 16일차 일지.",
    "body": "&nbsp 어제에 이어서 개인 과제를 진행했다. 오늘은 기필코 과제를 끝내겠다고 마음 먹었지만 이 글을 쓰는 지금도 아직 기능 2개를 구현하지 못한 상태이다. 일단 어제 발생한 문제는 생각보다 애를 먹었지만 해결 할 수 있었다. useState 훅으로 State를 관리해야 했지만 일반 Javascript로 state를 관리하려고해서 생긴 문제인 것 같았다.\n\n&nbsp 그 다음 구현해야 기능은 EventListener를 쓰면 될 거 같아서 여러 방법으로 시도해 봤으나 잘 안됬다. 아마 접근 방법은 맞는 거 같은데 사용하는 방법에서 문제가 있는 것 같다. 마지막 기능도 어떻게 구현할지는 생각이 있는데 제대로 코드를 짜서 동작시킬지는 아직 미지수다. 개인과제를 빠르게 종료하고 리액트 다음 부분을 공부하고 싶었는데 생각보다 잘 안되는 것 같다.",
    "created_at": "2022-07-05T13:09:28.473Z",
    "updated_at": "2025-11-25T17:05:46.699Z",
    "url_slug": "항해-X-동북-ICT-16일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "10d70c05-57b4-4ca8-8aa6-2a2cbb1c9ccf",
    "title": "TIL - Optional Chaining",
    "short_description": "Optional Chaining",
    "body": "### 1. Optional Chaining이란?\n<hr/>\n\n&nbsp Optional Chaining (?.)은 ES11(ECMAScript2020)에서 도입되었는데 Chaining 연산자와 유사하게 동작하지만 Chaining 연산자의 경우 '앞'의 평가 대상이 null이나 undefined인 경우 에러식을 반환하는 반면 Optional Chaining은 '앞'의 평가 대상이 **null 또는 undefined인 경우에도 undefined를 반환**해주고 그렇지 않다면 우항에 프로퍼티 참조(변수를 통해 변수값을 참조하듯이 객체의 프로퍼티에 접근해 프로퍼티 값을 참조하는 것)를 이어간다. \n\n\n### 2. Optional Chaining을 왜 사용하는가?\n<hr/>\n\n&nbsp Optional Chaining'?.'**_(?. 은 연산자가 아닌 특별한 문법 구조체[syntax construct]이다.)_**이 존재하기 이전에는 &&(And) 연산자를 사용해 실제로 해당 객체나 프로퍼티가 있는지 확인하는 방법을 사용했다. 하지만 이렇게 && 연산자를 이용해 연결해서 사용할 경우 코드가 아주 길어진다는 단점이 존재했다. 하지만 Optional Chaining은 간결한 표현식으로 작성이 가능했고 그로인해 가독성이 증가했다. 또한 속성값이 존재한다는 확실한 보증이 없는 객체를 탐색하는데 도움을 준다.\n\n\n### 3. 언제 Optional Chaining을 사용하는가?\n<hr/>\n\n&nbsp Optioanl Chaining은 프로퍼티가 없는 중첩 객체에 에러 없이 접근하고 싶을 때 사용한다.\n\n### 4. Optional Chaining의 사용방식\n<hr/>\n\n```javascript\nobj.prop // obj가 존재하면 obj.prop을 반환하고 그렇지 않다면 undefined 반환\nobj?.[prop] // obj가 존재하면 obj[prop]을 반환하고 그렇지 않다면 undefined 반환\nobj.method() // obj의 메소드가 존재하면 메소드를 실행하고 그렇지 않다면 undefined 반환\nobj?.method() // obj가 존재하면 obj.method()를 호출하고 그렇지 않다면 undefined 반환\n\n```\n\n\n### 5. Optional Chaining 사용시 주의 할 점\n<hr/>\n\n1. Optional Chaining은 선언이 완료된 변수를 대상으로만 동작한다.\n     - ?. 앞의 값은 선언이 되어 있는 상태여야 한다. 선언이 되어 있지 않다면 에러가 발생한다.\n2. Optional Chaining은 존재하지 않아도 되는 대상에만 사용해야 한다.\n3. 읽기나 삭제에는 사용가능하지만, 쓰기에는 사용 불가능하다.\n\n\n### 6. 참조\n<hr/>\n\n모던 자바스크립트 deep dive p.122\nhttps://rootjang-dev.tistory.com/2\nhttps://ko.javascript.info/optional-chaining",
    "created_at": "2022-07-05T01:08:37.912Z",
    "updated_at": "2026-01-09T13:33:10.896Z",
    "url_slug": "TIL-Optional-Chaining",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "f7bddde0-1ad9-499f-af0c-302feea78a59",
    "title": "항해 X 동북 ICT 15일차",
    "short_description": "항해 15일차 일지.",
    "body": "&nbsp 오늘은 밀린 강의를 호다닥 들어버린 후에 개인 과제를 시작했다. 뷰를 잡는 것은 어렵지 않았지만 그 이후부터가 난항이였다. 라우팅을 하는 과정에서 React-router-dom을 사용하는데 익숙치 않아서 Docs를 보고 해결하기까지 시간이 오래걸렸고 새로운 컴포넌트를 만들고 수정하는 과정이도 오래 걸렸다. 오늘 내로 못끝 낼 줄은 알았지만 하루종일 걸려서 기능을 제외한 레이아웃과 라우팅까지 밖에 못했다는게 상당히 아쉬웠다. 마지막에 기능 한개를 추가하긴 했는데 제대로 동작하지 않아 수정이 필요하다. ",
    "created_at": "2022-07-05T00:49:54.203Z",
    "updated_at": "2025-11-25T17:05:16.851Z",
    "url_slug": "항해-X-동북-ICT-x202z4pj",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "fd8a731f-a30c-4162-b3bb-b141b8b51f0d",
    "title": "항해 X 동북 ICT 14일차",
    "short_description": "항해 14일차 일지.",
    "body": "&nbsp 여자친구를 보러 서울에 다녀왔다. 어제 공부를 마친 후 바로 KTX를 타러 갔는데 항해를 시작하고 나서 집이랑 마트 헬스장을 제외하면 다녀온 곳이 없었는데 오랜만에 멀리 떠나니 기분이 좋았다.\n\n&nbsp 기차를 타고 가면서 어제 구매했던 '리액트를 다루는 기술'을 읽었다. 저번 조에 같이 계셨던 팀원 분이 강력 추천해주셨던 책인데 어제 강의를 들으면서 이해하기 힘들었던 부분이나 세세한 개념들이 잘 나와있어 공부하기 좋았다. 내일 개인과제를 할 때 도움이 될 것 같다.\n\n&nbsp 어느 덧 집에 도착하니 시계는 1시를 가리키고 있었고 짧았던 휴일이지만 내일을 위해 얼른 자기로 했다. 한달만에 여자친구도 보고오고해서 많이 충전된 주말이였다. 내일부터는 또 열심히 공부해야겠다.",
    "created_at": "2022-07-03T14:25:35.898Z",
    "updated_at": "2025-11-25T17:05:19.062Z",
    "url_slug": "항해-X-동북-ICT-14일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "602ee728-69d1-4b39-9360-8c0db097288e",
    "title": "항해 X 동북 ICT 13일차",
    "short_description": "\b항해 13일차 일지.",
    "body": "&nbsp 본격적으로 리액트를 배우기 시작했다. 어느 예상했지만 강의를 들으며 이해가 안가는 부분이 차곡차곡 쌓이기 시작했다. props나 state의 개념이라던가 라우팅을 하는 방법 등등 기본적인 부분부터 이해가 안되기 시작하니 불안한 느낌이 들었지만 생각해보니까 항해를 시작하기 전에 웹개발 종합반 강의를 들을 때도 비슷했었고 익숙하지 않아서 그런 것으로 생각하기로 했다.\n\n&nbsp  제출했던 S.A도 거의 준 과제급이였는데 이번주는 팀 과제와 개인 과제가 각각 있어 상당히 바쁠 것으로 예상된다. 팀 과제는 다행히도 이론적인 부분을 정리해서 레포트로 제출하는 것이라 공부하면서 정리하면 금방 해결 될 듯 싶은데 개인과제는 리액트를 사용하여 간단한 페이지를 구현하는 것이라 쉽지 않아 보인다. 처음 웹개발 종합반에서 숙제를 하는 느낌이랄까? 오늘은 강의를 듣는데 시간이 걸려 개인 과제를 시작하지 못했는데 늦어도 다음 주부터는 시작해야겠다.",
    "created_at": "2022-07-02T11:23:56.038Z",
    "updated_at": "2025-12-16T19:59:48.499Z",
    "url_slug": "항해-X-동북-ICT-13일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "f83ce5d6-fcce-4f93-b12d-c3b975ce5988",
    "title": "TIL - 함수 선언식과 함수 표현식",
    "short_description": "오늘 배운 것.",
    "body": "### 1. 함수 선언식\n<hr/>\n\n&nbsp 일반적으로 알고 있는 함수 정의 방법이다. 함수 선언은 function으로 시작한다. 선언된 함수는 나중 사용을 위해 저장되고 함수를 실행하고 싶다면 함수명을 호출하면 된다.\n\n```javascript\nfunction example () {\n\talert(\"선언식 예시 입니다!\")\n};\n```\n\n### 2. 함수 표현식\n<hr/>\n\n&nbsp 함수 표현식은 정의한 함수를 별도의 변수에 할당하는 것이다. \n\n```javascript\nlet example = function example () {\n\talert(\"표현식 예시 입니다!\")\n};\n```\n```javascript\nlet example = () => {\n\talert(\"표현식 예시 입니다!\")\n}; //화살표 함수는 함수 표현식의 단축형이다.\n```\n\n### 3. 함수 선언식 vs 함수 표현식\n<hr/>\n\n- 함수 선언식으로 함수를 생성하면 독립된 구문으로 존재한다.\n- 함수 표현식으로 함수를 생성하면 함수가 표현식의 일부로 존재한다.\n- 함수 선언식은 코드 블록이 실행되기 전에 미리 처리되서 **블록 내 어디든 사용할 수 있다.**\n- 함수 표현식은 실행 컨텍스트가 표현식에 닿으면 만들어진다.\n- **함수 선언식은 호이스팅에 영향을 받지만, 함수 표현식은 호이스팅의 영향을 받지 않는다.** \n\n\n### 4. 참조\n<hr/>\n스파르타 코딩클럽 리액트 심화반 1주차 3강 강의자료\n\nhttps://jsmokblog.tistory.com/27",
    "created_at": "2022-07-02T11:23:24.172Z",
    "updated_at": "2026-01-13T13:48:24.846Z",
    "url_slug": "TIL-c15d0buf",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "809dbf15-95cd-467c-968b-696181ddeae3",
    "title": "TIL - Parsing(1)",
    "short_description": "오늘 배운 것.",
    "body": "### 1. Parsing이란?\n<hr/>\n\n&nbsp Parsing은 토큰화 된 코드를 구조화하는 과정을 의미한다. 브라우저를 예시로 들자면 우리가 브라우저를 통해 화면을 보기위해서는 여러가지 단계를 거쳐야 한다. 그 단계중 하나가 Parsing인데 기본적으로 브라우저는 JavaScirpt, HTML, CSS 의 3가지 언어를 해석 할 수 있는데 이중 JavaScirpt는 따로 인터프리터가 있어 별도의 레이어에서 언어를 해석하며 HTML과 CSS는 브라우저가 읽을 수 있게 렌더링 엔진 레이어에서 브라우저 내부 포멧으로 분석하고 변환을 해주어야 한다. 이러한 작업을 토큰화라고 하며 토큰화는 브라우저 내에 있는 Lexical Scanner(어휘 분석기)가 진행하고 Pascer(Parsing을 하는 프로세서)가 해석한다.\n\n잠깐 토큰화는 그럼 무엇일까? 토큰화에 대해 간단하게 알아보자면 \n```html\n...\n<div>\n\t<p>\n\t\n  \t\"hello\"\t\n  \n\t</p>\n</div>\n...\n\n``` \n위와 같은 HTML 문서가 있을 때 코드를 토큰화해 보자면\n\n\t[\"<\",\"div\",\">\"...]\n    \n이런식으로 나타 낼 수 있다. 이렇게 의미가 있는 최소 단위로 코드를 쪼개는 것을 토큰화라고 한다.",
    "created_at": "2022-07-01T07:50:41.294Z",
    "updated_at": "2026-01-11T20:31:42.818Z",
    "url_slug": "TIL-qwx54nd0",
    "tags": [
      "TIL"
    ]
  },
  {
    "id": "bebbf27d-af6f-45f7-b0b7-b7f3229594f1",
    "title": "항해 X 동북 ICT 12일차",
    "short_description": "항해 12일차 일지.",
    "body": "## 1. JavaScript의 특성\n<hr>\n&nbsp JavaScript(이하 JS)는 느슨한 타입의 동적 언어이다. JS는 변수가 어떤 특정한 타입과 연결되지 않으며, 모든 타입으로 할당 및 재할당이 가능하고 변수 생성시 원시 변수의 타입을 미리 선언하지 않아도 된다. 이는 다른 정적 타입 언어같이 형변환에 골머리를 썩힐 일 도 없으며 클래스를 구성할 필요가 없다는 장점을 가진다. 하지만 이런 특성으로 인해 생기는 문제점이 있는데 애초에 JS는 작은 규모의 개발 목적으로 설계된 언어였기 때문에 대형 프로젝트나 협업을 진행할 때 크고 작은 문제들이 발생했다. 그 중 하나가 변수에 예상치 못한 타입이 들어왔을 때 예상치 못한 TypeError를 일으킨다는 것인데 프로젝트의 진행도가 뒷 단계 일 수록, 프로젝트의 규모가 클 수록 버그를 알 수 없거나 찾기 힘든 경우 경우가 잦아졌다.\n\n&nbsp 이러한 JS의 문제점을 보안하기 위해 만들어진 것이 TypeScript이다.(이하 TS) TS는 JS에 정적 타입 시스템을 도입한 모델로 TS를 사용함으로 인해 동적 타입을 정적으로 선언할 수 있으며 타입 유추를 통해 타입이 제어가 가능해진다. 정적 타입 언어는 런타임 이전에 타입이 올바른지에 대해 미리 검사하기 때문에 위에서 발생했던 문제점을 보완할 수 있었다.\n\n## 2. JavaScript의 자료형과 객체의 불변성\n<hr>\n\n&nbsp JS의 자료형에는 크게 기본형(Primititve)타입과 객체(Object)타입이 존재한다.\n\n#### 기본형 자료형\n\n&nbsp 기본형 자료형은 값을 그대로 할당한다. 기본적으로 데이터는 하나의 메모리를 사용해 고정된 크기로 저장되면서, 원시 데이터 값 자체를 보관하며 한 번 만든 값은 바꿀 수 없는 불변값의 성질을 지닌다.\n\n\n- Boolean 타입 : 논리적인 요소, true와 false값이 있다.\n- null 타입 : 빈 값, null 하나의 값만 가질 수 있다.\n- undefined 타입 : 값을 할당하지 않은 변수가 가지는 값.\n\nnull타입과 undefinded 타입은 공통적으로 값이 없을을 의미하지만 값의 종류가 다르다. 이것은 null과 undefinded를 '=='(Equal Operator)와 '==='(Strict Equal Operator')로 비교해 보면 알 수 있는데 Equal Operator의 경우 값이 같으면 true를 반환하고 같지 않으면 false를 반환하지만 Strict Equal Operator의 경우 값의 종류가 같은지를 비교하기 때문에 결과 값이 다르게 나온다.\n\n![](https://velog.velcdn.com/images/blaze096/post/ae7888fb-3e81-454d-85c5-d854e5dbfca2/image.png)\n\n- Number 타입 : Number는 숫자형으로 정수와 부동 소수점, Infinity 및 NaN값(NaN은 숫자가 아님을 의미하며 Infinity는 무한대를 의미한다.)을 포함하는 2가지의 타입으로 존재한다.\n- BigInt 타입 : BigInt는 JS의 숫자 원시 값이다. Number의 안전 한계를 넘어서는 큰 정수도 안전하게 저장하고 연산 할 수 있다.\n- String : 문자열 _(자바스크립트에서는 \" 또는 '중 어떤 것으로 감싸도 문자열로 만들어진다. 이스케이프 문자도 사용 가능하며 문자열끼리 이어 붙이거나 숫자를 붙일때는 + 연산자를 사용한다.)_\n- Symbol : ES 6부터 추가된 기능으로 객체 속성을 만드는 데이터 타입이다._(아직까지는 쓰임이 드물다.)\n_\n#### 객체 자료형\n&nbsp JS에서는 기본형 자료형을 제외한 모든 자료형이다. Reference 타입이라고도 하는 객체 자료형은 객체 클래스 뿐만 아니라, **배열(Array)과 함수(Funciton), 정규표현식(RegExp)**도 모두 객체에 포함된다. 객체는 중괄호를 이용하여 선언할 수 있으며 아무 값이 없는 비어있는 개체도 선언이 가능하다. 객체 자료형과 기본형 자료형의 가장 큰 차이점은 Reference(참조)에 있는데 원시 타입의 변수는 다른 변수에 값을 할당하거나 함수 인자로 넘길 때, 값을 복사하여 전달하지만, 객체는 메모리 주소를 복사시키며 값 자체는 복사되지 않아 같은 객체를 참조하게 된다. _(JS의 배열은 숫자형이나 문자열과 마찬가지로 일반적인 스크립트 언어와 크게 다른 것은 없다. 배열은 크기의 제약이 없고, 하나의 배열에 **서로 다른 타입의 변수**가 들어갈 수 있다는 특징이 있다.)_\n\n#### JavaScript 형변환\n\n&nbsp JS에서 형변환은 크게 명시적 형변환과 암묵적 형변환 크게 두가지로 나눌 수 있다. 먼저 명시적 형변환 부터 특징은 다음과 같다.\n\n- 명시적 형변환\n\n  - 개발자가 의도적으로 형변환을 하는 것.\n  - 주로 string, number, boolean 타입으로 이루어짐.\n  - Number(), parseInt(), parseFloat(), String(), Boolean() 등\n\n- 암묵적 형변환\n  - 특정 타입의 값을 기대하는 곳에 다른 타입의 값이 오면 자동으로 타입을 변환해서 사용.\n  - ![](https://velog.velcdn.com/images/blaze096/post/4ad3d829-a78b-459a-837e-3b6982e17881/image.png)\n\n#### 불변 객체를 만드는 방법\n\n&nbsp JS에서 불변 객체를 만드는 방법은 const 키워드와 Object.freeze()를 동시에 이용하면 된다. const의 경우 재할당이 불가능하게 만드는 키워드 이고 Object.freeze() 메소드의 경우 객체의 속성을 변경하지 못하기 때문에 각각 서로의 단점을 보완해 불변 객체를 만들 수 있다.\n\n![](https://velog.velcdn.com/images/blaze096/post/50ddb41d-14fc-45a0-81c5-2ec1e8980407/image.png)\n\n#### 얕은 복사와 깊은 복사\n얕은 복사(Shallow Copy)\n\n- 참조값의 복사를 의미.\n- 데이터가 생성되는 것이 아닌 데이터의 참조값을 전달하여 한 데이터를 공유하는 것._(참조값이 변경되면 원본 객체 및 복사 객체의 값도 변경 됨)_\n\n깊은 복사(Deep Copy)\n\n- 값 자체의 복사를 의미.\n- 새 주소에 담기 때문에 참조를 공유하지 않는다._(독립적인 메모리에 값 자체를 할당하여 생성하는 것)_\n- **불변 객체를 만들 때 사용 됨, 깊은 복사가 값 자체의 복사를 의미하기 때문에 깊은 복사를 해야지만 기존 객체와 동떨어진 별개의 데이터를 만들 수 있게 됨.**\n\n## 3. Hoisting, TDZ, Scope\n<hr>\n\n- Hoisting이란 함수 안에 있는 선언들을 모두 끌어 올려서 해당 함수 유효 Scope에 최상단에 선언하는 것을 말한다. Hoisting의 대상으로는 var, function, let, const 등이 있다. 부가적으로 설명하자면 함수 선언문에서는 코드를 구현한 위치와 관계없이 Hoisting이 동작하지만 함수 표현식에서는 선언과 호출 순서에 따라서 Hoisting이 동작하지 않을 수도 있다. \n\n- TDZ(Temporal Dead Zone)는 선언 전에 변수를 사용하는 것을 비허용하는 개념상의 공간을 의미한다. _(간단하게 말하지면 TDZ는 변수가 선언 되고 변수의 초기화가 이루어지기 전까지의 구간을 말한다.) _그래서 만약 TDZ 구간 때 선언되지 않거나 초기화 전인 변수를 참조하게되면 에러가 발생하게 된다.\n\n- 스코프는 변수나 함수에 접근할 수 있는 위치를 의미한다. 스코프의 종류에는 크게 전역(global) 스코프와 지역(Local)스코프가 있는데 전역 스코프의 경우 말 그대로 어느 곳이 던지 해당 변수에 접근 할 수 있따는 것을 의미하여 지역 스코프에서는 해당 지역에서만 접근 할 수 있고 그 외의 곳에서는 접근이 불가능하다. 지역 스코프는 다시 지역 스포크와 함수 스코프로 나뉘어지면 함수 스코프는 JS에서는 함수를 선언할 때마다 생성된다.\n\n      Lexical Scope (나중에 추가적으로 공부해야 될 내용)\n      렉시컬 스코프는 상위 스코프를 결정하는 방법 중 하나로 JS 채택하는 방식이다.\n      함수가 어디서 선언 되었는지에 따라 상위 스코프를 결정한다.\n    \n    \n\n\n## 4. Execution Context & Call stack\n<hr>\n\n - 실행 컨텍스트(Exectuion Context)는 실행할 코드에 제공할 환경 정보들을 모아놓은 객체를 말하며 모든 코드들은 특정한 실행 컨텍스트 내에서 실행된다. 실행 컨텍스트에는 크게 두가지가 있는데 전역 실행 컨텍스트(Global Exectuion Context)와 함수 실행 컨텍스트(Function Exectuion Context)가 있다. 전역 실행 컨텍스트는 JS 파일이 엔진에 의해 처음 로드 되었을 때 실행되는 환경이며 함수 실행 컨텍스트는 함수가 호출되고 실행되면서 해당 함수 안에서 생성되는 컨텍스트로 각각의 함수는 고유의 함수안에서 생성된다. \n - 콜 스택(Call Stack)은 코드가 실행되면서 생성되는 실행 컨텍스트를 저장하는 자료구조를 의미하며 JS는 가장 위에 쌓여 있는 콘텍스트를 실행하는 식으로 전체 코드의 환경과 순서를 보장한다.\n\n## 5. Scope Chain, 변수 은닉화\n<hr>\n\n- Scope Chain이란 해당 코드 레벨에 참조값이 없다면 상위 레벨의 스코프로 참조 값을 찾아 나가는 현상을 말한다.\n\n- 변수 은닉화는 외부 객체로부터 '속성 값'을 감추는 것을 말하며 # 접두사를 이용해 클래스에 private 속성을 만듬으로서 설정 할 수 있다. _(예전에는 JS에서 private 클래스를 만들 수 없어 Closure을 이용한 방법이나 다른 대안들을 사용했었다고 한다.)_\n\n## 4. 실습 과제\n<hr>\n\n    문제\n    \n    콘솔에 찍힐 b 값을 예상해보고, 어디에서 선언된 “b”가 몇번째 라인에서 호출한 console.log에 찍혔는지,\n    왜 그런지 설명해보세요. 주석을 풀어보고 오류가 난다면 왜 오류가 나는 지 설명하고 오류를 수정해보세요.\n\n![](https://velog.velcdn.com/images/blaze096/post/257e1ebf-7577-4565-980a-c067e8709c93/image.png)\n\n    예측 값 1, 1 101, 1\n    실제 값 1, 1 101, 1\n\n&nbsp 첫 번째로 선언한 let b가 첫번째 1값이며 두번째는 hi() 함수를 실행시켰기 때문에 a = 1 b = 100인데 ++로 1을 더해주었기 때문에 101이 나왔고 마지막은 첫번째와 같다.\n\n&nbsp 주석을 푼다면 오류가 발생하는데 이는 a변수가 function 내에서 선언된 변수이기 때문에 함수 스코프에 위치하고 있기 때문이다. 정상적으로 코드를 실행시키기 위해선 함수 밖에 전역 변수로 a를 선언해주면 된다.\n\n\n\n## 5. 참조\n<hr>\n\n- https://velog.io/@brick/JavaScript-%EB%8A%90%EC%8A%A8%ED%95%9C-%ED%83%80%EC%9E%85loosely-typed%EC%9D%98-%EB%8F%99%EC%A0%81dynamic-%EC%96%B8%EC%96%B4\n\n- https://developer.mozilla.org/ko/docs/Web/JavaScript/Data_structures\n\n- https://velog.io/@jayjungzzzz/%EA%B8%B0%EB%B3%B8%ED%98%95%EA%B3%BC-%EC%B0%B8%EC%A1%B0%ED%98%95%EC%9D%98-%EC%A2%85%EB%A5%98-%EB%B0%8F-%EC%B0%A8%EC%9D%B4%EC%A0%90\n\n- https://medium.com/@su_bak/javascript-%EC%8A%A4%EC%BD%94%ED%94%84-scope-%EB%9E%80-bc761cba1023\n\n- https://velog.io/@wonseok2877/%EC%9E%90%EB%B0%94%EC%8A%A4%ED%81%AC%EB%A6%BD%ED%8A%B8-%EC%97%94%EC%A7%84-%EC%8B%A4%ED%96%89-%EC%BB%A8%ED%85%8D%EC%8A%A4%ED%8A%B8%EC%99%80-%EC%BD%9C-%EC%8A%A4%ED%83%9D\n\n- https://ui.toast.com/weekly-pick/ko_20200312\n\n<hr>\n\n&nbsp 주특기 주차가 시작됬다. 이번 주는 주특기 입문 주차로 React에 관련된 간단한 내용을 배우는 주차이다. 하지만 처음부터 난항을 겪었는데 그 중 하나가 위에 작성한 S.A이다. 그동안 S.A가 쉬운편이라 별생각을 안하고 있었는데 작성을 하다보니 생각보다 다뤄야할 내용도 많고 이해가 안되는 부분이 많아서 시간이 오래 걸렸다.",
    "created_at": "2022-07-01T00:51:16.865Z",
    "updated_at": "2025-11-27T02:13:29.653Z",
    "url_slug": "항해-X-동북-ICT-12일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "6f340d35-8621-4cd3-899b-be1ef3145cc9",
    "title": "TIL - BOM과 CSSOM",
    "short_description": "오늘 배운 것.",
    "body": "### 1. BOM\n<hr/>\n\n&nbsp BOM(Brower Object Model)은 호스트인 브라우저가 제공하는 추가 객체를 말한다. navigator, location, confirm, alert 등이 이에 속한다. DOM으로 통합해서 칭하기도 한다.\n\n### 2. CSSOM\n<hr/>\n\n&nbsp CSSOM(CSS Object Model)은 CSS의 내용을 파싱하여 자료를 구조화 한 것을 말한다. CSSOM도 DOM과 마찬가지로 트리구조를 가지고 있는데 이는 CSS가 기본적으로 하향식으로 규칙을 적용하기 때문이다.\n\n\n### 3. 참조\n<hr/>\n\nhttps://itworldyo.tistory.com/151\n스파르타 코딩클럽 리액트 심화반 강의자료 1주차 5강",
    "created_at": "2022-06-30T12:10:20.792Z",
    "updated_at": "2026-01-09T04:41:47.511Z",
    "url_slug": "TIL-to270hwy",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "c3813aaa-650a-48e5-8ae3-3e1cd23f9bc0",
    "title": "항해 X 동북 ICT 11일차",
    "short_description": "항해  11일차 일지.",
    "body": "&nbsp 알고리즘 주차가 종료 되었다. 오늘은 마지막 남은 5문제에 대해 다루었다. 푼 문제들은 다음과 같다.\n\n1. 폰켓몬\n2. [1차] 비밀지도\n3. 키패드 누르기\n4. [1차] 다트 게임\n5. 크레인 인형뽑기 게임\n\n&nbsp 오늘 푼 문제들은 그동안 풀었던 문제들에 비해 난이도가 있었다. 3번 키패드 누르기의 경우 결국 풀지는 못하였고 풀이를 보고나서도 완벽하게 이해하지 못하였다. 나머지는 어떻게든 풀긴 풀었는데 썩 마음에 드는 풀이는 아니였다. 그 이후론 알고리즘 시험이 있었다. 시험 문제의 난이도는 그동안 푼 문제들의 중간정도 되었지만 문제를 풀다가 계속 오류가 나서 당황해 시간이 오래 걸렸다. 나중에 보니 오타가 중간 중간에 있었는데 IDE를 사용하지 않고 푼 바람에 그 부분을 못보고 당황에서 그런 거 같았다. 실제 코테에서는 IDE 사용을 못하게 하는 곳도 있다고 하는 것 같아 다음부터는 조심해야겠다.\n\n&nbsp 이렇게 알고리즘 주차가 종료 되었는데 지난 주와 마찬가지로 아쉬운 점이 많았다. 팀원 분들의 문제푸는 속도를 따라가지 못한 적도 많고 문제를 못 푼적도 있다. 마지막에 와서는 문제를 접근은 했지만 실력이 모자라서 못 푼 문제도 있고 다시 한번 부족함을 느끼는 주였고 앞으로 더 열심히 할 동기부여가 되는 주였다. 끝으로 이번 주에 함께한 팀원 분들께 감사를 전하고 싶다.",
    "created_at": "2022-06-30T12:10:01.006Z",
    "updated_at": "2025-11-25T17:05:29.375Z",
    "url_slug": "항해-X-동북-ICT-11일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "7b372b0e-d378-4819-981b-6fc2e3c8d8a9",
    "title": "코딩 테스트 연습 - 자연수 뒤집어 배열로 만들기",
    "short_description": "코딩 테스트 연습 - 자연수 뒤집어 배열로 만들기",
    "body": "## 문제\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/5b7702b5-9aeb-448f-a4c8-513b0ea104e0/image.png)\n\n## 풀이\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/49134bf5-7c32-4c13-86fc-a8f03cf59185/image.png)\n\n&nbsp 우선 n이 숫자이고 배열이 아니기 때문에 String 메소드를 통해 문자열로 바꾸어 준 후 Array 메소드로 배열로 변경하였다 그 이후 내림차순으로 정렬한 값을 map 메소드를 통해 숫자로 변경하였다.\n\n### 1. String()\n<hr>\n\n- String 전역 객체는 문자열을 생성한다.\n\n### 2. string()의 문법\n<hr>\n\n&nbsp String(thing)\n- thing : 문자열로 변환할 아무 값\n\n### 3. sort()\n\n&nbsp sort 함수는 배열을 정렬한다. 이번 문제같은 경우는 내림차순으로 정렬을 해야 되서 위와 같이 사용하였다.",
    "created_at": "2022-06-29T13:30:05.101Z",
    "updated_at": "2026-01-06T05:27:23.369Z",
    "url_slug": "코딩-테스트-연습-자연수-뒤집어-배열로-만들기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "f3678eb7-fa77-439b-8e4b-822f7190284b",
    "title": "코딩 테스트 연습 - 자릿수 더하기",
    "short_description": "코딩 테스트 연습 - 자릿수 더하기",
    "body": "## 문제\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/8457e592-498d-49c0-9a47-88a4cd811e23/image.png)\n\n\n## 풀이\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/25fcefcc-dbd2-4466-a010-74efd9bc734a/image.png)\n\n&nbsp for문을 n의 길이만큼 돌리기 위해 n값을 먼저 문자로 변환해 주었다. 그 이후에 for문을 통해 인덱스에 i번째 값부터 마지막 까지 돌린 후 parseInt 메소드를 통해 ![](https://velog.velcdn.com/images/blaze096/post/1d3d1846-a7ec-4fc8-9973-277450677b92/image.png)\n![](https://velog.velcdn.com/images/blaze096/post/cbf4a2e6-9faf-4d86-bdad-798898ef2484/image.png)\n![](https://velog.velcdn.com/images/blaze096/post/e7e04eb7-d691-461c-8bec-a475cf38c30f/image.png)\n![](https://velog.velcdn.com/images/blaze096/post/983ba351-ebcb-4e9d-9013-5ce9a25e659c/image.png)\n![](https://velog.velcdn.com/images/blaze096/post/6878efc6-889b-4fb5-870c-068b2fa284ee/image.png)\n정수로 변환했다. ",
    "created_at": "2022-06-29T13:23:24.079Z",
    "updated_at": "2025-12-14T00:10:33.108Z",
    "url_slug": "코딩-테스트-연습-자릿수-더하기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "f9c2f931-34e5-4317-bd7d-67b2d6ba1a4f",
    "title": "코딩 테스트 연습 - 정수 제곱근 판별",
    "short_description": "코딩 테스트 연습 - 정수 제곱근 판별\n",
    "body": "## 문제\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/cf9afefb-90f6-43e3-b3d5-ed8131007477/image.png)\n\n\n## 풀이\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/8cccb699-00f1-410e-a561-bee659597a26/image.png)\n\n\n&nbsp Math 메소드를 사용하였다. Math.sqrt(n)은 제곱근을 반환하는 메소드로 n의 제곱근을 a 변수에 두었다. 그 이후 if문을 통해 정수 인지 아닌지 판별했다.",
    "created_at": "2022-06-29T13:18:24.281Z",
    "updated_at": "2025-11-04T09:03:27.896Z",
    "url_slug": "코딩-테스트-연습-정수-제곱근-판별",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "ff27f4be-fb80-42ac-803f-3a376210f24b",
    "title": "코딩 테스트 연습 - 2016년",
    "short_description": "코딩 테스트 연습 - 2016년",
    "body": "## 문제\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/67310e37-9a45-48cc-8aaf-ede42806956a/image.png)\n\n\n## 풀이\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/9c376786-3ff5-444c-8ee4-88b97f04ddd7/image.png)\n\n&nbsp 인덱스를 이용하는 방시으로 풀었다. a값에는 월 b값에는 일이 들어오는데 인덱스의 특성 때문에 a에서 -을 감해줬고 그 월의 값을 today라는 변수에 더해주었다.\n\n## 다른 풀이\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/a438efa3-01ff-45de-a477-1d53a853abb4/image.png)\n\n![](https://velog.velcdn.com/images/blaze096/post/4b33352a-10c2-4e53-86a4-8f1a67bb8887/image.png)\n",
    "created_at": "2022-06-29T11:48:43.453Z",
    "updated_at": "2025-12-18T04:42:52.256Z",
    "url_slug": "코딩-테스트-연습-2016년",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "d646b7e8-3900-4dbf-a096-72547d22310b",
    "title": "코딩 테스트 연습 - 부족한 금액 계산하기",
    "short_description": "코딩 테스트 연습 - 부족한 금액 계산하기 ",
    "body": "## 문제\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/09d8768f-2efc-40f5-8067-b55ff9568e23/image.png)\n\n## 해답\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/4496974f-4e80-4f82-9e7e-a13ea6397e9f/image.png)\n\n&nbsp for문을 이용하여 증가는 금액을 howmuch에 담아 주었고 총 이용료에서 가지고 있는 돈을 감했을 때 영보다 작다면 그것은 돈이 충분하다는 말이 되므로 0을 출력하고 그렇지 않을 경우 모자란 돈 만큼 출력하게 했다.\n\n![](https://velog.velcdn.com/images/blaze096/post/04dae0f8-9828-4634-935f-8cf86c8f8068/image.png)\n",
    "created_at": "2022-06-29T11:33:27.626Z",
    "updated_at": "2025-12-25T09:23:18.752Z",
    "url_slug": "코딩-테스트-연습-부족한-금액-계산하기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "2f611559-528b-46ed-b1f4-14f0f8dfbb4c",
    "title": "코딩 테스트 연습 - x만큼 간격이 있는 n개의 숫자",
    "short_description": "코딩 테스트 연습 - x만큼 간격이 있는 n개의 숫자\n",
    "body": "## 문제\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/d1cdcb39-838a-4e3d-994a-a13ed2d1fcac/image.png)\n\n## 해답\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/1bf743d5-48e7-4ce7-a676-c877e6b403b5/image.png)\n\n",
    "created_at": "2022-06-29T11:29:00.846Z",
    "updated_at": "2025-09-25T18:08:08.768Z",
    "url_slug": "코딩-테스트-연습-x만큼-간격이-있는-n개의-숫자",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "6018e268-dd4e-4508-b0fe-14a31be93c03",
    "title": "코딩 테스트 연습 - 행렬의 덧셈",
    "short_description": "코딩 테스트 연습 - 행렬의 덧셈",
    "body": "## 문제\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/40bfb965-299b-43e3-ac79-39a31a05fff1/image.png)\n## 해답\n<hr>\n\n\n![](https://velog.velcdn.com/images/blaze096/post/86205861-e630-411d-ae99-43a6e1a96a22/image.png)\n\n",
    "created_at": "2022-06-29T11:26:53.106Z",
    "updated_at": "2025-11-17T05:23:47.057Z",
    "url_slug": "코딩-테스트-연습-행렬의-덧셈",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "ba4093a8-2c41-443b-b8aa-fd4edd806157",
    "title": "TIL - JavaScript(1)",
    "short_description": "JavaScript(1)",
    "body": "## 1. JavaScript의 특성\n<hr>\n&nbsp JavaScript(이하 JS)는 느슨한 타입의 동적 언어이다. JS는 변수가 어떤 특정한 타입과 연결되지 않으며, 모든 타입으로 할당 및 재할당이 가능하고 변수 생성시 원시 변수의 타입을 미리 선언하지 않아도 된다. 이는 다른 정적 타입 언어같이 형변환에 골머리를 썩힐 일 도 없으며 클래스를 구성할 필요가 없다는 장점을 가진다. 하지만 이런 특성으로 인해 생기는 문제점이 있는데 애초에 JS는 작은 규모의 개발 목적으로 설계된 언어였기 때문에 대형 프로젝트나 협업을 진행할 때 크고 작은 문제들이 발생했다. 그 중 하나가 변수에 예상치 못한 타입이 들어왔을 때 예상치 못한 TypeError를 일으킨다는 것인데 프로젝트의 진행도가 뒷 단계 일 수록, 프로젝트의 규모가 클 수록 버그를 알 수 없거나 찾기 힘든 경우 경우가 잦아졌다.\n\n&nbsp 이러한 JS의 문제점을 보안하기 위해 만들어진 것이 TypeScript이다.(이하 TS) TS는 JS에 정적 타입 시스템을 도입한 모델로 TS를 사용함으로 인해 동적 타입을 정적으로 선언할 수 있으며 타입 유추를 통해 타입이 제어가 가능해진다. 정적 타입 언어는 런타임 이전에 타입이 올바른지에 대해 미리 검사하기 때문에 위에서 발생했던 문제점을 보완할 수 있었다.\n\n## 2. JavaScript의 자료형과 객체의 불변성\n<hr>\n\n&nbsp JS의 자료형에는 크게 기본형(Primititve)타입과 객체(Object)타입이 존재한다.\n\n#### 기본형 자료형\n\n&nbsp 기본형 자료형은 값을 그대로 할당한다. 기본적으로 데이터는 하나의 메모리를 사용해 고정된 크기로 저장되면서, 원시 데이터 값 자체를 보관하며 한 번 만든 값은 바꿀 수 없는 불변값의 성질을 지닌다.\n\n\n- Boolean 타입 : 논리적인 요소, true와 false값이 있다.\n- null 타입 : 빈 값, null 하나의 값만 가질 수 있다.\n- undefined 타입 : 값을 할당하지 않은 변수가 가지는 값.\n\nnull타입과 undefinded 타입은 공통적으로 값이 없을을 의미하지만 값의 종류가 다르다. 이것은 null과 undefinded를 '=='(Equal Operator)와 '==='(Strict Equal Operator')로 비교해 보면 알 수 있는데 Equal Operator의 경우 값이 같으면 true를 반환하고 같지 않으면 false를 반환하지만 Strict Equal Operator의 경우 값의 종류가 같은지를 비교하기 때문에 결과 값이 다르게 나온다.\n\n![](https://velog.velcdn.com/images/blaze096/post/ae7888fb-3e81-454d-85c5-d854e5dbfca2/image.png)\n\n- Number 타입 : Number는 숫자형으로 정수와 부동 소수점, Infinity 및 NaN값(NaN은 숫자가 아님을 의미하며 Infinity는 무한대를 의미한다.)을 포함하는 2가지의 타입으로 존재한다.\n- BigInt 타입 : BigInt는 JS의 숫자 원시 값이다. Number의 안전 한계를 넘어서는 큰 정수도 안전하게 저장하고 연산 할 수 있다.\n- String : 문자열 _(자바스크립트에서는 \" 또는 '중 어떤 것으로 감싸도 문자열로 만들어진다. 이스케이프 문자도 사용 가능하며 문자열끼리 이어 붙이거나 숫자를 붙일때는 + 연산자를 사용한다.)_\n- Symbol : ES 6부터 추가된 기능으로 객체 속성을 만드는 데이터 타입이다._(아직까지는 쓰임이 드물다.)\n_\n#### 객체 자료형\n&nbsp JS에서는 기본형 자료형을 제외한 모든 자료형이다. Reference 타입이라고도 하는 객체 자료형은 객체 클래스 뿐만 아니라, **배열(Array)과 함수(Funciton), 정규표현식(RegExp)**도 모두 객체에 포함된다. 객체는 중괄호를 이용하여 선언할 수 있으며 아무 값이 없는 비어있는 개체도 선언이 가능하다. 객체 자료형과 기본형 자료형의 가장 큰 차이점은 Reference(참조)에 있는데 원시 타입의 변수는 다른 변수에 값을 할당하거나 함수 인자로 넘길 때, 값을 복사하여 전달하지만, 객체는 메모리 주소를 복사시키며 값 자체는 복사되지 않아 같은 객체를 참조하게 된다. _(JS의 배열은 숫자형이나 문자열과 마찬가지로 일반적인 스크립트 언어와 크게 다른 것은 없다. 배열은 크기의 제약이 없고, 하나의 배열에 **서로 다른 타입의 변수**가 들어갈 수 있다는 특징이 있다.)_\n\n#### JavaScript 형변환\n\n&nbsp JS에서 형변환은 크게 명시적 형변환과 암묵적 형변환 크게 두가지로 나눌 수 있다. 먼저 명시적 형변환 부터 특징은 다음과 같다.\n\n- 명시적 형변환\n\n  - 개발자가 의도적으로 형변환을 하는 것.\n  - 주로 string, number, boolean 타입으로 이루어짐.\n  - Number(), parseInt(), parseFloat(), String(), Boolean() 등\n\n- 암묵적 형변환\n  - 특정 타입의 값을 기대하는 곳에 다른 타입의 값이 오면 자동으로 타입을 변환해서 사용.\n  - ![](https://velog.velcdn.com/images/blaze096/post/4ad3d829-a78b-459a-837e-3b6982e17881/image.png)\n\n#### 불변 객체를 만드는 방법\n\n&nbsp JS에서 불변 객체를 만드는 방법은 const 키워드와 Object.freeze()를 동시에 이용하면 된다. const의 경우 재할당이 불가능하게 만드는 키워드 이고 Object.freeze() 메소드의 경우 객체의 속성을 변경하지 못하기 때문에 각각 서로의 단점을 보완해 불변 객체를 만들 수 있다.\n\n![](https://velog.velcdn.com/images/blaze096/post/50ddb41d-14fc-45a0-81c5-2ec1e8980407/image.png)\n\n#### 얕은 복사와 깊은 복사\n얕은 복사(Shallow Copy)\n\n- 참조값의 복사를 의미.\n- 데이터가 생성되는 것이 아닌 데이터의 참조값을 전달하여 한 데이터를 공유하는 것._(참조값이 변경되면 원본 객체 및 복사 객체의 값도 변경 됨)_\n\n깊은 복사(Deep Copy)\n\n- 값 자체의 복사를 의미.\n- 새 주소에 담기 때문에 참조를 공유하지 않는다._(독립적인 메모리에 값 자체를 할당하여 생성하는 것)_\n- **불변 객체를 만들 때 사용 됨, 깊은 복사가 값 자체의 복사를 의미하기 때문에 깊은 복사를 해야지만 기존 객체와 동떨어진 별개의 데이터를 만들 수 있게 됨.**\n\n## 3. Hoisting, TDZ, Scope\n<hr>\n\n- Hoisting이란 함수 안에 있는 선언들을 모두 끌어 올려서 해당 함수 유효 Scope에 최상단에 선언하는 것을 말한다. Hoisting의 대상으로는 var, function, let, const 등이 있다. 부가적으로 설명하자면 함수 선언문에서는 코드를 구현한 위치와 관계없이 Hoisting이 동작하지만 함수 표현식에서는 선언과 호출 순서에 따라서 Hoisting이 동작하지 않을 수도 있다. \n\n- TDZ(Temporal Dead Zone)는 선언 전에 변수를 사용하는 것을 비허용하는 개념상의 공간을 의미한다. _(간단하게 말하지면 TDZ는 변수가 선언 되고 변수의 초기화가 이루어지기 전까지의 구간을 말한다.) _그래서 만약 TDZ 구간 때 선언되지 않거나 초기화 전인 변수를 참조하게되면 에러가 발생하게 된다.\n\n- 스코프는 변수나 함수에 접근할 수 있는 위치를 의미한다. 스코프의 종류에는 크게 전역(global) 스코프와 지역(Local)스코프가 있는데 전역 스코프의 경우 말 그대로 어느 곳이 던지 해당 변수에 접근 할 수 있따는 것을 의미하여 지역 스코프에서는 해당 지역에서만 접근 할 수 있고 그 외의 곳에서는 접근이 불가능하다. 지역 스코프는 다시 지역 스포크와 함수 스코프로 나뉘어지면 함수 스코프는 JS에서는 함수를 선언할 때마다 생성된다.\n\n      Lexical Scope (나중에 추가적으로 공부해야 될 내용)\n      렉시컬 스코프는 상위 스코프를 결정하는 방법 중 하나로 JS 채택하는 방식이다.\n      함수가 어디서 선언 되었는지에 따라 상위 스코프를 결정한다.\n    \n    \n\n\n## 4. Execution Context & Call stack\n<hr>\n\n - 실행 컨텍스트(Exectuion Context)는 실행할 코드에 제공할 환경 정보들을 모아놓은 객체를 말하며 모든 코드들은 특정한 실행 컨텍스트 내에서 실행된다. 실행 컨텍스트에는 크게 두가지가 있는데 전역 실행 컨텍스트(Global Exectuion Context)와 함수 실행 컨텍스트(Function Exectuion Context)가 있다. 전역 실행 컨텍스트는 JS 파일이 엔진에 의해 처음 로드 되었을 때 실행되는 환경이며 함수 실행 컨텍스트는 함수가 호출되고 실행되면서 해당 함수 안에서 생성되는 컨텍스트로 각각의 함수는 고유의 함수안에서 생성된다. \n - 콜 스택(Call Stack)은 코드가 실행되면서 생성되는 실행 컨텍스트를 저장하는 자료구조를 의미하며 JS는 가장 위에 쌓여 있는 콘텍스트를 실행하는 식으로 전체 코드의 환경과 순서를 보장한다.\n\n## 5. Scope Chain, 변수 은닉화\n<hr>\n\n- Scope Chain이란 해당 코드 레벨에 참조값이 없다면 상위 레벨의 스코프로 참조 값을 찾아 나가는 현상을 말한다.\n\n- 변수 은닉화는 외부 객체로부터 '속성 값'을 감추는 것을 말하며 # 접두사를 이용해 클래스에 private 속성을 만듬으로서 설정 할 수 있다. _(예전에는 JS에서 private 클래스를 만들 수 없어 Closure을 이용한 방법이나 다른 대안들을 사용했었다고 한다.)_\n\n## 4. 실습 과제\n<hr>\n\n    문제\n    \n    콘솔에 찍힐 b 값을 예상해보고, 어디에서 선언된 “b”가 몇번째 라인에서 호출한 console.log에 찍혔는지,\n    왜 그런지 설명해보세요. 주석을 풀어보고 오류가 난다면 왜 오류가 나는 지 설명하고 오류를 수정해보세요.\n\n![](https://velog.velcdn.com/images/blaze096/post/257e1ebf-7577-4565-980a-c067e8709c93/image.png)\n\n    예측 값 1, 1 101, 1\n    실제 값 1, 1 101, 1\n\n&nbsp 첫 번째로 선언한 let b가 첫번째 1값이며 두번째는 hi() 함수를 실행시켰기 때문에 a = 1 b = 100인데 ++로 1을 더해주었기 때문에 101이 나왔고 마지막은 첫번째와 같다.\n\n&nbsp 주석을 푼다면 오류가 발생하는데 이는 a변수가 function 내에서 선언된 변수이기 때문에 함수 스코프에 위치하고 있기 때문이다. 정상적으로 코드를 실행시키기 위해선 함수 밖에 전역 변수로 a를 선언해주면 된다.\n\n\n\n## 5. 참조\n<hr>\n\n- https://velog.io/@brick/JavaScript-%EB%8A%90%EC%8A%A8%ED%95%9C-%ED%83%80%EC%9E%85loosely-typed%EC%9D%98-%EB%8F%99%EC%A0%81dynamic-%EC%96%B8%EC%96%B4\n\n- https://developer.mozilla.org/ko/docs/Web/JavaScript/Data_structures\n\n- https://velog.io/@jayjungzzzz/%EA%B8%B0%EB%B3%B8%ED%98%95%EA%B3%BC-%EC%B0%B8%EC%A1%B0%ED%98%95%EC%9D%98-%EC%A2%85%EB%A5%98-%EB%B0%8F-%EC%B0%A8%EC%9D%B4%EC%A0%90\n\n- https://medium.com/@su_bak/javascript-%EC%8A%A4%EC%BD%94%ED%94%84-scope-%EB%9E%80-bc761cba1023\n\n- https://velog.io/@wonseok2877/%EC%9E%90%EB%B0%94%EC%8A%A4%ED%81%AC%EB%A6%BD%ED%8A%B8-%EC%97%94%EC%A7%84-%EC%8B%A4%ED%96%89-%EC%BB%A8%ED%85%8D%EC%8A%A4%ED%8A%B8%EC%99%80-%EC%BD%9C-%EC%8A%A4%ED%83%9D\n\n- https://ui.toast.com/weekly-pick/ko_20200312\n",
    "created_at": "2022-06-29T06:45:05.834Z",
    "updated_at": "2025-12-13T20:58:26.002Z",
    "url_slug": "TIL-JavaScript1",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "e8001e8e-b1ee-44c4-afb5-ae73a81a828a",
    "title": "항해 X 동북 ICT 10일차",
    "short_description": "항해 10일차 일지.",
    "body": "&nbsp 알고리즘 주차도 내일이면 종료된다. 이제 겨우 레벨 1문제를 간신히 해결하니 앞으로 갈길이 멀지만 언젠가는 2단계 문제도 쉽게 풀 수 있을 것이라 생각한다. 오늘은 남은 문제가 얼마 없어 6문제만 풀었다. 푼 문제들은 다음과 같다.\n\n1. 최대공약수와 최소공배수\n2. K번째 수\n3. 나머지가 1이 되는 수\n4. 소수 찾기\n5. 실패율\n6. 체육복\n\n&nbsp 4번 문제를 제외하고는 다 풀 수 있었다. 4번 문제는 풀긴 풀었지만 테스트 케이스에서 시간이 초과되는 바람에 다른 분들이 작성한 답을 보고 공부 했고. 마지막 6번 문제의 경우 특정 테스트 케이스만 틀리게 나왔는데 조원 분이 푼 답안을 보고 처음에 정렬을 해주지 않았을 때 생기는 오류라는 것을 알고 고쳐서 해결했다. 오늘도 문제들을 해결하긴 했는데 찝찝함이 남는 것은 어쩔 수 없는 것 같다. 내일 풀 문제는 오늘보다 훨씬 어려워 보이던데 잘 풀 수 있을까 모르겠다. 시작한지 2주 정도 되어가는 것 같은데 벌서 부터 피곤함이 많이 몰려온다.",
    "created_at": "2022-06-29T06:44:47.305Z",
    "updated_at": "2026-01-12T00:39:44.641Z",
    "url_slug": "항해-X-동북-ICT-10일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "88526f2b-902b-45af-8c65-f6adfbfac746",
    "title": "TIL - Callback 함수",
    "short_description": "Callback 함수",
    "body": "### 0. 들어가기 앞서\n<hr/>\n\n&nbsp map이나 filter등의 메소드를 사용하면서 콜백함수에 대한 이해가 부족하다고 느꼈다. 콜백 함수라는 개념이 여러 곳에서 사용되기 때문에 이번 기회에 확실하게 이해를 하고 넘어가려고 한다.\n\n\n### 1. Callback 함수란?\n<hr/>\n\n&nbsp Callback 함수란 이름 그대로 나중에 호출되는 함수를 말한다. 콜백함수는 코드를 통해 명시적으로 호출하는 함수가 아니라. 어떤 이벤트가 발생거나 특정 시점에 도달했을 때 시스템에 호출하는 함수를 말한다. ",
    "created_at": "2022-06-28T12:17:25.478Z",
    "updated_at": "2026-01-11T05:43:26.445Z",
    "url_slug": "TIL-Callback-함수",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "5266161d-26ff-4f1d-93fc-b5d49cf75b5b",
    "title": "항해 X 동북 ICT  9일차",
    "short_description": "항해 9일차 일지.",
    "body": "&nbsp 항해에서 알고리즘 모의고사를 친 날이였다. 걱정되는 부분이 있었는데 다행이도 쉬운 문제로 출제되서 금방 풀고 제출할 수 있었다. 오늘도 어제와 마찬가지로 9문제를 풀었다.\n\n1. 문자열 정렬하기\n2. 문자열 내 p와 y의 개수\n3. 소수 만들기\n4. 숫자 문자열과 영단어\n5. 시저 암호\n6. 신규 아이디 추천\n7. 약수의 개수와 덧셈\n8. 약수의 합\n9. 예산\n\n&nbsp 문제의 난이도는 어제와 비슷하거나 그보다 조금 낮은 듯 느껴졌다. 어제 푼 문제들의 응용을 하는 문제라 어제 배웠던 것들을 사용하니 수월하게 대부분의 문제가 해결되었다. 이 중 2번과 5번 문제는 접근법은 맞았지만 결국에는 혼자서는 해결하지 못했다. 문제의 설명을 보고나서도 이해가 잘 가지 않았는데 메소드의 사용법이나 응용 방법에서의 이해가 부족한 것 같았다.\n\n&nbsp 이제 알고리즘 주차도 얼마 남지 않았는데 아직까지 메소드에 익숙치 않아서 걱정이다. 그래서 시간이 날 때마다 MDN을 보면서 메소드에 대한 공부를 따로 해보려고 한다.",
    "created_at": "2022-06-28T12:16:06.401Z",
    "updated_at": "2025-11-25T17:05:18.398Z",
    "url_slug": "항해-X-동북-ICT-9일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "9ea6a764-64e0-409b-ab19-9b9fc4155e8a",
    "title": "코딩 테스트 연습 - 핸드폰 번호 가리기",
    "short_description": "코딩 테스트 연습 - 핸드폰 번호 가리기",
    "body": "## 문제\n<hr>\n\n![](https://velog.velcdn.com/images/blaze096/post/ed350dbf-4731-4ab1-91f0-a5917d9dbea9/image.png)\n## 해답\n<hr>\n\n\n![](https://velog.velcdn.com/images/blaze096/post/f249ea28-38e0-440a-a2c2-99929e4bbb55/image.png)\n\n&nbsp .repeat() 메소드와 .slice() 메소드를 사용한 문제였다. 뒤에 네자리를 제외한 나머지자리가 * 표시가 되어야 함으로 길이에서 4를 빼준 값만큼 반복되게 하였고 뒤에 숫자 네자리를 표현하기 위해 기존에 phone_number 매개 변수에서 .slice() 메소드를 통해 뒤에 네자리를 잘라내 더해주었다.\n\n### 1. .repeat()\n<hr>\n\n&nbsp .repeat() 메소드는 문자열을 주어준 횟수만큼 반복해 붙인 새로운 문자열을 반환한다.\n\n### 2. .repeat()의 문법\n<hr>\n\n&nbsp String.repeat(count)\n\n- count : 문자열을 반복할 횟수. 0과 양의 무한대 사이의 정수가 들어간다. _(이때 반복 횟수는양의 정수여야하고 무한대보다 작아야하며, 최대 문자열 크기를 넘어선 안된다.)_\n\n### 3. .slice()\n<hr>\n&nbsp 배열로 부터 특정 범위를 복사한 값들을 담고 있는 새로운 배열을 만드는데 사용한다.\n\n### 4. .slice()의 문법\n<hr>\n\n&nbsp String.slice(index1, index2)\n\n- index1 : 시작 인덱스 \n- index2 : 종료 인덱스\n- 시작 인덱스는 값을 포함하다 종료 인덱스 값은 포함하지 않는다.\n\n출처\n<hr>\nhttps://hianna.tistory.com/398\nhttps://developer.mozilla.org/ko/docs/Web/JavaScript/Reference/Global_Objects/String/repeat\n\n\n",
    "created_at": "2022-06-27T16:05:04.590Z",
    "updated_at": "2026-01-06T02:21:11.729Z",
    "url_slug": "코딩-테스트-연습-핸드폰-번호-가리기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "e8f56f57-468b-4821-930f-f862326d689f",
    "title": "코딩 테스트 연습 - 평균 구하기",
    "short_description": "코딩 테스트 연습 - 평균 구하기",
    "body": "![](https://velog.velcdn.com/images/blaze096/post/f2bada62-0a35-4225-afc3-dae66208fc7f/image.png)\n\n![](https://velog.velcdn.com/images/blaze096/post/78967e8a-2f8e-42a4-a271-d5bd015eec59/image.png)\n\n&nbsp 간단한 문제 였다. all이라는 매개 변수에 arr[i]값을 모두 더한후 arr의 길이로 나누었다.",
    "created_at": "2022-06-27T15:57:13.977Z",
    "updated_at": "2025-09-30T19:04:46.684Z",
    "url_slug": "코딩-테스트-연습-평균-구하기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "d1c430f6-22d4-4841-8700-97be6791f7e3",
    "title": "코딩 테스트 연습 - 음양 더하기",
    "short_description": "코딩 테스트 연습 - 음양 더하기",
    "body": "<img src = \"https://velog.velcdn.com/images/blaze096/post/13de0af9-130f-4901-9951-12e0876a70ae/image.png\">\n\n<img src = \"https://velog.velcdn.com/images/blaze096/post/0931ee2b-a8e2-425b-90a4-e9435447abda/image.png\">\n\n&nbsp 삼항 조건 연산자를 처음으로 사용해 본 문제이다. signs 이라는 매개 변수에 absolutes[i]번째 값이 참일 때는 더해주고 거짓일 때는 빼주면 되는 문제였다.\n\n### 1. 삼항 조건 연산자\n<hr>\n&nbsp 삼항 조건 연산자란? JavaScript에서 세 개의 피연산자를 취할 수 있는 유일한 연산자다. 맨 앞에 조건문이 들어가고. 그 뒤로 물음표와 조검이 참이라면 실행할 식이 물음표 뒤로 들어가며 그 뒤엔 콜론(:)이 들어가고 조건이 거짓이라면 실행할 식이 마지막에 들어간다. 보통 if 명령문의 단축 형태로 사용된다.\n\n### 2. 삼항 조건 연산자의 문법\n<hr>\ncondition ? exprlfTrue : exprlfFalse\n\n- condition : 조건문으로 들어갈 표현 식\n- exprlfTrue : condition이 참일 때 실행되는 표현 식\n- exprlfFalse : condition이 거짓일 때 실행되는 표현 식\n\n&nbsp 거짓(false) 외에도 null, NaN, 0, 공백(\"\"), undefinded 가 조건문에 false 값으로 사용이 가능하다.\n\n### 3. 연속된 조건문의 처리\n<hr>\n\n&nbsp 이건 아직 사용을 해보지 않아서 몰랐는데 else if도 대체가 된다고 한다.~~(오늘 else if로 열줄 정도 적었는데.)~~\n\n&nbsp 예제는 다음과 같다.\n\n<img src = \"https://velog.velcdn.com/images/blaze096/post/829a4960-ffe7-4683-b3c9-ed97fca138e4/image.png\">\n\n**(위의 코드는 아래코드와 동일하다.)**\n\n<img src = \"https://velog.velcdn.com/images/blaze096/post/acd6ff81-235d-4ef7-8323-4e137fb01040/image.png\">\n\n출처\n<hr>\nhttps://developer.mozilla.org/ko/docs/Web/JavaScript/Reference/Operators/Conditional_Operator\n",
    "created_at": "2022-06-27T15:40:11.776Z",
    "updated_at": "2026-01-13T11:13:32.068Z",
    "url_slug": "코딩-테스트-연습-음양-더하기-vn0ffr7u",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "ec477c89-6459-4c17-9908-a907ec371d2c",
    "title": "코딩 테스트 연습 - 없는 숫자 더하기",
    "short_description": "코딩 테스트 연습 - 없는 숫자 더하기",
    "body": "<img src = \"https://velog.velcdn.com/images/blaze096/post/961c0fdb-e049-4dda-9835-04ceaad6f029/image.png\">\n\n<img src = \"https://velog.velcdn.com/images/blaze096/post/0703ba93-0f5a-471d-8bac-c1bb2b6232d0/image.png\">\n\n&nbsp numbers 매개변수에 for으로 돌린 i값이 없을 때 answer에 그 값이 더해지게 했다. includes 메소드를 알게 되어 간단하게 푼 문제였다.\n\n### 1. .includes()\n<hr>\n\n&nbsp .includes() 메소드는 문자열이 특정 문자열을 포함하는지 확인하는 메소드이다.\n\n### 2. .includes()의 문법\n<hr>\n\n&nbsp string.includes(searchString, length)\n- searchSting : 검색할 문자열로 필수 요소 이다. 대소문자를 구별한다.\n- length : 검색을 시작할 위치. 선택요소로, 값이 없으면 전체 문자열을 대상으로 한다.\n\n출처\n<hr>\nhttps://www.codingfactory.net/10899\n",
    "created_at": "2022-06-27T15:30:47.724Z",
    "updated_at": "2025-09-25T18:08:06.333Z",
    "url_slug": "코딩-테스트-연습-없는-숫자-더하기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "219c14bd-74eb-4f20-aa0d-0e2b6b67507e",
    "title": "코딩 테스트 연습 - 문자열을 정수로 바꾸기",
    "short_description": "코딩 테스트 연습 - 문자열을 정수로 바꾸기",
    "body": "<img src = \"https://velog.velcdn.com/images/blaze096/post/c6475582-6784-4179-8b3a-80cf8d19fc26/image.png\" width = \"60%\" height = \"60%\">\n\n<img src = \"https://velog.velcdn.com/images/blaze096/post/8415cd23-e2e3-439f-ab9e-c2a33b99c572/image.png\" width = \"60%\" height = \"60%\">\n\n### 1. parseInt\n<hr>\n&nbsp parseInt 문자열을 정수로 변경하는 함수이다\n\n### 2. parseInt의 문법\n<hr>\n&nbsp parseInt(string , n)\n\n- string을 n진법일때의 값으로 변경하며 n은 옵션으로 2부터 36까지 입력 가능하다. 입력하지 않으면 10으로 처리한다.(이 문제를 풀 때까지는 몰랐는데 만약 parseInt가 10진법으로 변경하지 않는 함수였다면 나는 이문제를 틀렸을 것이다.)\n- string의 처리는 parseFloat과 같다.\n- 소수 부분은 버린다.\n- 0X로 시작하면 16진법으로 처리한다.\n\n### 3. parseFloat\n<hr>\n\n&nbsp parseFloat은 문자열을 **실수**로 변경하는 함수이다.\n\n### 4. parseFloat의 문법\n<HR>\n\n&nbsp parseFloat(string)\n\n- 수로 시작할 때 그 수를 실수로 변경한다.\n- 띄어 쓰기로 여러 개의 수가 잇으면 첫번째 수만 변경한다.\n- 공백으로 시작하면 공백은 무시한다.\n- 수가 아닌 무자로 시작하면 NaN을 반환한다.\n\n출처  \n<hr>\n  \nhttps://www.codingfactory.net/11026\n",
    "created_at": "2022-06-27T15:17:33.167Z",
    "updated_at": "2026-01-10T04:18:08.604Z",
    "url_slug": "코딩-테스트-연습-문자열을-정수로-바꾸기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "2f67e625-c439-4ac5-b934-9bff79f4b9ad",
    "title": "코딩 테스트 연습 - 두 정수 사이의 합",
    "short_description": "코딩 테스트 연습 - 두 정수 사이의 합",
    "body": "<img src = \"https://velog.velcdn.com/images/blaze096/post/911ca22f-45e8-4774-8d0f-710b56609d7d/image.png\" weight = \"60%\" height =\"60%\">\n\n<img src = \"https://velog.velcdn.com/images/blaze096/post/00e05b3c-e190-4f09-94cd-f587379c7bce/image.png\" weight = \"60%\" height =\"60%\">\n\n&nbsp Math 메소드를 이용하여 간단하게 푼 문제였다. a와 b값 중 작은 값은 min이라는 변수에 두고 큰 값을 max라는 변수에 두었다. 그리고 for문을 이용해 i를 min부터 max 돌린후 그 값을 answer에 더해주었다.\n\n",
    "created_at": "2022-06-27T15:13:25.360Z",
    "updated_at": "2025-12-17T10:03:24.349Z",
    "url_slug": "코딩-테스트-연습-두-정수-사이의-합",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "b0d3fc59-6965-427b-a08d-27262d87bf95",
    "title": "WIL - ES란 무엇인가? ",
    "short_description": "ES란 무엇인가?",
    "body": "## 1. ES의 등장배경\n <HR>\n&nbsp ES는 ECMA Script의 약자로 Java Script의 표준 규격을 의미한다. 1990년대 넷스케이프에서 개발하여 출시한 JavaScript는 웹 페이지의 동작을 향상시키는 언어로서 당시 선풍적인 인기를 끌었는데 그것을 본 MicroSoft에서도 적당히 호환되는 Jscript라는 언어를 개발하여 Internet Explorer에 탑재하게 된다. 하지만 이름은 비슷했지만 둘의 알맹이는 너무 제각각이라 개발자들이 같은 기능을 구현하더라도 해야 할일과 시간이 늘어나게 되었고 결국 넷스케이프에서 JavaScript를 ECMA(European Computer Manufactures Association)기구에 제출하여 표준으로 삼게 되었고 이후 시대 흐름에 맞게 발전시켜 지금까지 이어져 오고 있다.\n\n  \n## 2. ES 버전별 간략한 특징\n<hr>\n\n&nbsp ES는 1997년 6월 초판을 발행을 시작으로 총 12판까지 발행 되었다. 그 중 중요한 내용만 간단하게 추려보겠다.\n\n- ES1~3\n  -\tJavaScript의 가장 기본이 되는 기능(hoisting, prototype, scope)만 존재하던 버전 대\n    \n- ES4\n  - ES4를 준비하던 중 내부적으로 크게 2개의 의견으로 나뉘어 방향을 정하지 못하였는데 결국 타협점을 찾아 ES3.1은 ES5가 되었고, ES4가 될 예정이었던 사양은 ES6에 반영되게 되었다. 이에 따라 ES4는 반려됐다. 또한 이 시기쯤에 JS를 활용해 웹 애플리케이션을 동적으로 제작 가능하게 되어 jQuery, Dojo, Prototype.js 및 Ajax가 만들어졌다.\n\t\n- ES5\n\n  - JSON 지원 및 Array에 forEach, map, filter, reduce, some, every등의 메소드가 추가 되었고 Object에 대한 getter 및 setter를 지원하게 되었다. 또한 엄격 모드가 추가되었는데 엄격 모드가 추가 됨으로서 기존에 너무 자유롭던 코드에서 일부 코드를 사용하지 못하게 막고 동시에 더 많은 예외를 제공하여 프로그래머들이 더욱 안전한 코드를 작성할 수 있는 환경이 마련되었다.\n\n- ES6\n  - 가장 큰 변화는 기존의 function-level scope가 아닌 block-level scope를 지원하는 let과 const가 추가되었다. 기존에는 상수형 키워드가 없어 CONST_TEST와 같이 대문자로 상수임을 표시했다면, ES 6부턴 const 키워드를 통해 값의 변경을 통제하게 되었다. \n  \n  \n## 3. ES5와 ES6의 차이\n<hr> \n   \n \n\n- 화살표 함수(Arrow Function)가 추가되어 함수를 간결하게 나타낼 수 있게 되었다.\n - block-level-scope를 가지며 재할당이 가능한 let, const 키워드가 추가 되었다.\n  \n- 원래는 인자가 없거나 undefined인 경우 들어 갈 기본 값을 설정해 놓았어야 됬는데 기본 매개 변수(Default parameter) 추가로 인해 지정한 기본 값을 인자로 전달할 수 있게 되었다.\n\n- Template literal 추가로 인해 ``(back tic)을 사용하여 여러 라인의 문자열도 쉽게 사용이 가능해졌다. _(${name} 표시를 통해 JavaScript 표현식을 삽입 가능하다.)_\n\n - Multi-line string 추가로 ``(back tic)을 사용하여 여러 줄의 문자열을 처리하기 수월해졌다.\n\n- String Method(includes/포함되어 있는 지, startsWith/시작되는지, endWith/끝나는 지)의 추가 결과 값은 true/false로 리턴되며 검사 로직 수행 가능해 졌다.\n\n- 객체 정의 방식의 개선 되었다. 속성과 값이 같으면 1개만 기입이 가능하며 속성에 함수를 정의 할 때 function을 생략 가능하게 되었다.\n  \n- Class의 추가로 객체 지향 프로그래밍이 가능해 졌고 ES5에서 보다 더 간결하고 편하게 코드를작성 할 수 있게 되었다.\n  \n- Module의 추가로 코드의 재사용이 간편해 졌다. Moudle을 사용하면 하나의 파일에 다른 파일의 코드를 불러 올 수 있다. import, from, export, default 등의 전용 키워드를 사용해 가독성을 높였고 비동기 방식으로 작동해 성능과 메모리 부분에서 유리하다는 장점이 있다.\n  \n- 구조 분해 할당(Destructuring Assignment)의 추가로 배열이나 객체의 요소를 해체하여 별개의 변수로 추출 할 수 있게 되었다.\n  \n- 비동기 처리에 사용되는 객체인 Promise가 추가 되었다.\n  \n\n  \n## 4. 참조\n<hr>\n\n- https://stackoverflow.com/questions/4269150/what-is-ecmascript\n  \n- https://medium.com/sjk5766/ecma-script-es-%EC%A0%95%EB%A6%AC%EC%99%80-%EB%B2%84%EC%A0%84%EB%B3%84-%ED%8A%B9%EC%A7%95-77715f696dcb\nhttps://wangchunsik.tistory.com/13\n- https://joshua1988.github.io/web-development/javascript/promise-for-beginners/  \n  ",
    "created_at": "2022-06-27T11:16:17.541Z",
    "updated_at": "2025-12-31T07:13:28.664Z",
    "url_slug": "WIL-ES란-무엇인가",
    "tags": [
      "JavaScript"
    ]
  },
  {
    "id": "e2957215-0c8f-4664-b09c-4847280c5cbb",
    "title": "항해 X 동북 ICT 8일차",
    "short_description": "항해 8일차 일지.",
    "body": "&nbsp 알고리즘 문제를 풀어 갈 수록 난이도가 점점 올라가 생각하는 시간이 길어지는데 오늘은 다행히 대부분의 문제를 풀 수 있었다. 오늘 풀어본 문제는 다음과 같다.\n\n1. 제일 작은 수 제거하기\n2. 콜라츠 추측\n3. 햐샤드 수\n4. 3진법 뒤집기\n5. 최소직사각형\n6. 같은 숫자는 싫어\n7. 두 개 뽑아서 더하기\n8. 로또의 순위\n9. 모의고사\n\n&nbsp 총 9문제로 이중 나는 1, 4, 7번을 담당했다. 지난 주와 다르게 8번을 제외하고는 풀 수 있었는데 문제를 잘못 이해하고 문제를 풀어서 모든 테스트 케이스를 통과하지 못했다. 그래도 메소드체이닝이나 자료구조에 대해 조금은 더 이해하고 문제를 풀어서 그런지 알고리즘 문제에 접근하는 것이 한결 쉬워진 것 같다. 내일은 알고리즘 테스트를 친다는데 잘 치려나 모르겠다.",
    "created_at": "2022-06-27T10:44:20.943Z",
    "updated_at": "2025-11-25T17:05:21.207Z",
    "url_slug": "항해-X-동북-ICT-8일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "9d167939-0bc9-4bb0-b2d7-6b670724ff74",
    "title": "TIL - Var, Let, Const의 차이점",
    "short_description": "Var, Let, Const의 차이점",
    "body": "#### 1. var는 함수 레벨 스코프이고 let, const는 블록 레벨 스코프이다.\n\n 1-1 함수 레벨 스코프와 블록 레벨 스코프\n   함수 레벨 스코프(Function-level Scope)\n\t함수 내에서 선언된 변수는 함수 내에서만 유효하며 함수 외부에서는 참조할 수 없다. 즉, \t  함수 내부에서 선언한 변수는 지역 변수이며 함수 외부에서 선언한 변수는 모두 전역 변수이다.\n\n   블록 레벨 스코프(Block-level Scope)\n    모든 코드 블록(함수,if문,for문,while문,try/catch문 등)내에서 선언된 변수는 코드 블록 내에서만 유효하며 코드 블록 외부에서는 참조할 수 없다. 즉, 코드 블록 내부에서 선언한 변수는 지역 변수이다.\n\n#### 2. var로 선언한 변수는 선언 전에 사용해도 에러가 나지 않지만 let, const는 에러가 발생한다.\n\n 2-1 호이스팅이 안되서가 아니라 var, let, const, function, class 등등의 선언 키워드들은 모두 호이스팅이 되지만 var의 경우 호이스팅되면서 초기 값이 없으면 자동으로 undefined를 초기값으로 하여 메모리를 할당한다. 그래서 var의 경우 선언 전에 해당 변수를 사용하려고 해도 메모리에 해당 변수가 존재하기 때문에 에러가 발생하지 않는 것이며 이는 메모리 누수 발생의 원인이 되므로 var 사용은 지양해야 한다.\n let, const의 경우 호이스팅이 되면서 초기 값이 없다면 var처럼 자동으로 초기값을 할당하지 않는다. 값이 할당되기 전까지 메모리를 할당하지 않기 때문에 값이 할당되기 전에 사용하려고 하면 메모리에 해당 변수가 존재하지 않아서 에러를 발생시킨다.\n \n 2-2 TDZ(Temproal Dead Zome : 일시적 사각지대)란, 변수가 스코프의 시작 지점부터 초기화가 되는 지점까지의 변수를 참조할 수 없는 구간을 말한다.\n\n#### 3. var는 이미 선언되어있는 이름과 같은 이름으로 변수를 또 선언해도 에러가 나지 않지만 let, const는 이미 존재하는 변수와 같은 이름의 변수를 또 선언하면 에러 발생한다.\n\n#### 4. var, let은 변수 선언시 초기 값을 주지 않아도 되지만 const는 반드시 초기값을 할당해야한다.\n\n#### 5. var, let은 값을 다시 할당할 수 있지만 const는 한번 할당한 값은 변경할 수 없다.\n&nbsp 단, 객체 안에 프로퍼티가 변경되는 것까지 막지는 못한다. 만약 객체의 프로퍼티도 변경되지 않게 객체를 선언하고 싶다면 Object.freeze() 메소드를 사용 할 수 있다. 하지만 Object.freeze()는 얕은 동결이기 때문에 객체 안에 있는 또다른 객체의 프로퍼티 변경까지 동결하지는 못한다. 깊은 동결을 구현하고 싶다면 따로 함수를 만들어야 한다.\n\n",
    "created_at": "2022-06-27T10:43:44.706Z",
    "updated_at": "2026-01-06T20:51:18.628Z",
    "url_slug": "TIL-Var-Let-Const의-차이점",
    "tags": [
      "JavaScript",
      "TIL"
    ]
  },
  {
    "id": "82fa65a7-4550-475b-8e00-4613b7793b88",
    "title": "TIL - JWT와 API",
    "short_description": "JWT와 API.",
    "body": "### 1. JWT란 무엇인가?\n<hr>\n\n&nbsp JWT란 Json Web Token의 약자로 모바일 혹은 웹에서 사용자 인증을 위해 사용되는 암호화 된 토큰을 의미한다. JWT는 토큰 자체를 정보로 사용하는 Self-Contained 방식으로 정보를 안전하게 전달하며 주로 회원 인증 및 정보 전달에 사용된다.\n\n\n\n### 2. JWT의 구성\n<hr>\n&nbsp JWT는 크게 점( . )으로 구성된 세부분으로 구성되는데 이는 각각 'header', 'payload', 'signature'로 불리며 각 부분은 Base64Url로 인코딩 되어 표현된다.\n\n2.1 Header\n\n&nbsp 토큰의 첫번째 부분인 header는 typ과 alg 두 가지 정보로 구성된다. typ은 토큰의 타입을 지정하며 alg는 알고리즘에 방식을 지정하여 signature 및 토큰 검증에 사용된다.\n\n2.2 payload\n\n&nbsp 두번째 부분 페이로드에는 토큰에서 사용할 정보의 조각들인 클레임(Claim)이 담겨 있으며\n클레임은 Registered claims, Public claims, Private claim으로 나뉜다. \n\n2.3 Signature\n\n&nbsp Signature는 토큰을 인코딩하거나 유효성 검증을 할 때 사용하는 고유한 암호화 코드이다. Signature는 위에서 만든 Header와 Payload의 값을 각각 BASE64Url로 인코딩하고, 인코딩한 값을 비밀 키를 이용해 Header에서 정의한 알고리즘으로 해싱을 하고, 이 값을 다시 BASE64Url로 인코딩하여 생성한다.\n\n&nbsp 이렇게 생성된 3가지의 값을 합쳐 JWT를 만들게 된다.\n\n### 3. JWT 장단점\n<hr>\n\n#### 장점\n- 세션/쿠키 방식과 달리 서버측 부하를 낮출 수 있다.\n- 확장성 및 유지보수에도 용이하다.\n- 토큰 기반 인증 시스템에 접근이 가능히다.\n\n#### 단점\n- 서버가 아닌 클라이언트에서 token을 관리하기 때문에, 세션과 달리 변조의 위협이 생겨도 만료시간까지 토큰을 삭제하지 못한다.\n- 토큰 탈취 시, PayLoad안의 데이터가 유출될 수 있기 때문에 담을 수 있는 데이터가 한정적이다.\n- 저장할 필드 수에 따라서 토큰이 커질 수 있어 커진 필드 수 만큼 네트워크 대역폭 낭비가 심해진다.\n\n<hr>\n\n- 참조 https://jwt.io/introduction\n- 참조 https://mangkyu.tistory.com/56\n- 참조 https://velog.io/@cham/JWT-JWT란\n\n<HR>\n<HR>\n\n### 4. API란 무엇인가?\n\n<HR>\n\n&nbsp API란 Application Programming Interface의 약자로 컴퓨터와 소프트웨어를 연결하는 역할을 담당한다. 예를 들어 간단하게 설명하자면 우리가 은행에 돈을 찾으러 간다면 금고는 DB, 은행창구는 API라고 할 수 있다. 은행원이 내가 비밀번호를 모르거나 다른사람의 통장을 통해 돈을 인출하려고 한다면 거절하는 것과 같이 API도 마찬가지로 허용된 사람들에게만 DB 접근성을 부여한다. \n\n### 5. API의 역할\n  \n<HR>  \n\n4.1 위에서 설명한 것과 같이 API는 서버와 데이터베이스에 대한 창구 역할을 한다. API는 허가 받지 않은 사람이 DB에 접근하는 것을 를 방지하기 위해 여러분이 가진 서버와 데이터베이스에 대한 출입구 역할을 하며, 허용된 사람들에게만 접근성을 부여해준다.\n\n4.2 API는 애플리케이션과 기기가 데이터를 원활하게 주고 받을 수 있도록 한다.\n\n4.2 API는 모든 접속을 표준화한다. API는 모든 접속을 표준화하기 때문에 기계/운영체제 등과 상관없이 누구나 동일한 액세스를 얻을 수 있다.\n\n\n### 6. API유형\n  \n<HR>  \n\n6.1 private API : private API는 내부 API로, 회사 개발자가 자체 제품과 서비스를 개선하기 위해 내부적으로 발행하며 3자에게 노출되지 않는다.\n\n6.2 public API : public API는 개방형 API로, 모두에게 공개되며 누구나 제한 없이 API를 사용할 수 있다.\n\n6.3 partner API :partner API는 기업이 데이터 공유에 동의하는 특정인들만 사용할 수 있다. 비즈니스 관계에서 사용되는 편이며, 종종 파트너 회사 간에 소프트웨어를 통합하기 위해 사용된다.\n\n### 7. API 사용의 장점\n  \n<HR>  \n\n&nbsp Private API를 이용할 경우, 개발자들이 애플리케이션 코드를 작성하는 방법을 표준화함으로써, 간소화되고 빠른 프로세스 처리를 가능하게 한다. 또한, 소프트 웨어를 통합하고자 할 때는 개발자들 간의 협업을 용이하게 한다. public API와 partner API 를 사용하면, 기업은 타사 데이터를 활용하여 브랜드 인지도를 높일 수 있으며 뿐만 아니라 고객 데이터베이스를 확장하여 전환율까지 높일 수 있다.\n\n### 8. API 사용의 단점\n  \n<HR>  \n\n&nbsp API 사양이 변경될 때마다 조정이 필요하며. 사양변경에 대응하지 않을 경우 시스템 오류가 발생 할 수 있다.\n\n<hr>\n\n- 참조 https://aws.amazon.com/ko/what-is/api/\n- 참조 https://ko.wikipedia.org/wiki/API\n- 참조 https://blog.wishket.com/api%EB%9E%80-%EC%89%BD%EA%B2%8C-%EC%84%A4%EB%AA%85-%EA%B7%B8%EB%A6%B0%ED%81%B4%EB%9D%BC%EC%9D%B4%EC%96%B8%ED%8A%B8/\n  \n<HR>\n<HR>\n  \n\n### 9. 한주를 마치며\n  \n&nbsp 이번 한주는 정말 도움만 받은 것 같다. 웹 개발 풀스택 미니 프로젝트부터 지금 진행하고 있는 알고리즘 주차까지 누군가에 도움을 받지 않은 적이 없는 것 같다. 항해를 준비하면서부터 했어야하는 것들을 그 동안 일했던 것에 대한 보상이라는 핑계로 공부를 소홀이 한 것이 문제였을까? 20살때부터 지금까지 한번도 쉰 적이 없이 일만 했었지만 그래도 짬짬이 공부는 할 수 있었을텐데 말이다. 늘 블로그에 글을 적을 때마다 말하지만 부족함을 느끼며 열심히 하려고 한다. 그리고 그간 지나갔던 팀원분들과 현재의 팀원분들께 감사하다는 인사를 드리고 싶다.\n  \n&nbsp 이번 주에 배운 것은 수도 없이 많은 것 같다. github를 제대로 사용하는 법부터 시작해서 현재에 Javascript의 메소드의 사용 방법 간단한 것으로는 지금 작성하고 있는 벨로그의 기반인 MD을 작성하는 법까지 말이다. 이러한 내용들은 나중에 블로그에 TIL로 정리하려고 한다.",
    "created_at": "2022-06-26T11:31:15.833Z",
    "updated_at": "2026-01-09T22:15:51.071Z",
    "url_slug": "TIL-JWT와-API",
    "tags": [
      "TIL"
    ]
  },
  {
    "id": "f6d33999-f5a7-4c5e-adb3-3ac90056e28d",
    "title": "항해 X 동북 ICT 7일차",
    "short_description": "항해 7일차 일지.",
    "body": "&nbsp 항해를 시작하고 처음을 맞는 휴일이였다. 오늘 일지에는 기술적인 내용을 담아보려고 했는데 그 부분은 WIL에 정리를 해보았다. 적당히 쉬는시간을 가지면서 알고리즘 문제도 정리하고 월요일에 풀어 볼 문제도 미리 풀어 보았는데 쉽지는 않은 것 같다.",
    "created_at": "2022-06-26T07:47:50.056Z",
    "updated_at": "2025-11-25T17:05:24.616Z",
    "url_slug": "항해-X-동북-ICT-7일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "af60af69-c2c4-4a2b-a2cf-e3bf107b9f97",
    "title": "항해 X 동북 ICT 6일차",
    "short_description": "항해 6일차 일지.",
    "body": "&nbsp 오늘도 어제와 마찬가지로 알고리즘 문제를 풀었다. 오늘 푼 문제는 어제보다 난이도가 있어 각자 3문제씩 담당하고 총 9문제를 풀었다. 푼 문제들은 다음과 같다.\n\n1. 2016년\n2. 나누어 떨어지는 숫자 배열\n3. 수박수박수박수\n4. 완주하지 못한 선수\n5. 이상한 문자 만들기\n6. 자릿수 더하기\n7. 자연수 뒤집어 배열로 만들기\n8. 정수 내림차순으로 배치하기\n9. 정수 제곱근 판별\n\n&nbsp 난이도가 있는 문제라 접근이 어려울 것이라 예상했지만 역시나 총 9문제 중 2문제는 풀지도 못했고 3문제 정도는 풀이를 보고 나서야 겨우 접근 할 수 있었다. 어제 남는시간에 Javascript 기초와 메소드와 관해 공부를 했지만 하루만에 적용해보기에는 조금 어려움이 있었다. 다행히 팀원분들이 친절하게 설명해주셔서 잘 넘어 갈 수 있었던 것 같다. 팀원분들께 정말 감사를 드린다. \n &nbsp 지난 번 프로젝트부터 오늘까지 항해의 첫주가 끝났는데 내가 너무 받은 것만 많고 드릴 수 있는게 없어 아쉬웠다. 오는 일요일에는 푼 문제들을 정리해보고 월요일날 풀어볼 문제들을 미리 풀어볼 예정이다.",
    "created_at": "2022-06-26T07:37:38.272Z",
    "updated_at": "2025-11-25T17:05:39.554Z",
    "url_slug": "항해-X-동북ICT-6일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "2bf8cf69-398c-450e-87ef-500f4c1ac60c",
    "title": "항해 X 동북 ICT 5일차",
    "short_description": "항해 5일차 일지.",
    "body": "&nbsp 어제 미니 프로젝트를 다행이도 무사히 끝내고 오늘부터는 새로운 조원 분들과 함께 알고리즘 문제를 풀게 되었다. 알고리즘 문제는 프로그래머스에서 풀게 되었는데 백준에서는 풀어 본 적이 있으나 프로그래머스는 처음이였고 그나마 풀어본 알고리즘 문제도 python을 이용해 조금 풀어 본것이 전부라 처음부터 난항을 겪었다.\n\n&nbsp 오늘 푼 문제는 총 12문제로 팀원분들과 나누어 각자 4문제씩은 담당하고 그 이후에 본인 담당이 아닌 다른문제를 푸는 방식으로 진행했다. 풀어 본 문제들은 다음과 같다.\n\n1. 직사각형 별찍기\n2. 짝수와 홀수\n3. 가운데 글자 가져오기\n4. 두 정수 사이의 합\n5. 문자열을 정수로 바꾸기\n6. 없는 숫자 더하기\n7.  음양 더하기\n8.  평균 구하기\n9. 핸드폰 번호 가리기\n10. 행렬의 덧셈\n11. x만큼 간격이 있는 n개의 숫자\n12.  부족한 금액 계산하기\n\n&nbsp 이중 내가 담당한 문제는 1, 4, 7, 10번인데 1번 문제는 아쉽게도 풀지 못했다. 나머지 문제는 어찌어찌 해결이 되어서 다행이지만서도 항해를 진행하면서 많이 부족하단 느낌을 항상 받는건 어쩔 수 없는 문제 인 것 같다. 알고리즘 문제의 답안을 봐도 이해가 안되는 부분도 많고 부끄럽게도 프론트엔드 개발자가 되고 싶다는 사람이 Javascript의 메소드 자체를 모르고 있다던가 자료구조의 기초도 몰라서 헤매는 내 자신을 보니 한심했다. 뭐 어쩌겠는가 공부해야지. 서로 가지고 있는 무기가 다르고 환경이 다른데 아무것도 하지 않는 다면 다음 번에 같은 상황을 마주했을 때 똑같은 상황이 발생할 것이다. 더 열심히 해야겠다.",
    "created_at": "2022-06-26T07:23:42.210Z",
    "updated_at": "2025-11-25T17:05:27.314Z",
    "url_slug": "항해-X-동북-ICT-5일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "e32361f5-6c43-4199-85a0-cda0fdf96422",
    "title": "코딩 테스트 연습 - 가운데 글자 가져오기 ",
    "short_description": "코딩 테스트 연습 - 가운데 글자 가져오기",
    "body": "<img src = \"https://velog.velcdn.com/images/blaze096/post/b0ceb127-8289-4391-982e-a579ca693f2b/image.png\" width = \"60%\" height = \"60%\">\n\n<img src = \"https://velog.velcdn.com/images/blaze096/post/b5dd881e-8931-4e86-8d4b-e39ee0c34c20/image.png\" width = \"60%\" height = \"60%\">\n\n&nbsp s의 길이를 2로 나누어서 그 값이 1일 경우 문자의 개수가 홀수이기 때문에 s의 길이에서 1을 뺀 값을 2로 나눈 값에 인덱스인 2를 가지고 오게 하였고 아닌 경우 2와 3의 인덱스 값을 가지고 오게 하였다.",
    "created_at": "2022-06-24T11:08:12.902Z",
    "updated_at": "2025-10-21T07:05:01.359Z",
    "url_slug": "코딩-테스트-연습-가운데-글자-가져오기",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "8eb2d2fe-60c9-46c2-90e6-0f2db515f2bf",
    "title": "코딩 테스트 연습 - 짝수와 홀수",
    "short_description": "코딩 테스트 연습 - 짝수와 홀수",
    "body": "<img src = \"https://velog.velcdn.com/images/blaze096/post/e6cf3640-077d-4829-81ca-012bb792ebad/image.png\" width = \"60%\" height = \"60%\">\n\n<img src = \"https://velog.velcdn.com/images/blaze096/post/68d89131-0a59-4d53-843e-306e892c23ff/image.png\" width = \"60%\" height = \"60%\">\n\n&nbsp num값이 짝수인지 홀수 인지 구별하기 위해 2로 나는 후 그 나머지가 0일 경우 짝수이기 때문에 \"EVEN\"을 출력하며 그 외의 경우 \"Odd\"를 출력하게 된다.\n\n\n",
    "created_at": "2022-06-24T11:00:37.262Z",
    "updated_at": "2025-12-28T08:36:28.291Z",
    "url_slug": "코딩-테스트-연습-짝수와-홀수",
    "tags": [
      "알고리즘",
      "프로그래머스"
    ]
  },
  {
    "id": "d632a25a-8814-4c1d-9877-0cccf255f495",
    "title": "TIL - .gitigonore이란",
    "short_description": "오늘 배운 것.",
    "body": "&nbsp .gitigonore은 보안상으로 위험성이 있는 파일, 프로젝트와 관계없는 파일, 용량이 너무 커서 제외해야하는 파일등 git add에 포함시키기 싫은 경우 사용한다.\n\n&nbsp 사용방법은 의외로 간단했는데 git init을 한 폴더에 .gitignore이라는 파일을 하나 만들어 준 후 그안에 한줄 씩 제외할 파일 혹은 폴더를 쓰면 된다. \n\n![](https://velog.velcdn.com/images/blaze096/post/1c8ca6ad-82ee-4d4f-ab2c-5743adcf9ca8/image.png)\n\nhttps://www.toptal.com/developers/gitignore\n\n![](https://velog.velcdn.com/images/blaze096/post/027fd7b8-310a-42f6-a1df-d3ff49884f3d/image.png)\n\n&nbsp 위의 사이트는 .gitigonore 파일의 설정을 직접해주려면 여러가지 설정 해줘야 하는 부분도 많고. flamework나 IDE의 고유 파일들이 무엇인지 일일히 지정해주기 힘들기 때문에 만들어 진 사이트이다. 검색 부분에 자신이 사용하는 언어를 입력하고 생성을 하면\n![](https://velog.velcdn.com/images/blaze096/post/a4779ff9-b440-4cdf-ad82-8ebc8c6dc684/image.png)\n\n&nbsp 이런식으로 만들어 주는데 이 부분을 복사하여 자신의 프로젝트 파일에 있는 .gitignore파일에 붙여넣으면 끝이다.\n\n&nbsp 저번 미니 프로젝트에서도 사용됬던 기능이라고 하는데 몰랐었다. 조금 더 내가 참여 한 프로젝트에 관심이 필요한 것 같다.",
    "created_at": "2022-06-24T10:23:09.141Z",
    "updated_at": "2025-12-21T05:59:02.372Z",
    "url_slug": "TIL-.gitigonore이란",
    "tags": [
      "TIL",
      "git"
    ]
  },
  {
    "id": "b849251a-8328-4e0b-b820-d784f7e39728",
    "title": "항해 X 동북 ICT 4일차",
    "short_description": "항해 4일차 일지.",
    "body": "&nbsp 오늘은 탈퇴한 회원을 구분해서 로그인이 안되게 하는 방법을 구현했다. \n\n![](https://velog.velcdn.com/images/blaze096/post/c43436cc-0430-4226-8ce5-859759a365a4/image.png)\n\n&nbsp 처음 회원 가입시에 기존에 받았던 아이디나 비밀번호, 생년월일 등의 변수에 \"is_quit\" 이라는 변수를 추가하여 회원가입 시 0을 주고 탈퇴 시 DB에서 변수 값이 1로 바뀌게 설정했다. 그래서 처음에 값을 가져올때 DB에서 찾아온 ID와 비밀번호가 None이 아니면서 변수가 0인 값을 가져오도록 변경하는 것으로 기능을 구현했다.\n\n&nbsp 풀스택 미니프로젝트가 종료 됬다. 처음으로 하는 프로젝트라 어려움이 많았고 부족한 부분들을 많이 느꼈다. 내가 쓴 코드 설명도 제대로 못해주고 도움만 많이 받아 감사하면서도 죄송하다. 좋은 팀원 분들을 만나지 못했더라면 끝까지 해결하지 못했을 것이다. 나도 언젠가는 남들에게 도움을 줄 수 있는 개발자가 되도록 노력해야 겠다.\n\n&nbsp 11조 분들 모두 수고하셨습니다. 감사합니다.\n\n~~미니 프로젝트 URL : http://terrarium.today/ (현재는 폐쇄되었습니다.)~~\n\n\n\n \n ",
    "created_at": "2022-06-24T10:12:32.395Z",
    "updated_at": "2025-11-25T17:05:25.943Z",
    "url_slug": "항해-X-동북-ICT-4일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "fac20d17-c8ea-442d-b812-11c13c8f28bc",
    "title": "항해 X 동북 ICT 3일차",
    "short_description": "항해 3일차 일지.",
    "body": "&nbsp 오늘은 구현한 로그인 기능에 이것 저것 추가 시키는 일을 해보려고 했다. 첫 번째로 시도 했던 것은 로그인 페이지에서 아이디와 비밀번호를 입력한 후 회원 가입 버튼을 눌렀을 시 회원가입페이지에서 아이디와 비밀번호가 그대로 나오는 현상이였다.\n\n![](https://velog.velcdn.com/images/blaze096/post/34d8f105-d649-456e-8e15-2a1c853b2279/image.png)\n\n![](https://velog.velcdn.com/images/blaze096/post/6cc76e54-3e63-4c57-89e5-7c5de3d9b3d8/image.png)\n\n&nbsp 이 현상은 회원가입 버튼을 클릭시 다른 페이지로 넘어가는 것이 아닌 숨겨져 있던 토글을 가져오는 것이 였기 때문에 발생했다.\n\n![](https://velog.velcdn.com/images/blaze096/post/d37b8ec4-ac40-4c7e-819b-dae0330fbfaf/image.png)\n\n&nbsp 첫 번째로 시도 했던 방법은 취소 버튼을 클릭 할 시 다시 로그인 페이지로 돌아갈때 input 되있던 값의 val을 공란으로 두는 것이였다. 하지만 이 방법으로 시도 했을 때에 회원가입을 눌렀을 때에 비밀번호와 아이디 값이 초기화 되는 현상이 발생했다. 문제가 해결 되진 않았으나 기능 상에 문제는 없었기에 일단은 다른 기능을 구현하기로 했다.\n\n&nbsp 두 번째로 추가할 기능은 홈페이지의 제작이였다.\n\n![](https://velog.velcdn.com/images/blaze096/post/80f270c4-1c21-47b7-b5d4-0108ceb30181/image.png)\n\n&nbsp 상단에 존재하는 nav_bar에 버튼을 넣을 때 항상 오른쪽으로 보이기 설정하고 싶었는데 margin으로 설정해서 오른쪽에 표시되게 하니 나와 다른 화면에서 보는 사람들에게는 버튼이 안보이거나 버튼에 위치가 다르게 보이는 현상이 생겼다. 그래서 절댓값으로 버튼의 위치를 고정함으로써 해결했다.\n \n \n ![](https://velog.velcdn.com/images/blaze096/post/0acb5e84-5e68-4e91-ab8f-1539d6d7b162/image.png)\n \n\n&nbsp 중간 중간마다 강의를 들으면서 진행하려니까 생각한 것 보다 많은 진행이 어려웠다. 내일은 탈퇴한 회원을 구별하는 변수 값을 두어 회원 탈퇴를 하였을 때 로그인이 되지 않게 하는 기능을 구현 할 예정이다. 내일 프로젝트를 제출해야 되는데 꼭 제 시간 내에 해결해서 제출에 차질이 없도록 해야겠다.\n\n\n\n\n\n",
    "created_at": "2022-06-24T09:54:01.348Z",
    "updated_at": "2025-11-25T17:05:16.082Z",
    "url_slug": "항해-X-동북-ICT-3일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "2f3d2e6a-eb5b-4d68-8982-b132a0a1b7bb",
    "title": "항해 X 동북 ICT 2일차",
    "short_description": "항해 2일차 일지.",
    "body": "&nbsp 오늘은 작성한 와이어프레임을 바탕으로 본격적으로 페이지를 제작하기 시작했다. 다행이도 항해측에서 제공받은 인터넷 강의를 통해 비교적 수월하게 작업 할 수 있었다.\n\n&nbsp 로그인 기능을 구현한 후 뭔가 허전한거 같아 동생에게 로고작업을 부탁했다. 동생이 잘 해줘서 우리의 서비스를 잘 보여줄 수 있는 로고가 나와 다행이였다.\n\n![](https://velog.velcdn.com/images/blaze096/post/e39aa349-cbd9-45f3-aae3-55a35344e175/image.png)\n\n&nbsp 하지만 문제는 그 이후에 발생했다. localhost에서 기능이 정상적으로 돌아가는 것을 확인한 후에 팀원들과 db를 하나로 합치기 위해 db주소를 변경했는데 그 이후로 **회원가입정보가 db로 넘어가지 않게 됬다.** 문제를 고치기 위해 다른 팀원분들도 많이 도와주셨는데 정말 감사할 따름이였다. 이 문제는 결국 해결하지는 못했는데 아직 로그인 페이지나 회원가입에서 구현하고 싶은 기능들이 많아서 내일 오전중으로는 마무리 지으려고 한다.\n  \n",
    "created_at": "2022-06-22T07:48:38.549Z",
    "updated_at": "2025-11-25T17:05:16.728Z",
    "url_slug": "항해-X-동북-ICT-2일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  },
  {
    "id": "5f7f05e8-1e8a-40d9-a2a3-41109f0457aa",
    "title": "항해 X 동북 ICT 1일차",
    "short_description": "항해 1일차 일지.",
    "body": " &nbsp 처음 웹개발 종합반 강의를 지급 받고 한달. 본격적으로 항해가 시작되었다. 첫 주차는 풀스택 미니 프로젝트 제작으로 시작했다.\n \n &nbsp 우리 조는 회의 끝에 반려식물 자랑이라는 주제로 커뮤니티를 제작하기로 했다. 그 이후 와이어 프레임 제작을 통해 홈페이지를 어떻게 제작할 지 구상 했으며 Rest API를 작성 했다. 우리 조의 와이어 프레임과 API는 다음과 같다.\n\n<h3>WireFlame</h3>\n<img src = \"https://raw.githubusercontent.com/Backseungchan/terrarium/d91dceb8fce0b59a70f8bdc9c7ce474b66e65a44/%EC%99%80%EC%9D%B4%EC%96%B4%ED%94%84%EB%A0%88%EC%9E%84.svg\"/>\n\n<h3>Rest API</h3>\n<img src = \"https://user-images.githubusercontent.com/103014298/174975346-b2a6452a-7c8e-470d-a5c6-6f6370dcda8e.jpg\n\"/>\n  \n &nbsp 아직은 1주차라 백엔드와 프론트엔드의 구분이 나누어지진 않았고 각자 선호하는 부분을 맡아서 제작하기로 했는데 다행히도 팀원분의 배려 덕분에 나는 원래 하고 싶었던 로그인, 회원가입과 홈페이지를 맡게 되었다. 오늘 단 하루 밖에 해보지 않았지만 내가 부족하다는 것을 뼈져리게 느낀 하루였다. 전공자분들과 '쉬운 내용에서는 어느 정도 대화가 통하지 않을까?'는 오만이였던 것 같다. 부족한 만큼 더 분발해야 겠다.   \n\n\n",
    "created_at": "2022-06-21T00:00:52.420Z",
    "updated_at": "2025-12-30T08:46:43.494Z",
    "url_slug": "항해-X-동북-1CT-1일차",
    "tags": [
      "초보개발자",
      "프론트엔드",
      "항해99"
    ]
  }
]